README.org
#+TITLE: Emacs Configuration
#+AUTHOR: Toby Slight
#+PROPERTY: header-args :cache yes
#+PROPERTY: header-args+ :mkdirp yes
#+PROPERTY: header-args+ :results silent
#+PROPERTY: header-args+ :tangle ~/.emacs.d/init.el
#+PROPERTY: header-args+ :tangle-mode (identity #o644)
#+OPTIONS: broken-links:t
#+OPTIONS: toc:t

A fairly standard [[https://en.wikipedia.org/wiki/Literate_programming][literate]] Emacs configuration using [[https://orgmode.org/][Org mode]].

Quickest way to get setup is to back up your current config:

#+begin_src shell :tangle no
  mv ~/.emacs.d{,.bak}
#+end_src

Then clone this repo to replace it:

#+begin_src shell :tangle no
  git clone https://gitlab.com/tspub/lisp/emacs ~/.emacs.d
#+end_src

Alternatively you can clone to a different location and ~org-babel-tangle~ this
file with ~C-c C-v t~ whilst visiting this file.

That will copy all the source code blocks in this file and overwrite whatever
you have in your ~$HOME/.emacs.d/early-init.el~ and ~$HOME/.emacs.d/init.el~
files, so make sure you've backed up anything you don't want to lose!

* Early Init

From ~/etc/NEWS~

#+begin_quote
Emacs can now be configured using an early init file. The file is called
early-init.el, in user-emacs-directory. It is loaded very early in the startup
process: before graphical elements such as the tool bar are initialized, and
before the package manager is initialized. The primary purpose is to allow
customizing how the package system is initialized given that initialization now
happens before loading the regular init file (see below).

We recommend against putting any customizations in this file that don't need to
be set up before initializing installed add-on packages, because the early init
file is read too early into the startup process, and some important parts of
the Emacs session, such as 'window-system' and other GUI features, are not yet
set up, which could make some customization fail to work.
#+end_quote

