README.html
<!doctype html>
<html lang="en">
<head>
<title>Emacs Configuration</title>
<!-- 2020-12-24 Thu 05:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Toby Slight">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Early Init</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Turn off unnecessary UI frills</a></li>
<li><a href="#sec-1-2">1.2. Setup up package.el</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Doom startup speed hacks setup</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Avoid garbage collection at startup</a></li>
<li><a href="#sec-2-2">2.2. Unset file-name-handler-alist temporarily</a></li>
</ul>
</li>
<li><a href="#sec-3">3. General Settings</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Auto-save</a></li>
<li><a href="#sec-3-2">3.2. Backups</a></li>
<li><a href="#sec-3-3">3.3. Bell</a></li>
<li><a href="#sec-3-4">3.4. Clipboard</a></li>
<li><a href="#sec-3-5">3.5. Line numbers</a></li>
<li><a href="#sec-3-6">3.6. Text filling</a></li>
<li><a href="#sec-3-7">3.7. Delete all on backspace</a></li>
<li><a href="#sec-3-8">3.8. Emacsclient executable</a></li>
<li><a href="#sec-3-9">3.9. No lockfiles</a></li>
<li><a href="#sec-3-10">3.10. Final newline</a></li>
<li><a href="#sec-3-11">3.11. Pop mark on repeat</a></li>
<li><a href="#sec-3-12">3.12. Encryption</a></li>
<li><a href="#sec-3-13">3.13. History</a></li>
<li><a href="#sec-3-14">3.14. Bookmarks</a></li>
<li><a href="#sec-3-15">3.15. Custom settings in /tmp</a></li>
<li><a href="#sec-3-16">3.16. Enable all advanced features</a></li>
<li><a href="#sec-3-17">3.17. Increase message logging max</a></li>
<li><a href="#sec-3-18">3.18. More extensive apropos</a></li>
<li><a href="#sec-3-19">3.19. Mouse yank at point</a></li>
<li><a href="#sec-3-20">3.20. Scrolling</a></li>
<li><a href="#sec-3-21">3.21. Initial startup</a></li>
<li><a href="#sec-3-22">3.22. Passwords</a></li>
<li><a href="#sec-3-23">3.23. Undo limits</a></li>
<li><a href="#sec-3-24">3.24. Uniquify</a></li>
<li><a href="#sec-3-25">3.25. User info</a></li>
<li><a href="#sec-3-26">3.26. Windows</a></li>
<li><a href="#sec-3-27">3.27. Yes or no</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Code Style</a></li>
<li><a href="#sec-5">5. Encoding stuff</a></li>
<li><a href="#sec-6">6. Hooks</a></li>
<li><a href="#sec-7">7. Keybindings</a>
<ul class="nav">
<li><a href="#sec-7-1">7.1. Buffer keybindings</a></li>
<li><a href="#sec-7-2">7.2. Toggle menu bar</a></li>
<li><a href="#sec-7-3">7.3. Frame maximizing and fullscreening</a></li>
<li><a href="#sec-7-4">7.4. Desktop read &amp; save bindings</a></li>
<li><a href="#sec-7-5">7.5. Grep binding</a></li>
<li><a href="#sec-7-6">7.6. Calculator/Calc bindings</a></li>
<li><a href="#sec-7-7">7.7. Toggle stuff</a></li>
<li><a href="#sec-7-8">7.8. Tab-bar mode bindings (Emacs 27+)</a></li>
<li><a href="#sec-7-9">7.9. Special mode keys (help, etc)</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Registers</a></li>
<li><a href="#sec-9">9. Theme/UI</a></li>
<li><a href="#sec-10">10. Buffer functions</a>
<ul class="nav">
<li><a href="#sec-10-1">10.1. Indent Buffer</a></li>
<li><a href="#sec-10-2">10.2. Kill this buffer</a></li>
<li><a href="#sec-10-3">10.3. Last buffer</a></li>
<li><a href="#sec-10-4">10.4. Nuke buffers</a></li>
<li><a href="#sec-10-5">10.5. Remove stuff from a buffer</a></li>
<li><a href="#sec-10-6">10.6. Save buffers silently</a></li>
<li><a href="#sec-10-7">10.7. Toggle maximize buffer</a></li>
</ul>
</li>
<li><a href="#sec-11">11. Complilation related</a>
<ul class="nav">
<li><a href="#sec-11-1">11.1. Prefer newer over compiled</a></li>
<li><a href="#sec-11-2">11.2. Place point after complilation error</a></li>
<li><a href="#sec-11-3">11.3. Ensure init files are byte compiled</a></li>
<li><a href="#sec-11-4">11.4. Recompile config</a></li>
<li><a href="#sec-11-5">11.5. Auto recompile Emacs Lisp</a></li>
<li><a href="#sec-11-6">11.6. Make compilation buffers more colorful</a></li>
</ul>
</li>
<li><a href="#sec-12">12. Editing functions</a>
<ul class="nav">
<li><a href="#sec-12-1">12.1. Aligning symbols</a></li>
<li><a href="#sec-12-2">12.2. Change numbers</a></li>
<li><a href="#sec-12-3">12.3. Delete inside delimiters</a></li>
<li><a href="#sec-12-4">12.4. Generate a numbered list</a></li>
<li><a href="#sec-12-5">12.5. Smart that the default functions</a>
<ul class="nav">
<li><a href="#sec-12-5-1">12.5.1. Fill or unfill</a></li>
<li><a href="#sec-12-5-2">12.5.2. Narrow or widen DWIM</a></li>
<li><a href="#sec-12-5-3">12.5.3. Beginning of line</a></li>
<li><a href="#sec-12-5-4">12.5.4. Kill ring save</a></li>
<li><a href="#sec-12-5-5">12.5.5. Kill region</a></li>
</ul>
</li>
<li><a href="#sec-12-6">12.6. Case insensitive sort-lines</a></li>
<li><a href="#sec-12-7">12.7. Surround stuff</a></li>
<li><a href="#sec-12-8">12.8. Untabify a buffer</a></li>
<li><a href="#sec-12-9">12.9. XML pretty print</a></li>
<li><a href="#sec-12-10">12.10. Yank pop forwards</a></li>
<li><a href="#sec-12-11">12.11. Editing related keyboard built-in keybindings</a></li>
<li><a href="#sec-12-12">12.12. DWIM replacements for changing case</a></li>
</ul>
</li>
<li><a href="#sec-13">13. File manipulation functions</a>
<ul class="nav">
<li><a href="#sec-13-1">13.1. Delete this file</a></li>
<li><a href="#sec-13-2">13.2. Yank current file name to kill ring</a></li>
<li><a href="#sec-13-3">13.3. Make backup of current file</a></li>
<li><a href="#sec-13-4">13.4. Rename file and buffer</a></li>
<li><a href="#sec-13-5">13.5. Open current file as root</a></li>
</ul>
</li>
<li><a href="#sec-14">14. Miscellaneous functions</a></li>
<li><a href="#sec-15">15. Window manipulation functions</a>
<ul class="nav">
<li><a href="#sec-15-1">15.1. Kill buffer other window</a></li>
<li><a href="#sec-15-2">15.2. Toggle focus to last window</a></li>
<li><a href="#sec-15-3">15.3. Open a buffer in another window</a></li>
<li><a href="#sec-15-4">15.4. Switch to the previous window</a></li>
<li><a href="#sec-15-5">15.5. Scroll lines up like Ctrl-e in Vim</a></li>
<li><a href="#sec-15-6">15.6. Scroll lines down like Ctrl-y in Vim</a></li>
<li><a href="#sec-15-7">15.7. Open last buffer in horizontal split</a></li>
<li><a href="#sec-15-8">15.8. Open last buffer in vertical split</a></li>
<li><a href="#sec-15-9">15.9. Toggle vertical -&gt; horizontal splits</a></li>
<li><a href="#sec-15-10">15.10. Transpose windows</a></li>
<li><a href="#sec-15-11">15.11. Windmove keybindings</a></li>
<li><a href="#sec-15-12">15.12. Winner mode</a></li>
<li><a href="#sec-15-13">15.13. Scroll other window down</a></li>
</ul>
</li>
<li><a href="#sec-16">16. Emacs built in package configuration</a>
<ul class="nav">
<li><a href="#sec-16-1">16.1. Auto-revert</a></li>
<li><a href="#sec-16-2">16.2. Dabbrev</a></li>
<li><a href="#sec-16-3">16.3. Dired</a>
<ul class="nav">
<li><a href="#sec-16-3-1">16.3.1. Dired AUX</a></li>
<li><a href="#sec-16-3-2">16.3.2. Find Dired</a></li>
<li><a href="#sec-16-3-3">16.3.3. Writeable Dired</a></li>
</ul>
</li>
<li><a href="#sec-16-4">16.4. Doc View</a></li>
<li><a href="#sec-16-5">16.5. Ediff</a></li>
<li><a href="#sec-16-6">16.6. Electric</a></li>
<li><a href="#sec-16-7">16.7. ERC</a></li>
<li><a href="#sec-16-8">16.8. Eshell</a></li>
<li><a href="#sec-16-9">16.9. Gnus</a></li>
<li><a href="#sec-16-10">16.10. Highlight changes</a></li>
<li><a href="#sec-16-11">16.11. Hippie Expand</a></li>
<li><a href="#sec-16-12">16.12. Icomplete</a>
<ul class="nav">
<li><a href="#sec-16-12-1">16.12.1. Change completion styles</a></li>
<li><a href="#sec-16-12-2">16.12.2. Icomplete settings</a></li>
<li><a href="#sec-16-12-3">16.12.3. Icomplete keybindings</a></li>
</ul>
</li>
<li><a href="#sec-16-13">16.13. Imenu</a></li>
<li><a href="#sec-16-14">16.14. Isearch</a></li>
<li><a href="#sec-16-15">16.15. Minibuffer</a>
<ul class="nav">
<li><a href="#sec-16-15-1">16.15.1. Save history mode</a></li>
<li><a href="#sec-16-15-2">16.15.2. Completion framework settings</a></li>
<li><a href="#sec-16-15-3">16.15.3. Misc Minibuffer settings</a></li>
</ul>
</li>
<li><a href="#sec-16-16">16.16. Org</a>
<ul class="nav">
<li><a href="#sec-16-16-1">16.16.1. Org global bindings</a></li>
</ul>
</li>
<li><a href="#sec-16-17">16.17. Pending delete</a></li>
<li><a href="#sec-16-18">16.18. Prettify Symbols</a></li>
<li><a href="#sec-16-19">16.19. Recentf</a></li>
<li><a href="#sec-16-20">16.20. Show paren</a></li>
<li><a href="#sec-16-21">16.21. Saveplace</a></li>
<li><a href="#sec-16-22">16.22. Shell script</a></li>
<li><a href="#sec-16-23">16.23. Subword</a></li>
<li><a href="#sec-16-24">16.24. Term</a>
<ul class="nav">
<li><a href="#sec-16-24-1">16.24.1. ANSI Term launcher</a></li>
<li><a href="#sec-16-24-2">16.24.2. Switch to ANSI Term</a></li>
<li><a href="#sec-16-24-3">16.24.3. Lazy load</a></li>
<li><a href="#sec-16-24-4">16.24.4. Set term coding system to UTF-8</a></li>
</ul>
</li>
<li><a href="#sec-16-25">16.25. Tramp</a></li>
<li><a href="#sec-16-26">16.26. Version Control</a></li>
<li><a href="#sec-16-27">16.27. Whitespace</a></li>
</ul>
</li>
<li><a href="#sec-17">17. Third party package configuration</a>
<ul class="nav">
<li><a href="#sec-17-1">17.1. Setup package.el and use-package</a></li>
<li><a href="#sec-17-2">17.2. Ansible</a></li>
<li><a href="#sec-17-3">17.3. Async</a></li>
<li><a href="#sec-17-4">17.4. Blacken</a></li>
<li><a href="#sec-17-5">17.5. Default text scaling</a></li>
<li><a href="#sec-17-6">17.6. Diminish</a></li>
<li><a href="#sec-17-7">17.7. Docker</a></li>
<li><a href="#sec-17-8">17.8. Exec path from shell</a></li>
<li><a href="#sec-17-9">17.9. Flycheck</a></li>
<li><a href="#sec-17-10">17.10. Git</a>
<ul class="nav">
<li><a href="#sec-17-10-1">17.10.1. Git Timemachine</a></li>
<li><a href="#sec-17-10-2">17.10.2. Gitlab CI</a></li>
<li><a href="#sec-17-10-3">17.10.3. Lazygit</a></li>
<li><a href="#sec-17-10-4">17.10.4. Magit</a></li>
</ul>
</li>
<li><a href="#sec-17-11">17.11. Go mode</a></li>
<li><a href="#sec-17-12">17.12. Hungry delete</a></li>
<li><a href="#sec-17-13">17.13. JS2 mode</a></li>
<li><a href="#sec-17-14">17.14. JSON</a></li>
<li><a href="#sec-17-15">17.15. Markdown</a></li>
<li><a href="#sec-17-16">17.16. Node JS</a></li>
<li><a href="#sec-17-17">17.17. Org</a>
<ul class="nav">
<li><a href="#sec-17-17-1">17.17.1. Org Bullets</a></li>
<li><a href="#sec-17-17-2">17.17.2. HTMLize</a></li>
<li><a href="#sec-17-17-3">17.17.3. Toc Org</a></li>
<li><a href="#sec-17-17-4">17.17.4. PDF Tools</a></li>
</ul>
</li>
<li><a href="#sec-17-18">17.18. Powershell</a></li>
<li><a href="#sec-17-19">17.19. Powerline</a></li>
<li><a href="#sec-17-20">17.20. Projectile</a></li>
<li><a href="#sec-17-21">17.21. RESTClient</a></li>
<li><a href="#sec-17-22">17.22. systemd</a></li>
<li><a href="#sec-17-23">17.23. Terraform</a></li>
<li><a href="#sec-17-24">17.24. Web Mode</a></li>
<li><a href="#sec-17-25">17.25. Writeable Grep</a></li>
<li><a href="#sec-17-26">17.26. Which Key</a></li>
<li><a href="#sec-17-27">17.27. YAML</a></li>
<li><a href="#sec-17-28">17.28. Yasnippet</a>
<ul class="nav">
<li><a href="#sec-17-28-1">17.28.1. Snippets</a></li>
<li><a href="#sec-17-28-2">17.28.2. Classic snippets</a></li>
<li><a href="#sec-17-28-3">17.28.3. Custom Yasnippet snippets</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Emacs Configuration</h1>
<p>
A fairly standard <a href="https://en.wikipedia.org/wiki/Literate_programming">literate</a> Emacs configuration using <a href="https://orgmode.org/">Org mode</a>.
</p>

<p>
Quickest way to get setup is to back up your current config:
</p>

<div class="org-src-container">

<pre class="src src-shell">mv ~/.emacs.d{,.bak}
</pre>
</div>

<p>
Then clone this repo to replace it:
</p>

<div class="org-src-container">

<pre class="src src-shell">git clone https://gitlab.com/tspub/lisp/emacs ~/.emacs.d
</pre>
</div>

<p>
Alternatively you can clone to a different location and <code>org-babel-tangle</code> this
file with <code>C-c C-v t</code> whilst visiting this file.
</p>

<p>
That will copy all the source code blocks in this file and overwrite whatever
you have in your <code>$HOME/.emacs.d/early-init.el</code> and <code>$HOME/.emacs.d/init.el</code>
files, so make sure you've backed up anything you don't want to lose!
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Early Init</h2>
<div class="outline-text-2" id="text-1">
<p>
From <code>/etc/NEWS</code>
</p>

<blockquote>
<p>
Emacs can now be configured using an early init file. The file is called
early-init.el, in user-emacs-directory. It is loaded very early in the startup
process: before graphical elements such as the tool bar are initialized, and
before the package manager is initialized. The primary purpose is to allow
customizing how the package system is initialized given that initialization now
happens before loading the regular init file (see below).
</p>

<p>
We recommend against putting any customizations in this file that don't need to
be set up before initializing installed add-on packages, because the early init
file is read too early into the startup process, and some important parts of
the Emacs session, such as 'window-system' and other GUI features, are not yet
set up, which could make some customization fail to work.
</p>
</blockquote>
</div>
