README.org
** Turn off unnecessary UI frills

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (when (fboundp 'menu-bar-mode) (menu-bar-mode -1))
  (when (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
  (when (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (when (fboundp 'tooltip-mode) (tooltip-mode -1))
  (setq frame-resize-pixelwise t) ;; jwm resize fix
#+end_src

** Setup up package.el

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;; This must be true otherwise use-package won't load!
  (setq package-enable-at-startup t)
  ;; Allow loading from the package cache.
  (setq package-quickstart t)
  ;; Don't write (package-initialize) to my init file!
  (setq package--init-file-ensured t)
  ;; Setup up archives
  (setq package-archives
        '(("melpa" . "https://melpa.org/packages/")
          ("gnu" . "https://elpa.gnu.org/packages/")))
#+end_src

* Doom startup speed hacks setup

Stole this stuff from [[https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly][here]].

** Avoid garbage collection at startup

The GC can easily double startup time, so we suppress it at startup by turning
up gc-cons-threshold (and perhaps gc-cons-percentage) temporarily:

#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum ; 2^61 bytes
        gc-cons-percentage 0.6)
#+end_src

It is important to reset the garbage collection settings eventually. Not doing
so will cause garbage collection freezes during long-term interactive
use. Conversely, a gc-cons-threshold that is too small will cause
stuttering. We use 16mb as our default.

#+begin_src emacs-lisp
  (defun my/default-gc-cons-settings ()
    (setq gc-cons-threshold 16777216 ; 16mb
          gc-cons-percentage 0.1))
  (add-hook 'emacs-startup-hook 'my/default-gc-cons-settings)
#+end_src

** Unset file-name-handler-alist temporarily

Emacs consults this variable every time a file is read or library loaded, or
when certain functions in the file API are used (like expand-file-name or
file-truename).

Emacs does this to check if a special handler is needed to read that file, but
none of them are (typically) necessary at startup, so we disable them
(temporarily!):

#+begin_src emacs-lisp
  (defvar my/default-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
#+end_src

Don’t forget to restore file-name-handler-alist, otherwise TRAMP won’t work and
compressed/encrypted files won’t open.

#+begin_src emacs-lisp
  (defun my/restore-default-file-name-handler-alist ()
    (setq file-name-handler-alist my/default-file-name-handler-alist))
  (add-hook 'emacs-startup-hook 'my/restore-default-file-name-handler-alist)
#+end_src

* General Settings
** Auto-save

#+begin_src emacs-lisp
  (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
  (setq auto-save-timeout 5)
#+end_src

** Backups

#+begin_src emacs-lisp
  (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
  (setq backup-by-copying t) ;; copy files, don't rename them.
  (setq delete-old-versions t)
  (setq kept-new-versions 12)
  (setq kept-old-versions 12)
#+end_src

** Bell

#+begin_src emacs-lisp
  (setq ring-bell-function 'ignore)
  (setq visible-bell 1)
#+end_src

** Clipboard

#+begin_src emacs-lisp
  (setq select-enable-clipboard t)
  (setq select-enable-primary t)
  (setq x-select-enable-clipboard-manager nil)
  (setq save-interprogram-paste-before-kill t)
#+end_src

** Line numbers

#+begin_src emacs-lisp
  (setq display-line-numbers 'relative)
#+end_src

** Text filling

#+begin_src emacs-lisp
  (setq-default fill-column 79)
  (set-default 'truncate-lines t)
  (add-hook 'text-mode-hook 'auto-fill-mode)
#+end_src

** Delete all on backspace

#+begin_src emacs-lisp
  (setq backward-delete-char-untabify-method 'all)
#+end_src

** Emacsclient executable

#+begin_src emacs-lisp
  ;; https://emacs.stackexchange.com/a/31061
  (when (equal system-type 'windows-nt)
    (if (file-readable-p "C:/Program Files/Emacs/x86_64/bin/emacsclient.exe")
        (setq-default with-editor-emacsclient-executable "C:/Program Files/Emacs/x86_64/bin/emacsclient.exe")
      (setq-default with-editor-emacsclient-executable nil)))
#+end_src

** No lockfiles

#+begin_src emacs-lisp
  (setq create-lockfiles nil) ;; prevent creation of .#myfile.ext
#+end_src

** Final newline

#+begin_src emacs-lisp
  (setq require-final-newline t) ;; useful for crontab
#+end_src

