README.html

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Turn off unnecessary UI frills</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">when</span> (fboundp 'menu-bar-mode) (menu-bar-mode -1))
(<span style="color: #8ac6f2; font-weight: bold;">when</span> (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(<span style="color: #8ac6f2; font-weight: bold;">when</span> (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(<span style="color: #8ac6f2; font-weight: bold;">when</span> (fboundp 'tooltip-mode) (tooltip-mode -1))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> frame-resize-pixelwise t) <span style="color: #99968b;">;; </span><span style="color: #99968b;">jwm resize fix</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Setup up package.el</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;; </span><span style="color: #99968b;">This must be true otherwise use-package won't load!</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> package-enable-at-startup t)
<span style="color: #99968b;">;; </span><span style="color: #99968b;">Allow loading from the package cache.</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> package-quickstart t)
<span style="color: #99968b;">;; </span><span style="color: #99968b;">Don't write (package-initialize) to my init file!</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> package--init-file-ensured t)
<span style="color: #99968b;">;; </span><span style="color: #99968b;">Setup up archives</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> package-archives
      '((<span style="color: #95e454;">"melpa"</span> . <span style="color: #95e454;">"https://melpa.org/packages/"</span>)
        (<span style="color: #95e454;">"gnu"</span> . <span style="color: #95e454;">"https://elpa.gnu.org/packages/"</span>)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Doom startup speed hacks setup</h2>
<div class="outline-text-2" id="text-2">
<p>
Stole this stuff from <a href="https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly">here</a>.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Avoid garbage collection at startup</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The GC can easily double startup time, so we suppress it at startup by turning
up gc-cons-threshold (and perhaps gc-cons-percentage) temporarily:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> gc-cons-threshold most-positive-fixnum <span style="color: #99968b;">; </span><span style="color: #99968b;">2^61 bytes</span>
      gc-cons-percentage 0.6)
</pre>
</div>

<p>
It is important to reset the garbage collection settings eventually. Not doing
so will cause garbage collection freezes during long-term interactive
use. Conversely, a gc-cons-threshold that is too small will cause
stuttering. We use 16mb as our default.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/default-gc-cons-settings</span> ()
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gc-cons-threshold 16777216 <span style="color: #99968b;">; </span><span style="color: #99968b;">16mb</span>
        gc-cons-percentage 0.1))
(add-hook 'emacs-startup-hook 'my/default-gc-cons-settings)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Unset file-name-handler-alist temporarily</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Emacs consults this variable every time a file is read or library loaded, or
when certain functions in the file API are used (like expand-file-name or
file-truename).
</p>

<p>
Emacs does this to check if a special handler is needed to read that file, but
none of them are (typically) necessary at startup, so we disable them
(temporarily!):
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">my/default-file-name-handler-alist</span> file-name-handler-alist)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> file-name-handler-alist nil)
</pre>
</div>

<p>
Don’t forget to restore file-name-handler-alist, otherwise TRAMP won’t work and
compressed/encrypted files won’t open.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/restore-default-file-name-handler-alist</span> ()
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> file-name-handler-alist my/default-file-name-handler-alist))
(add-hook 'emacs-startup-hook 'my/restore-default-file-name-handler-alist)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> General Settings</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Auto-save</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> auto-save-file-name-transforms '((<span style="color: #95e454;">".*"</span> <span style="color: #95e454;">"~/.emacs.d/auto-save-list/"</span> t)))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> auto-save-timeout 5)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Backups</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> backup-directory-alist '((<span style="color: #95e454;">"."</span> . <span style="color: #95e454;">"~/.emacs.d/backups"</span>)))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> backup-by-copying t) <span style="color: #99968b;">;; </span><span style="color: #99968b;">copy files, don't rename them.</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> delete-old-versions t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> kept-new-versions 12)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> kept-old-versions 12)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Bell</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> ring-bell-function 'ignore)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> visible-bell 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Clipboard</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> select-enable-clipboard t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> select-enable-primary t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> x-select-enable-clipboard-manager nil)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> save-interprogram-paste-before-kill t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Line numbers</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> display-line-numbers 'relative)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Text filling</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq-default</span> fill-column 79)
(set-default 'truncate-lines t)
(add-hook 'text-mode-hook 'auto-fill-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Delete all on backspace</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> backward-delete-char-untabify-method 'all)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> Emacsclient executable</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;; </span><span style="color: #99968b;">https://emacs.stackexchange.com/a/31061</span>
(<span style="color: #8ac6f2; font-weight: bold;">when</span> (equal system-type 'windows-nt)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (file-readable-p <span style="color: #95e454;">"C:/Program Files/Emacs/x86_64/bin/emacsclient.exe"</span>)
      (<span style="color: #8ac6f2; font-weight: bold;">setq-default</span> with-editor-emacsclient-executable <span style="color: #95e454;">"C:/Program Files/Emacs/x86_64/bin/emacsclient.exe"</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">setq-default</span> with-editor-emacsclient-executable nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> No lockfiles</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> create-lockfiles nil) <span style="color: #99968b;">;; </span><span style="color: #99968b;">prevent creation of .#myfile.ext</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> Final newline</h3>
<div class="outline-text-3" id="text-3-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> require-final-newline t) <span style="color: #99968b;">;; </span><span style="color: #99968b;">useful for crontab</span>
</pre>
</div>
</div>
</div>
