README.org
** Pop mark on repeat

#+begin_src emacs-lisp
  (setq set-mark-command-repeat-pop t) ;; repeating C-SPC after popping, pops it
#+end_src

** Encryption

#+begin_src emacs-lisp
  (setq epa-file-cache-passphrase-for-symmetric-encryption t)
  (setf epg-pinentry-mode 'loopback)
#+end_src

** History

#+begin_src emacs-lisp
  (setq history-length t)
  (setq history-delete-duplicates t)
#+end_src

** Bookmarks

#+begin_src emacs-lisp
  (setq bookmark-save-flag 1) ;; always save bookmarks to file
#+end_src

** Custom settings in /tmp

#+begin_src emacs-lisp
  (setq custom-file (make-temp-file "emacs-custom"))
#+end_src

** Enable all advanced features

#+begin_src emacs-lisp
  (setq disabled-command-function nil) ;; enable all "advanced" features
#+end_src

** Increase message logging max

#+begin_src emacs-lisp
  (setq message-log-max 10000)
#+end_src

** More extensive apropos

#+begin_src emacs-lisp
  (setq apropos-do-all t) ;; doesn't seem to be documented anywhere..
#+end_src

** Mouse yank at point

#+begin_src emacs-lisp
  (setq mouse-yank-at-point t)
#+end_src

** Scrolling

#+begin_src emacs-lisp
  (setq scroll-step 4)
  (setq scroll-margin 6)
  (setq scroll-conservatively 8)
  (setq scroll-preserve-screen-position t)
#+end_src

** Initial startup
#+begin_src emacs-lisp
  (defun display-startup-echo-area-message ()
    "Redefine this function to be more useful."
    (message "Started in %s. Hacks & Glory await! :-)" (emacs-init-time)))
  (setq inhibit-startup-screen t)
  (setq initial-scratch-message nil)
  (setq initial-major-mode 'fundamental-mode)
#+end_src

** Passwords

#+begin_src emacs-lisp
  ;; (setq password-cache t) ; enable password caching
  ;; (setq password-cache-expiry 3600) ; for one hour (time in secs)
#+end_src

** Undo limits

#+begin_src emacs-lisp
  ;; http://www.dr-qubit.org/Lost_undo-tree_history.html
  (setq undo-limit 80000000)
  (setq undo-strong-limit 90000000)
#+end_src

** Uniquify

#+begin_src emacs-lisp
  (setq uniquify-buffer-name-style 'forward)
  (setq uniquify-strip-common-suffix t)
  (setq uniquify-after-kill-buffer-p t)
#+end_src

** User info

#+begin_src emacs-lisp
  (setq user-full-name "Toby Slight")
  (setq user-mail-address "tslight@pm.me")
#+end_src

** Windows

#+begin_src emacs-lisp
  (setq split-width-threshold 160)
  (setq split-height-threshold 80)
  (setq auto-window-vscroll nil)
#+end_src
** Yes or no

#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p) ;; never have to type full word
  (setq confirm-kill-emacs 'y-or-n-p)
#+end_src

* Code Style

#+begin_src emacs-lisp
  (setq c-default-style "bsd")
  (setq c-basic-offset 4)
  (setq css-indent-offset 2)
  (setq js-indent-level 2)

  ;; If indent-tabs-mode is t, it may use tab, resulting in mixed spaces and tabs
  (setq-default indent-tabs-mode nil)

  (with-eval-after-load 'python
    (setq python-fill-docstring-style 'django)
    (message "Lazy loaded python :-)"))

  ;; make tab key do indent first then completion.
  (setq-default tab-always-indent 'complete)
#+end_src

