README.html

<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> Pop mark on repeat</h3>
<div class="outline-text-3" id="text-3-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> set-mark-command-repeat-pop t) <span style="color: #99968b;">;; </span><span style="color: #99968b;">repeating C-SPC after popping, pops it</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-12" class="outline-3">
<h3 id="sec-3-12"><span class="section-number-3">3.12</span> Encryption</h3>
<div class="outline-text-3" id="text-3-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> epa-file-cache-passphrase-for-symmetric-encryption t)
(<span style="color: #8ac6f2; font-weight: bold;">setf</span> epg-pinentry-mode 'loopback)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-13" class="outline-3">
<h3 id="sec-3-13"><span class="section-number-3">3.13</span> History</h3>
<div class="outline-text-3" id="text-3-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> history-length t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> history-delete-duplicates t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-14" class="outline-3">
<h3 id="sec-3-14"><span class="section-number-3">3.14</span> Bookmarks</h3>
<div class="outline-text-3" id="text-3-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> bookmark-save-flag 1) <span style="color: #99968b;">;; </span><span style="color: #99968b;">always save bookmarks to file</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-15" class="outline-3">
<h3 id="sec-3-15"><span class="section-number-3">3.15</span> Custom settings in /tmp</h3>
<div class="outline-text-3" id="text-3-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> custom-file (make-temp-file <span style="color: #95e454;">"emacs-custom"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-16" class="outline-3">
<h3 id="sec-3-16"><span class="section-number-3">3.16</span> Enable all advanced features</h3>
<div class="outline-text-3" id="text-3-16">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> disabled-command-function nil) <span style="color: #99968b;">;; </span><span style="color: #99968b;">enable all "advanced" features</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-17" class="outline-3">
<h3 id="sec-3-17"><span class="section-number-3">3.17</span> Increase message logging max</h3>
<div class="outline-text-3" id="text-3-17">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> message-log-max 10000)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-18" class="outline-3">
<h3 id="sec-3-18"><span class="section-number-3">3.18</span> More extensive apropos</h3>
<div class="outline-text-3" id="text-3-18">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> apropos-do-all t) <span style="color: #99968b;">;; </span><span style="color: #99968b;">doesn't seem to be documented anywhere..</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-19" class="outline-3">
<h3 id="sec-3-19"><span class="section-number-3">3.19</span> Mouse yank at point</h3>
<div class="outline-text-3" id="text-3-19">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> mouse-yank-at-point t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-20" class="outline-3">
<h3 id="sec-3-20"><span class="section-number-3">3.20</span> Scrolling</h3>
<div class="outline-text-3" id="text-3-20">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> scroll-step 4)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> scroll-margin 6)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> scroll-conservatively 8)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> scroll-preserve-screen-position t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-21" class="outline-3">
<h3 id="sec-3-21"><span class="section-number-3">3.21</span> Initial startup</h3>
<div class="outline-text-3" id="text-3-21">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">display-startup-echo-area-message</span> ()
  <span style="color: #95e454;">"Redefine this function to be more useful."</span>
  (message <span style="color: #95e454;">"Started in %s. Hacks &amp; Glory await! :-)"</span> (emacs-init-time)))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> inhibit-startup-screen t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> initial-scratch-message nil)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> initial-major-mode 'fundamental-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-22" class="outline-3">
<h3 id="sec-3-22"><span class="section-number-3">3.22</span> Passwords</h3>
<div class="outline-text-3" id="text-3-22">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;; </span><span style="color: #99968b;">(setq password-cache t) ; enable password caching</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">(setq password-cache-expiry 3600) ; for one hour (time in secs)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-23" class="outline-3">
<h3 id="sec-3-23"><span class="section-number-3">3.23</span> Undo limits</h3>
<div class="outline-text-3" id="text-3-23">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;; </span><span style="color: #99968b;">http://www.dr-qubit.org/Lost_undo-tree_history.html</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> undo-limit 80000000)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> undo-strong-limit 90000000)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-24" class="outline-3">
<h3 id="sec-3-24"><span class="section-number-3">3.24</span> Uniquify</h3>
<div class="outline-text-3" id="text-3-24">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> uniquify-buffer-name-style 'forward)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> uniquify-strip-common-suffix t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> uniquify-after-kill-buffer-p t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-25" class="outline-3">
<h3 id="sec-3-25"><span class="section-number-3">3.25</span> User info</h3>
<div class="outline-text-3" id="text-3-25">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> user-full-name <span style="color: #95e454;">"Toby Slight"</span>)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> user-mail-address <span style="color: #95e454;">"tslight@pm.me"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-26" class="outline-3">
<h3 id="sec-3-26"><span class="section-number-3">3.26</span> Windows</h3>
<div class="outline-text-3" id="text-3-26">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> split-width-threshold 160)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> split-height-threshold 80)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> auto-window-vscroll nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-27" class="outline-3">
<h3 id="sec-3-27"><span class="section-number-3">3.27</span> Yes or no</h3>
<div class="outline-text-3" id="text-3-27">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(fset 'yes-or-no-p 'y-or-n-p) <span style="color: #99968b;">;; </span><span style="color: #99968b;">never have to type full word</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> confirm-kill-emacs 'y-or-n-p)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Code Style</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> c-default-style <span style="color: #95e454;">"bsd"</span>)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> c-basic-offset 4)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> css-indent-offset 2)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> js-indent-level 2)

<span style="color: #99968b;">;; </span><span style="color: #99968b;">If indent-tabs-mode is t, it may use tab, resulting in mixed spaces and tabs</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq-default</span> indent-tabs-mode nil)

(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'python
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> python-fill-docstring-style 'django)
  (message <span style="color: #95e454;">"Lazy loaded python :-)"</span>))

<span style="color: #99968b;">;; </span><span style="color: #99968b;">make tab key do indent first then completion.</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq-default</span> tab-always-indent 'complete)
</pre>
</div>
</div>
</div>
