README.org
* Encoding stuff

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/convert-to-unix-coding-system ()
    "Change the current buffer's file encoding to unix."
    (interactive)
    (let ((coding-str (symbol-name buffer-file-coding-system)))
      (when (string-match "-\\(?:dos\\|mac\\)$" coding-str)
        (set-buffer-file-coding-system 'unix))))
  (global-set-key (kbd "C-x RET u") 'my/convert-to-unix-coding-system)

  ;;;###autoload
  (defun my/hide-dos-eol ()
    "Do not show ^M in files containing mixed UNIX and DOS line endings."
    (interactive)
    (setq buffer-display-table (make-display-table))
    (aset buffer-display-table ?\^M []))
  (add-hook 'find-file-hook 'my/hide-dos-eol)

  (setq-default buffer-file-coding-system 'utf-8-unix)
  (setq-default default-buffer-file-coding-system 'utf-8-unix)
  (setq coding-system-for-read 'utf-8-unix)
  (setq coding-system-for-write 'utf-8-unix)
  (set-language-environment "UTF-8")
  (set-default-coding-systems 'utf-8-unix)
  (prefer-coding-system 'utf-8-unix)
#+end_src

* Hooks

Miscellaneous hooks

#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
  (add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
  (add-hook 'lisp-mode-hook 'eldoc-mode)
  (add-hook 'prog-mode-hook 'hl-line-mode)
  (add-hook 'text-mode-hook 'hl-line-mode)
  (add-hook 'prog-mode-hook 'hs-minor-mode)
  (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  (add-hook 'yaml-mode-hook 'hs-minor-mode)
  (add-hook 'yaml-mode-hook 'display-line-numbers-mode)
#+end_src

* Keybindings
** Buffer keybindings

#+begin_src emacs-lisp
  (global-set-key (kbd "C-x M-e") 'eval-buffer)
  (global-set-key (kbd "C-x c") 'save-buffers-kill-emacs)
  (autoload 'ibuffer "ibuffer" nil t)
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (global-set-key (kbd "C-x M-k") 'kill-buffer)
#+end_src

** Toggle menu bar

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c M-m") 'menu-bar-mode)
  (global-set-key (kbd "S-<f10>") 'menu-bar-mode)
#+end_src

** Frame maximizing and fullscreening

#+begin_src emacs-lisp
  (global-set-key (kbd "C-<f10>") 'toggle-frame-maximized)
  (global-set-key (kbd "C-<f11>") 'toggle-frame-fullscreen)
  (global-set-key (kbd "C-s-f") 'toggle-frame-fullscreen)
  (global-set-key (kbd "C-s-m") 'toggle-frame-maximized)
#+end_src

** Desktop read & save bindings

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c M-d r") 'desktop-read)
  (global-set-key (kbd "C-c M-d s") 'desktop-save)
#+end_src

** Grep binding

#+begin_src emacs-lisp
  (autoload 'grep "grep" nil t)
  (global-set-key (kbd "C-c C-g") 'grep)
#+end_src

** Calculator/Calc bindings

#+begin_src emacs-lisp
  (autoload 'calculator "calculator" nil t)
  (global-set-key (kbd "C-c c") 'calculator)
  (autoload 'calc "calc" nil t)
  (global-set-key (kbd "C-c M-c") 'calc)
#+end_src

** Toggle stuff

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c M-t a") 'toggle-text-mode-autofill)
  (global-set-key (kbd "C-c M-t d E") 'toggle-debug-on-entry)
  (global-set-key (kbd "C-c M-t d e") 'toggle-debug-on-error)
  (global-set-key (kbd "C-c M-t d q") 'toggle-debug-on-quit)
  (global-set-key (kbd "C-c M-t t") 'toggle-truncate-lines)
#+end_src

** Tab-bar mode bindings (Emacs 27+)

#+begin_src emacs-lisp
  (when (version< emacs-version "27")
    (global-set-key (kbd "C-x t t") 'tab-bar-select-tab-by-name)
    (global-set-key (kbd "C-x t c") 'tab-bar-new-tab)
    (global-set-key (kbd "C-x t k") 'tab-bar-close-tab)
    (global-set-key (kbd "C-x t n") 'tab-bar-switch-to-next-tab)
    (global-set-key (kbd "C-x t p") 'tab-bar-switch-to-prev-tab)
    (global-set-key (kbd "C-x t l") 'tab-bar-switch-to-recent-tab))
#+end_src

** Special mode keys (help, etc)

#+begin_src emacs-lisp
  ;; for help modes, and simple/special modes
  (define-key special-mode-map "n" #'forward-button)
  (define-key special-mode-map "p" #'backward-button)
  (define-key special-mode-map "f" #'forward-button)
  (define-key special-mode-map "b" #'backward-button)
  (define-key special-mode-map "n" #'widget-forward)
  (define-key special-mode-map "p" #'widget-backward)
  (define-key special-mode-map "f" #'widget-forward)
  (define-key special-mode-map "b" #'widget-backward)
#+end_src

* Registers

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/jump-to-register-other-window ()
    "Tin job."
    (interactive)
    (split-window-sensibly)
    (other-window 1)
    (jump-to-register (register-read-with-preview "Jump to register")))

  (global-set-key (kbd "C-x j") 'jump-to-register)
  (define-key ctl-x-4-map "j" 'my/jump-to-register-other-window)
#+end_src

