README.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Encoding stuff</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/convert-to-unix-coding-system</span> ()
  <span style="color: #95e454;">"Change the current buffer's file encoding to unix."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((coding-str (symbol-name buffer-file-coding-system)))
    (<span style="color: #8ac6f2; font-weight: bold;">when</span> (string-match <span style="color: #95e454;">"-</span><span style="color: #95e454; font-weight: bold;">\\</span><span style="color: #95e454; font-weight: bold;">(?:</span><span style="color: #95e454;">dos</span><span style="color: #95e454; font-weight: bold;">\\</span><span style="color: #95e454; font-weight: bold;">|</span><span style="color: #95e454;">mac</span><span style="color: #95e454; font-weight: bold;">\\</span><span style="color: #95e454; font-weight: bold;">)</span><span style="color: #95e454;">$"</span> coding-str)
      (set-buffer-file-coding-system 'unix))))
(global-set-key (kbd <span style="color: #95e454;">"C-x RET u"</span>) 'my/convert-to-unix-coding-system)

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/hide-dos-eol</span> ()
  <span style="color: #95e454;">"Do not show ^M in files containing mixed UNIX and DOS line endings."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> buffer-display-table (make-display-table))
  (aset buffer-display-table ?\^M []))
(add-hook 'find-file-hook 'my/hide-dos-eol)

(<span style="color: #8ac6f2; font-weight: bold;">setq-default</span> buffer-file-coding-system 'utf-8-unix)
(<span style="color: #8ac6f2; font-weight: bold;">setq-default</span> default-buffer-file-coding-system 'utf-8-unix)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> coding-system-for-read 'utf-8-unix)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> coding-system-for-write 'utf-8-unix)
(set-language-environment <span style="color: #95e454;">"UTF-8"</span>)
(set-default-coding-systems 'utf-8-unix)
(prefer-coding-system 'utf-8-unix)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Hooks</h2>
<div class="outline-text-2" id="text-6">
<p>
Miscellaneous hooks
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
(add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
(add-hook 'lisp-mode-hook 'eldoc-mode)
(add-hook 'prog-mode-hook 'hl-line-mode)
(add-hook 'text-mode-hook 'hl-line-mode)
(add-hook 'prog-mode-hook 'hs-minor-mode)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Keybindings</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Buffer keybindings</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #95e454;">"C-x M-e"</span>) 'eval-buffer)
(global-set-key (kbd <span style="color: #95e454;">"C-x c"</span>) 'save-buffers-kill-emacs)
(autoload 'ibuffer <span style="color: #95e454;">"ibuffer"</span> nil t)
(global-set-key (kbd <span style="color: #95e454;">"C-x C-b"</span>) 'ibuffer)
(global-set-key (kbd <span style="color: #95e454;">"C-x M-k"</span>) 'kill-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Toggle menu bar</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #95e454;">"C-c M-m"</span>) 'menu-bar-mode)
(global-set-key (kbd <span style="color: #95e454;">"S-&lt;f10&gt;"</span>) 'menu-bar-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Frame maximizing and fullscreening</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #95e454;">"C-&lt;f10&gt;"</span>) 'toggle-frame-maximized)
(global-set-key (kbd <span style="color: #95e454;">"C-&lt;f11&gt;"</span>) 'toggle-frame-fullscreen)
(global-set-key (kbd <span style="color: #95e454;">"C-s-f"</span>) 'toggle-frame-fullscreen)
(global-set-key (kbd <span style="color: #95e454;">"C-s-m"</span>) 'toggle-frame-maximized)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> Desktop read &amp; save bindings</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #95e454;">"C-c M-d r"</span>) 'desktop-read)
(global-set-key (kbd <span style="color: #95e454;">"C-c M-d s"</span>) 'desktop-save)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> Grep binding</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(autoload 'grep <span style="color: #95e454;">"grep"</span> nil t)
(global-set-key (kbd <span style="color: #95e454;">"C-c C-g"</span>) 'grep)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> Calculator/Calc bindings</h3>
<div class="outline-text-3" id="text-7-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(autoload 'calculator <span style="color: #95e454;">"calculator"</span> nil t)
(global-set-key (kbd <span style="color: #95e454;">"C-c c"</span>) 'calculator)
(autoload 'calc <span style="color: #95e454;">"calc"</span> nil t)
(global-set-key (kbd <span style="color: #95e454;">"C-c M-c"</span>) 'calc)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> Toggle stuff</h3>
<div class="outline-text-3" id="text-7-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #95e454;">"C-c M-t a"</span>) 'toggle-text-mode-autofill)
(global-set-key (kbd <span style="color: #95e454;">"C-c M-t t"</span>) 'toggle-truncate-lines)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-8" class="outline-3">
<h3 id="sec-7-8"><span class="section-number-3">7.8</span> Tab-bar mode bindings (Emacs 27+)</h3>
<div class="outline-text-3" id="text-7-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">when</span> (version&lt; emacs-version <span style="color: #95e454;">"27"</span>)
  (global-set-key (kbd <span style="color: #95e454;">"C-x t t"</span>) 'tab-bar-select-tab-by-name)
  (global-set-key (kbd <span style="color: #95e454;">"C-x t c"</span>) 'tab-bar-new-tab)
  (global-set-key (kbd <span style="color: #95e454;">"C-x t k"</span>) 'tab-bar-close-tab)
  (global-set-key (kbd <span style="color: #95e454;">"C-x t n"</span>) 'tab-bar-switch-to-next-tab)
  (global-set-key (kbd <span style="color: #95e454;">"C-x t p"</span>) 'tab-bar-switch-to-prev-tab)
  (global-set-key (kbd <span style="color: #95e454;">"C-x t l"</span>) 'tab-bar-switch-to-recent-tab))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-9" class="outline-3">
<h3 id="sec-7-9"><span class="section-number-3">7.9</span> Special mode keys (help, etc)</h3>
<div class="outline-text-3" id="text-7-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;; </span><span style="color: #99968b;">for help modes, and simple/special modes</span>
(define-key special-mode-map <span style="color: #95e454;">"n"</span> #'forward-button)
(define-key special-mode-map <span style="color: #95e454;">"p"</span> #'backward-button)
(define-key special-mode-map <span style="color: #95e454;">"f"</span> #'forward-button)
(define-key special-mode-map <span style="color: #95e454;">"b"</span> #'backward-button)
(define-key special-mode-map <span style="color: #95e454;">"n"</span> #'widget-forward)
(define-key special-mode-map <span style="color: #95e454;">"p"</span> #'widget-backward)
(define-key special-mode-map <span style="color: #95e454;">"f"</span> #'widget-forward)
(define-key special-mode-map <span style="color: #95e454;">"b"</span> #'widget-backward)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Registers</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/jump-to-register-other-window</span> ()
  <span style="color: #95e454;">"Tin job."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (split-window-sensibly)
  (other-window 1)
  (jump-to-register (register-read-with-preview <span style="color: #95e454;">"Jump to register"</span>)))

(global-set-key (kbd <span style="color: #95e454;">"C-x j"</span>) 'jump-to-register)
(define-key ctl-x-4-map <span style="color: #95e454;">"j"</span> 'my/jump-to-register-other-window)
</pre>
</div>
</div>
</div>
