README.org
* Theme/UI

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/after-make-frame (frame)
    "Add custom settings after making the FRAME."
    (select-frame frame)
    (if (display-graphic-p)
        (progn
          (when (eq system-type 'windows-nt)
            (set-frame-font "Cascadia Mono 10" nil t))
          (when (eq system-type 'darwin)
            (set-frame-font "Monaco 10" nil t))
          (when (or (eq system-type 'gnu/linux)
                    (eq system-type 'berkeley-unix))
            (set-frame-font "Monospace 11" nil t))
          (load-theme 'wombat))
      (progn
        (load-theme 'manoj-dark)
        (xterm-mouse-mode 1)
        (mouse-avoidance-mode 'banish)
        ;; (setq linum-format "%d ")
        (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
        (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
        (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
        (global-set-key [mouse-4] '(lambda () (interactive) (scroll-down 1)))
        (global-set-key [mouse-5] '(lambda () (interactive) (scroll-up 1))))))

  (if (daemonp)
      (add-hook 'after-make-frame-functions #'my/after-make-frame(selected-frame))
    (my/after-make-frame(selected-frame)))

  ;;;###autoload
  (defun my/disable-themes ()
    "Disable all custom themes in one fail swoop."
    (interactive)
    (mapc #'disable-theme custom-enabled-themes))

  (global-set-key (kbd "C-c M-t C-t") 'my/disable-themes)

  (setq default-frame-alist
        '((fullscreen . maximized) (vertical-scroll-bars . nil)))

  ;; mode line stuff
  ;; (setq display-time-format "%H:%M %d/%m")
  ;; (setq display-time-default-load-average 'nil)
  (column-number-mode t)
  ;; (display-time-mode t)
  ;; (display-battery-mode t)
  ;; (size-indication-mode t)

  (setq prettify-symbols-unprettify-at-point 'right-edge)
  (global-prettify-symbols-mode 1)

  (defadvice load-theme (before theme-dont-propagate activate)
    "Disable theme before loading new one."
    (mapc #'disable-theme custom-enabled-themes))
#+end_src

* Buffer functions

A collection of useful functions for manipulating buffers in various ways that
I've collected (stolen!) or written over the years.

** Indent Buffer

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/indent-buffer ()
    "Indent the contents of a buffer."
    (interactive)
    (indent-region (point-min) (point-max)))
  (global-set-key (kbd "C-c M-i") 'my/indent-buffer)
  (add-hook 'before-save-hook 'my/indent-buffer)
#+end_src

** Kill this buffer

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/kill-this-buffer ()
    "Kill the current buffer - `kill-this-buffer' is unreliable."
    (interactive)
    (kill-buffer (current-buffer)))
  (global-set-key (kbd "C-x k") 'my/kill-this-buffer)
#+end_src

** Last buffer

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/last-buffer ()
    "Switch back and forth between two buffers easily."
    (interactive)
    (switch-to-buffer (other-buffer (current-buffer) 1)))
  (global-set-key (kbd "C-c b") 'my/last-buffer)
#+end_src

** Nuke buffers

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/nuke-buffers ()
    "Kill all buffers, leaving *scratch* only."
    (interactive)
    (mapc
     (lambda (buffer)
       (kill-buffer buffer))
     (buffer-list))
    (if current-prefix-arg
        (delete-other-windows)))
  (global-set-key (kbd "C-c M-n") 'my/nuke-buffers)
#+end_src

