README.html

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Theme/UI</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/after-make-frame</span> (frame)
  <span style="color: #95e454;">"Add custom settings after making the FRAME."</span>
  (select-frame frame)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (display-graphic-p)
      (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
        (<span style="color: #8ac6f2; font-weight: bold;">when</span> (eq system-type 'windows-nt)
          (set-frame-font <span style="color: #95e454;">"Cascadia Mono 10"</span> nil t))
        (<span style="color: #8ac6f2; font-weight: bold;">when</span> (eq system-type 'darwin)
          (set-frame-font <span style="color: #95e454;">"Monaco 10"</span> nil t))
        (<span style="color: #8ac6f2; font-weight: bold;">when</span> (<span style="color: #8ac6f2; font-weight: bold;">or</span> (eq system-type 'gnu/linux)
                  (eq system-type 'berkeley-unix))
          (set-frame-font <span style="color: #95e454;">"Monospace 11"</span> nil t))
        (load-theme 'wombat))
    (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
      (load-theme 'manoj-dark)
      (xterm-mouse-mode 1)
      (mouse-avoidance-mode 'banish)
      <span style="color: #99968b;">;; </span><span style="color: #99968b;">(setq linum-format "%d ")</span>
      (<span style="color: #8ac6f2; font-weight: bold;">setq</span> mouse-wheel-follow-mouse 't) <span style="color: #99968b;">;; </span><span style="color: #99968b;">scroll window under mouse</span>
      (<span style="color: #8ac6f2; font-weight: bold;">setq</span> mouse-wheel-progressive-speed nil) <span style="color: #99968b;">;; </span><span style="color: #99968b;">don't accelerate scrolling</span>
      (<span style="color: #8ac6f2; font-weight: bold;">setq</span> mouse-wheel-scroll-amount '(1 ((shift) . 1))) <span style="color: #99968b;">;; </span><span style="color: #99968b;">one line at a time</span>
      (global-set-key [mouse-4] '(lambda () (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>) (scroll-down 1)))
      (global-set-key [mouse-5] '(lambda () (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>) (scroll-up 1))))))

(<span style="color: #8ac6f2; font-weight: bold;">if</span> (daemonp)
    (add-hook 'after-make-frame-functions #'my/after-make-frame(selected-frame))
  (my/after-make-frame(selected-frame)))
</pre>
</div>

<p>
Modeline configuration
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;; </span><span style="color: #99968b;">(setq display-time-format "%H:%M %d/%m")</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">(setq display-time-default-load-average 'nil)</span>
(column-number-mode t)
<span style="color: #99968b;">;; </span><span style="color: #99968b;">(display-time-mode t)</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">(display-battery-mode t)</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">(size-indication-mode t)</span>
</pre>
</div>

<p>
Disable the current theme, before loading a new one.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defadvice</span> <span style="color: #cae682;">load-theme</span> (before theme-dont-propagate activate)
  <span style="color: #95e454;">"Disable theme before loading new one."</span>
  (mapc #'disable-theme custom-enabled-themes))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/disable-themes</span> ()
  <span style="color: #95e454;">"Disable all custom themes in one fail swoop."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (mapc #'disable-theme custom-enabled-themes))
(global-set-key (kbd <span style="color: #95e454;">"C-c M-t C-t"</span>) 'my/disable-themes)
</pre>
</div>

<p>
Maximize the frame on launch and disable scroll bars
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> default-frame-alist
      '((fullscreen . maximized) (vertical-scroll-bars . nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Buffer functions</h2>
<div class="outline-text-2" id="text-10">
<p>
A collection of useful functions for manipulating buffers in various ways that
I've collected (stolen!) or written over the years.
</p>
</div>

<div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Indent Buffer</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/indent-buffer</span> ()
  <span style="color: #95e454;">"Indent the contents of a buffer."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (indent-region (point-min) (point-max)))
(global-set-key (kbd <span style="color: #95e454;">"C-c M-i"</span>) 'my/indent-buffer)
(add-hook 'before-save-hook 'my/indent-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Kill this buffer</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/kill-this-buffer</span> ()
  <span style="color: #95e454;">"Kill the current buffer - `</span><span style="color: #e5786d;">kill-this-buffer</span><span style="color: #95e454;">' is unreliable."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (kill-buffer (current-buffer)))
(global-set-key (kbd <span style="color: #95e454;">"C-x k"</span>) 'my/kill-this-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> Last buffer</h3>
<div class="outline-text-3" id="text-10-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/last-buffer</span> ()
  <span style="color: #95e454;">"Switch back and forth between two buffers easily."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (switch-to-buffer (other-buffer (current-buffer) 1)))
(global-set-key (kbd <span style="color: #95e454;">"C-c b"</span>) 'my/last-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> Nuke buffers</h3>
<div class="outline-text-3" id="text-10-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/nuke-buffers</span> ()
  <span style="color: #95e454;">"Kill all buffers, leaving *scratch* only."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (mapc
   (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (buffer)
     (kill-buffer buffer))
   (buffer-list))
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> current-prefix-arg
      (delete-other-windows)))
(global-set-key (kbd <span style="color: #95e454;">"C-c M-n"</span>) 'my/nuke-buffers)
</pre>
</div>
</div>
</div>
