README.org
** Remove stuff from a buffer

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/remove-from-buffer (string)
    "Remove all occurences of STRING from the whole buffer."
    (interactive "sString to remove: ")
    (save-match-data
      (save-excursion
        (let ((count 0))
          (goto-char (point-min))
          (while (re-search-forward string (point-max) t)
            (setq count (+ count 1))
            (replace-match "" nil nil))
          (message (format "%d %s removed from buffer." count string))))))

  ;;;###autoload
  (defun my/remove-character-number (number)
    "Remove all occurences of a control character NUMBER.
  Excluding ^I (tabs) and ^J (newline)."
    (if (and (>= number 0) (<= number 31)
             (not (= number 9)) (not (= number 10)))
        (let ((character (string number)))
          (my/remove-from-buffer character))))

  ;;;###autoload
  (defun my/remove-all-ctrl-characters ()
    "Remove all occurences of all control characters.
  Excluding ^I (tabs) and ^J (newlines)."
    (interactive)
    (mapcar (lambda (n)
              (my/remove-character-number n))
            (number-sequence 0 31)))

  ;;;###autoload
  (defun my/remove-ctrl-m ()
    "Remove all ^M occurrences from EOL in a buffer."
    (interactive)
    (my/remove-from-buffer "$"))

  (global-set-key (kbd "C-c k") 'my/remove-from-buffer)
#+end_src

** Save buffers silently

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/save-buffers-silently ()
    "Save all open buffers without prompting."
    (interactive)
    (save-some-buffers t)
    (message "Saved all buffers :-)"))
  (global-set-key (kbd "C-c s") 'my/save-buffers-silently)
#+end_src

** Toggle maximize buffer

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/toggle-maximize-buffer ()
    "Temporarily maximize a buffer."
    (interactive)
    (if (= 1 (length (window-list)))
        (jump-to-register '_)
      (progn
        (window-configuration-to-register '_)
        (delete-other-windows))))
  (global-set-key (kbd "C-c z") 'my/toggle-maximize-buffer)
#+end_src

* Complilation related
** Prefer newer over compiled

If init.elc is older, use newer ~init.el~.

#+begin_src emacs-lisp
  (setq load-prefer-newer t) ;; if init.elc is older, use newer init.el
#+end_src

** Place point after complilation error

#+begin_src emacs-lisp
  (setq compilation-scroll-output 'first-error)
#+end_src

** Ensure init files are byte compiled

This block will byte compile ~early-init.el~ and ~init.el~ if an existing
~.elc~ file is not up to date with their contents.

#+begin_src emacs-lisp
  (defun my/ensure-byte-compiled-init ()
    (autoload 'byte-recompile-file "bytecomp")
    (byte-recompile-file
     (expand-file-name "early-init.el" user-emacs-directory)
     'nil 0 'nil)
    (byte-recompile-file
     (expand-file-name "init.el" user-emacs-directory)
     'nil 0 'nil))
  (add-hook 'after-init-hook 'my/ensure-byte-compiled-init)
#+end_src

** Recompile config

#+begin_src emacs-lisp
  (defvar my/files-to-recompile '("early-init.el" "init.el")
    "Files under `user-emacs-directory' that we use for configuration.")

  ;;;###autoload
  (defun my/recompile-config ()
    "Recompile everything in Emacs configuration."
    (interactive)
    (mapc (lambda (file) (byte-recompile-file (concat user-emacs-directory file) 0))
          my/files-to-recompile))
#+end_src

** Auto recompile Emacs Lisp

Automatically recompile Emacs Lisp files after saving

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/auto-recompile ()
    "Automatically recompile Emacs Lisp files whenever they are saved."
    (when (or (equal major-mode 'emacs-lisp-mode)
              (string-match "^.*\\.el$" buffer-file-name))
      (byte-compile-file buffer-file-name t)
      (message (concat "Re-compiled " buffer-file-name " :-)"))))
  (add-hook 'after-save-hook 'my/auto-recompile)
#+end_src

** Make compilation buffers more colorful

#+begin_src emacs-lisp
  (add-to-list 'comint-output-filter-functions 'ansi-color-process-output)
  ;;;###autoload
  (defun colorize-compilation-buffer ()
    "ANSI color in compilation buffer."
    (ansi-color-apply-on-region compilation-filter-start (point)))
  (add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
  (add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
#+end_src

* Editing functions

Various stolen/cobbled together functions to make editing a bit more comfy.

