README.html

<div id="outline-container-sec-10-5" class="outline-3">
<h3 id="sec-10-5"><span class="section-number-3">10.5</span> Remove stuff from a buffer</h3>
<div class="outline-text-3" id="text-10-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/remove-from-buffer</span> (string)
  <span style="color: #95e454;">"Remove all occurences of STRING from the whole buffer."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"sString to remove: "</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">save-match-data</span>
    (<span style="color: #8ac6f2; font-weight: bold;">save-excursion</span>
      (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((count 0))
        (goto-char (point-min))
        (<span style="color: #8ac6f2; font-weight: bold;">while</span> (re-search-forward string (point-max) t)
          (<span style="color: #8ac6f2; font-weight: bold;">setq</span> count (+ count 1))
          (replace-match <span style="color: #95e454;">""</span> nil nil))
        (message (format <span style="color: #95e454;">"%d %s removed from buffer."</span> count string))))))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/remove-character-number</span> (number)
  <span style="color: #95e454;">"Remove all occurences of a control character NUMBER.</span>
<span style="color: #95e454;">Excluding ^I (tabs) and ^J (newline)."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (<span style="color: #8ac6f2; font-weight: bold;">and</span> (&gt;= number 0) (&lt;= number 31)
           (not (= number 9)) (not (= number 10)))
      (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((character (string number)))
        (my/remove-from-buffer character))))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/remove-all-ctrl-characters</span> ()
  <span style="color: #95e454;">"Remove all occurences of all control characters.</span>
<span style="color: #95e454;">Excluding ^I (tabs) and ^J (newlines)."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (mapcar (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (n)
            (my/remove-character-number n))
          (number-sequence 0 31)))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/remove-ctrl-m</span> ()
  <span style="color: #95e454;">"Remove all ^M occurrences from EOL in a buffer."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (my/remove-from-buffer <span style="color: #95e454;">"$"</span>))

(global-set-key (kbd <span style="color: #95e454;">"C-c k"</span>) 'my/remove-from-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10-6" class="outline-3">
<h3 id="sec-10-6"><span class="section-number-3">10.6</span> Save buffers silently</h3>
<div class="outline-text-3" id="text-10-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/save-buffers-silently</span> ()
  <span style="color: #95e454;">"Save all open buffers without prompting."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (save-some-buffers t)
  (message <span style="color: #95e454;">"Saved all buffers :-)"</span>))
(global-set-key (kbd <span style="color: #95e454;">"C-c s"</span>) 'my/save-buffers-silently)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10-7" class="outline-3">
<h3 id="sec-10-7"><span class="section-number-3">10.7</span> Toggle maximize buffer</h3>
<div class="outline-text-3" id="text-10-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/toggle-maximize-buffer</span> ()
  <span style="color: #95e454;">"Temporarily maximize a buffer."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (= 1 (length (window-list)))
      (jump-to-register '_)
    (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
      (window-configuration-to-register '_)
      (delete-other-windows))))
(global-set-key (kbd <span style="color: #95e454;">"C-c z"</span>) 'my/toggle-maximize-buffer)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Complilation related</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Prefer newer over compiled</h3>
<div class="outline-text-3" id="text-11-1">
<p>
If init.elc is older, use newer <code>init.el</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> load-prefer-newer t) <span style="color: #99968b;">;; </span><span style="color: #99968b;">if init.elc is older, use newer init.el</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Place point after complilation error</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> compilation-scroll-output 'first-error)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> Ensure init files are byte compiled</h3>
<div class="outline-text-3" id="text-11-3">
<p>
This block will byte compile <code>early-init.el</code> and <code>init.el</code> if an existing
<code>.elc</code> file is not up to date with their contents.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/ensure-byte-compiled-init</span> ()
  (autoload 'byte-recompile-file <span style="color: #95e454;">"bytecomp"</span>)
  (byte-recompile-file
   (expand-file-name <span style="color: #95e454;">"early-init.el"</span> user-emacs-directory)
   'nil 0 'nil)
  (byte-recompile-file
   (expand-file-name <span style="color: #95e454;">"init.el"</span> user-emacs-directory)
   'nil 0 'nil))
(add-hook 'after-init-hook 'my/ensure-byte-compiled-init)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11-4" class="outline-3">
<h3 id="sec-11-4"><span class="section-number-3">11.4</span> Recompile config</h3>
<div class="outline-text-3" id="text-11-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">my/files-to-recompile</span> '(<span style="color: #95e454;">"early-init.el"</span> <span style="color: #95e454;">"init.el"</span>)
  <span style="color: #95e454;">"Files under `</span><span style="color: #e5786d;">user-emacs-directory</span><span style="color: #95e454;">' that we use for configuration."</span>)

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/recompile-config</span> ()
  <span style="color: #95e454;">"Recompile everything in Emacs configuration."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (mapc (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (file) (byte-recompile-file (concat user-emacs-directory file) 0))
        my/files-to-recompile))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11-5" class="outline-3">
<h3 id="sec-11-5"><span class="section-number-3">11.5</span> Auto recompile Emacs Lisp</h3>
<div class="outline-text-3" id="text-11-5">
<p>
Automatically recompile Emacs Lisp files after saving
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/auto-recompile</span> ()
  <span style="color: #95e454;">"Automatically recompile Emacs Lisp files whenever they are saved."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">when</span> (<span style="color: #8ac6f2; font-weight: bold;">or</span> (equal major-mode 'emacs-lisp-mode)
            (string-match <span style="color: #95e454;">"^.*\\.el$"</span> buffer-file-name))
    (byte-compile-file buffer-file-name t)
    (message (concat <span style="color: #95e454;">"Re-compiled "</span> buffer-file-name <span style="color: #95e454;">" :-)"</span>))))
(add-hook 'after-save-hook 'my/auto-recompile)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11-6" class="outline-3">
<h3 id="sec-11-6"><span class="section-number-3">11.6</span> Make compilation buffers more colorful</h3>
<div class="outline-text-3" id="text-11-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'comint-output-filter-functions 'ansi-color-process-output)
<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">colorize-compilation-buffer</span> ()
  <span style="color: #95e454;">"ANSI color in compilation buffer."</span>
  (ansi-color-apply-on-region compilation-filter-start (point)))
(add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Editing functions</h2>
<div class="outline-text-2" id="text-12">
<p>
Various stolen/cobbled together functions to make editing a bit more comfy.
</p>
</div>
