README.org
** Aligning symbols

Some handy functions to make aligning symbols less painful.

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/align-symbol (begin end symbol)
    "Align any SYMBOL in region (between BEGIN and END)."
    (interactive "r\nsEnter align symbol: ")
    (align-regexp begin end (concat "\\(\\s-*\\)" symbol) 1 1))
  (global-set-key (kbd "C-c a") 'my/align-symbol)

  ;;;###autoload
  (defun my/align-equals (begin end)
    "Align equals in region (between BEGIN and END)."
    (interactive "r")
    (my/align-symbol begin end "="))
  (global-set-key (kbd "C-c =") 'my/align-equals)

  ;;;###autoload
  (defun my/align-colon (begin end)
    "Align colons in region (between BEGIN and END)."
    (interactive "r")
    (my/align-symbol begin end ":"))
  (global-set-key (kbd "C-c :") 'my/align-colon)

  ;;;###autoload
  (defun my/align-numbers (begin end)
    "Align numbers in region (between BEGIN and END)."
    (interactive "r")
    (my/align-symbol begin end "[0-9]+"))
  (global-set-key (kbd "C-c #") 'my/align-numbers)

  (defadvice align-regexp (around align-regexp-with-spaces activate)
    "Force alignment commands to use spaces, not tabs."
    (let ((indent-tabs-mode nil))
      ad-do-it))
#+end_src

** Change numbers

Increment or decrement numbers at the point.

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/change-number-at-point (change)
    "Change a number by CHANGE amount."
    (let ((number (number-at-point))
          (point (point)))
      (when number
        (progn
          (forward-word)
          (search-backward (number-to-string number))
          (replace-match (number-to-string (funcall change number)))
          (goto-char point)))))

  ;;;###autoload
  (defun my/increment-number-at-point ()
    "Increment number at point."
    (interactive)
    (my/change-number-at-point '1+))
  (global-set-key (kbd "C-c +") 'my/increment-number-at-point)

  ;;;###autoload
  (defun my/decrement-number-at-point ()
    "Decrement number at point."
    (interactive)
    (my/change-number-at-point '1-))
  (global-set-key (kbd "C-c -") 'my/decrement-number-at-point)
#+end_src

** Delete inside delimiters

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/delete-inside ()
    "Deletes the text within parentheses, brackets or quotes."
    (interactive)
    ;; Search for a match on the same line, don't delete across lines
    (search-backward-regexp "[[{(<\"\']" (line-beginning-position))
    (forward-char)
    (let ((lstart (point)))
      (search-forward-regexp "[]})>\"\']" (line-end-position))
      (backward-char)
      (kill-region lstart (point))))
  (global-set-key (kbd "C-c d") 'my/delete-inside)
#+end_src

** Generate a numbered list

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/generate-numbered-list (start end char)
    "Create a numbered list from START to END.  Using CHAR as punctuation."
    (interactive "nStart number:\nnEnd number:\nsCharacter:")
    (let ((x start))
      (while (<= x end)
        (insert (concat (number-to-string x) char))
        (newline)
        (setq x (+ x 1)))))
#+end_src

** Smart that the default functions

Overwrite some default functions that do stuff in a slightly counter-intuitive
or just less than ideal way...

*** Fill or unfill

#+begin_src emacs-lisp
  ;;;###autoload
  (defun smart/fill-or-unfill ()
    "Like `fill-paragraph', but unfill if used twice."
    (interactive)
    (let ((fill-column
           (if (eq last-command 'smart/fill-or-unfill)
               (progn (setq this-command nil)
                      (point-max))
             fill-column)))
      (call-interactively #'fill-paragraph)))
  (global-set-key [remap fill-paragraph] 'smart/fill-or-unfill)
#+end_src

