README.html

<div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> Aligning symbols</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Some handy functions to make aligning symbols less painful.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/align-symbol</span> (begin end symbol)
  <span style="color: #95e454;">"Align any SYMBOL in region (between BEGIN and END)."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"r\nsEnter align symbol: "</span>)
  (align-regexp begin end (concat <span style="color: #95e454;">"</span><span style="color: #95e454; font-weight: bold;">\\</span><span style="color: #95e454; font-weight: bold;">(</span><span style="color: #95e454;">\\s-*</span><span style="color: #95e454; font-weight: bold;">\\</span><span style="color: #95e454; font-weight: bold;">)</span><span style="color: #95e454;">"</span> symbol) 1 1))
(global-set-key (kbd <span style="color: #95e454;">"C-c a"</span>) 'my/align-symbol)

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/align-equals</span> (begin end)
  <span style="color: #95e454;">"Align equals in region (between BEGIN and END)."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"r"</span>)
  (my/align-symbol begin end <span style="color: #95e454;">"="</span>))
(global-set-key (kbd <span style="color: #95e454;">"C-c ="</span>) 'my/align-equals)

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/align-colon</span> (begin end)
  <span style="color: #95e454;">"Align colons in region (between BEGIN and END)."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"r"</span>)
  (my/align-symbol begin end <span style="color: #95e454;">":"</span>))
(global-set-key (kbd <span style="color: #95e454;">"C-c :"</span>) 'my/align-colon)

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/align-numbers</span> (begin end)
  <span style="color: #95e454;">"Align numbers in region (between BEGIN and END)."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"r"</span>)
  (my/align-symbol begin end <span style="color: #95e454;">"[0-9]+"</span>))
(global-set-key (kbd <span style="color: #95e454;">"C-c #"</span>) 'my/align-numbers)

(<span style="color: #8ac6f2; font-weight: bold;">defadvice</span> <span style="color: #cae682;">align-regexp</span> (around align-regexp-with-spaces activate)
  <span style="color: #95e454;">"Force alignment commands to use spaces, not tabs."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((indent-tabs-mode nil))
    ad-do-it))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> Change numbers</h3>
<div class="outline-text-3" id="text-12-2">
<p>
Increment or decrement numbers at the point.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/change-number-at-point</span> (change)
  <span style="color: #95e454;">"Change a number by CHANGE amount."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((number (number-at-point))
        (point (point)))
    (<span style="color: #8ac6f2; font-weight: bold;">when</span> number
      (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
        (forward-word)
        (search-backward (number-to-string number))
        (replace-match (number-to-string (funcall change number)))
        (goto-char point)))))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/increment-number-at-point</span> ()
  <span style="color: #95e454;">"Increment number at point."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (my/change-number-at-point '1+))
(global-set-key (kbd <span style="color: #95e454;">"C-c +"</span>) 'my/increment-number-at-point)

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/decrement-number-at-point</span> ()
  <span style="color: #95e454;">"Decrement number at point."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (my/change-number-at-point '1-))
(global-set-key (kbd <span style="color: #95e454;">"C-c -"</span>) 'my/decrement-number-at-point)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> Delete inside delimiters</h3>
<div class="outline-text-3" id="text-12-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/delete-inside</span> ()
  <span style="color: #95e454;">"Deletes the text within parentheses, brackets or quotes."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  <span style="color: #99968b;">;; </span><span style="color: #99968b;">Search for a match on the same line, don't delete across lines</span>
  (search-backward-regexp <span style="color: #95e454;">"[[{(&lt;\"</span><span style="color: #ccaa8f;">\</span><span style="color: #95e454;">']"</span> (line-beginning-position))
  (forward-char)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((lstart (point)))
    (search-forward-regexp <span style="color: #95e454;">"[]})&gt;\"</span><span style="color: #ccaa8f;">\</span><span style="color: #95e454;">']"</span> (line-end-position))
    (backward-char)
    (kill-region lstart (point))))
(global-set-key (kbd <span style="color: #95e454;">"C-c d"</span>) 'my/delete-inside)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="section-number-3">12.4</span> Generate a numbered list</h3>
<div class="outline-text-3" id="text-12-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/generate-numbered-list</span> (start end char)
  <span style="color: #95e454;">"Create a numbered list from START to END.  Using CHAR as punctuation."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"nStart number:\nnEnd number:\nsCharacter:"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((x start))
    (<span style="color: #8ac6f2; font-weight: bold;">while</span> (&lt;= x end)
      (insert (concat (number-to-string x) char))
      (newline)
      (<span style="color: #8ac6f2; font-weight: bold;">setq</span> x (+ x 1)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-5" class="outline-3">
<h3 id="sec-12-5"><span class="section-number-3">12.5</span> Smart that the default functions</h3>
<div class="outline-text-3" id="text-12-5">
<p>
Overwrite some default functions that do stuff in a slightly counter-intuitive
or just less than ideal way&#x2026;
</p>
</div>

<div id="outline-container-sec-12-5-1" class="outline-4">
<h4 id="sec-12-5-1"><span class="section-number-4">12.5.1</span> Fill or unfill</h4>
<div class="outline-text-4" id="text-12-5-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">smart/fill-or-unfill</span> ()
  <span style="color: #95e454;">"Like `</span><span style="color: #e5786d;">fill-paragraph</span><span style="color: #95e454;">', but unfill if used twice."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((fill-column
         (<span style="color: #8ac6f2; font-weight: bold;">if</span> (eq last-command 'smart/fill-or-unfill)
             (<span style="color: #8ac6f2; font-weight: bold;">progn</span> (<span style="color: #8ac6f2; font-weight: bold;">setq</span> this-command nil)
                    (point-max))
           fill-column)))
    (call-interactively #'fill-paragraph)))
(global-set-key [remap fill-paragraph] 'smart/fill-or-unfill)
</pre>
</div>
</div>
</div>
