README.org
*** Narrow or widen DWIM

#+begin_src emacs-lisp
  ;;;###autoload
  (defun smart/narrow-or-widen-dwim (p)
    "If the buffer is narrowed, it widens, otherwise, it narrows intelligently.

  Intelligently means: region, org-src-block, org-subtree, or
  defun, whichever applies first.

  Narrowing to org-src-block actually calls `org-edit-src-code'.
  With prefix P, don't widen, just narrow even if buffer is already
  narrowed."
    (interactive "P")
    (declare (interactive-only))
    (cond ((and (buffer-narrowed-p) (not p)) (widen))
          ((region-active-p)
           (narrow-to-region (region-beginning) (region-end)))
          ((derived-mode-p 'org-mode)
           ;; `org-edit-src-code' is not a real narrowing command.
           ;; Remove this first conditional if you don't want it.
           (cond ((ignore-errors (org-edit-src-code))
                  (delete-other-windows))
                 ((org-at-block-p)
                  (org-narrow-to-block))
                 (t (org-narrow-to-subtree))))
          (t (narrow-to-defun))))
  (define-key ctl-x-map "n" 'smart/narrow-or-widen-dwim)
#+end_src

*** Beginning of line

#+begin_src emacs-lisp
  ;;;###autoload
  (defun smart/move-beginning-of-line ()
    "Move point back to indentation.

  If there is any non blank characters to the left of the cursor.
  Otherwise point moves to beginning of line."
    (interactive)
    (if (= (point) (save-excursion (back-to-indentation) (point)))
        (beginning-of-line)
      (back-to-indentation)))
  (global-set-key [remap move-beginning-of-line] 'smart/move-beginning-of-line)
#+end_src

*** Kill ring save

#+begin_src emacs-lisp
  ;;;###autoload
  (defun smart/kill-ring-save ()
    "Copy current line or text selection to kill ring.

  When `universal-argument' is called first, copy whole buffer (but
  respect `narrow-to-region')."
    (interactive)
    (let (p1 p2)
      (if (null current-prefix-arg)
          (progn (if (use-region-p)
                     (progn (setq p1 (region-beginning))
                            (setq p2 (region-end)))
                   (progn (setq p1 (line-beginning-position))
                          (setq p2 (line-end-position)))))
        (progn (setq p1 (point-min))
               (setq p2 (point-max))))
      (kill-ring-save p1 p2)))
  (global-set-key [remap kill-ring-save] 'smart/kill-ring-save)
#+end_src

*** Kill region

#+begin_src emacs-lisp
  ;;;###autoload
  (defun smart/kill-region ()
    "Cut current line, or text selection to kill ring.

  When `universal-argument' is called first, cut whole buffer (but
  respect `narrow-to-region')."
    (interactive)
    (let (p1 p2)
      (if (null current-prefix-arg)
          (progn (if (use-region-p)
                     (progn (setq p1 (region-beginning))
                            (setq p2 (region-end)))
                   (progn (setq p1 (line-beginning-position))
                          (setq p2 (line-beginning-position 2)))))
        (progn (setq p1 (point-min))
               (setq p2 (point-max))))
      (kill-region p1 p2)))
  (global-set-key [remap kill-region] 'smart/kill-region)
#+end_src

** Case insensitive sort-lines

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/sort-lines-nocase ()
    "Sort marked lines with case sensitivity."
    (interactive)
    (let ((sort-fold-case t))
      (call-interactively 'sort-lines)))
#+end_src

** Surround stuff

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/surround (begin end open close)
    "Put OPEN at BEGIN and CLOSE at END of the region.

  If you omit CLOSE, it will reuse OPEN."
    (interactive  "r\nsStart: \nsEnd: ")
    (save-excursion
      (goto-char end)
      (if (string= close "")
          (insert open)
        (insert close))
      (goto-char begin)
      (insert open)))
  (global-set-key (kbd "M-s M-s") 'my/surround)
#+end_src

** Untabify a buffer

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/untabify-buffer ()
    "Convert all tabs to spaces in the buffer."
    (interactive)
    (untabify (point-min) (point-max)))
#+end_src

** XML pretty print

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/xml-pretty-print ()
    "Reformat and indent XML."
    (interactive)
    (save-excursion
      (sgml-pretty-print (point-min) (point-max))
      (indent-region (point-min) (point-max))))
#+end_src

