README.html

<div id="outline-container-sec-12-5-2" class="outline-4">
<h4 id="sec-12-5-2"><span class="section-number-4">12.5.2</span> Narrow or widen DWIM</h4>
<div class="outline-text-4" id="text-12-5-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">smart/narrow-or-widen-dwim</span> (p)
  <span style="color: #95e454;">"If the buffer is narrowed, it widens, otherwise, it narrows intelligently.</span>

<span style="color: #95e454;">Intelligently means: region, org-src-block, org-subtree, or</span>
<span style="color: #95e454;">defun, whichever applies first.</span>

<span style="color: #95e454;">Narrowing to org-src-block actually calls `</span><span style="color: #e5786d;">org-edit-src-code</span><span style="color: #95e454;">'.</span>
<span style="color: #95e454;">With prefix P, don't widen, just narrow even if buffer is already</span>
<span style="color: #95e454;">narrowed."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"P"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">declare</span> (interactive-only))
  (<span style="color: #8ac6f2; font-weight: bold;">cond</span> ((<span style="color: #8ac6f2; font-weight: bold;">and</span> (buffer-narrowed-p) (not p)) (widen))
        ((region-active-p)
         (narrow-to-region (region-beginning) (region-end)))
        ((derived-mode-p 'org-mode)
         <span style="color: #99968b;">;; </span><span style="color: #99968b;">`</span><span style="color: #e5786d;">org-edit-src-code</span><span style="color: #99968b;">' is not a real narrowing command.</span>
         <span style="color: #99968b;">;; </span><span style="color: #99968b;">Remove this first conditional if you don't want it.</span>
         (<span style="color: #8ac6f2; font-weight: bold;">cond</span> ((<span style="color: #8ac6f2; font-weight: bold;">ignore-errors</span> (org-edit-src-code))
                (delete-other-windows))
               ((org-at-block-p)
                (org-narrow-to-block))
               (t (org-narrow-to-subtree))))
        (t (narrow-to-defun))))
(define-key ctl-x-map <span style="color: #95e454;">"n"</span> 'smart/narrow-or-widen-dwim)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-5-3" class="outline-4">
<h4 id="sec-12-5-3"><span class="section-number-4">12.5.3</span> Beginning of line</h4>
<div class="outline-text-4" id="text-12-5-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">smart/move-beginning-of-line</span> ()
  <span style="color: #95e454;">"Move point back to indentation.</span>

<span style="color: #95e454;">If there is any non blank characters to the left of the cursor.</span>
<span style="color: #95e454;">Otherwise point moves to beginning of line."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (= (point) (<span style="color: #8ac6f2; font-weight: bold;">save-excursion</span> (back-to-indentation) (point)))
      (beginning-of-line)
    (back-to-indentation)))
(global-set-key [remap move-beginning-of-line] 'smart/move-beginning-of-line)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-5-4" class="outline-4">
<h4 id="sec-12-5-4"><span class="section-number-4">12.5.4</span> Kill ring save</h4>
<div class="outline-text-4" id="text-12-5-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">smart/kill-ring-save</span> ()
  <span style="color: #95e454;">"Copy current line or text selection to kill ring.</span>

<span style="color: #95e454;">When `</span><span style="color: #e5786d;">universal-argument</span><span style="color: #95e454;">' is called first, copy whole buffer (but</span>
<span style="color: #95e454;">respect `</span><span style="color: #e5786d;">narrow-to-region</span><span style="color: #95e454;">')."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> (p1 p2)
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> (null current-prefix-arg)
        (<span style="color: #8ac6f2; font-weight: bold;">progn</span> (<span style="color: #8ac6f2; font-weight: bold;">if</span> (use-region-p)
                   (<span style="color: #8ac6f2; font-weight: bold;">progn</span> (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p1 (region-beginning))
                          (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p2 (region-end)))
                 (<span style="color: #8ac6f2; font-weight: bold;">progn</span> (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p1 (line-beginning-position))
                        (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p2 (line-end-position)))))
      (<span style="color: #8ac6f2; font-weight: bold;">progn</span> (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p1 (point-min))
             (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p2 (point-max))))
    (kill-ring-save p1 p2)))
(global-set-key [remap kill-ring-save] 'smart/kill-ring-save)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-5-5" class="outline-4">
<h4 id="sec-12-5-5"><span class="section-number-4">12.5.5</span> Kill region</h4>
<div class="outline-text-4" id="text-12-5-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">smart/kill-region</span> ()
  <span style="color: #95e454;">"Cut current line, or text selection to kill ring.</span>

<span style="color: #95e454;">When `</span><span style="color: #e5786d;">universal-argument</span><span style="color: #95e454;">' is called first, cut whole buffer (but</span>
<span style="color: #95e454;">respect `</span><span style="color: #e5786d;">narrow-to-region</span><span style="color: #95e454;">')."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> (p1 p2)
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> (null current-prefix-arg)
        (<span style="color: #8ac6f2; font-weight: bold;">progn</span> (<span style="color: #8ac6f2; font-weight: bold;">if</span> (use-region-p)
                   (<span style="color: #8ac6f2; font-weight: bold;">progn</span> (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p1 (region-beginning))
                          (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p2 (region-end)))
                 (<span style="color: #8ac6f2; font-weight: bold;">progn</span> (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p1 (line-beginning-position))
                        (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p2 (line-beginning-position 2)))))
      (<span style="color: #8ac6f2; font-weight: bold;">progn</span> (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p1 (point-min))
             (<span style="color: #8ac6f2; font-weight: bold;">setq</span> p2 (point-max))))
    (kill-region p1 p2)))
(global-set-key [remap kill-region] 'smart/kill-region)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-12-6" class="outline-3">
<h3 id="sec-12-6"><span class="section-number-3">12.6</span> Case insensitive sort-lines</h3>
<div class="outline-text-3" id="text-12-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/sort-lines-nocase</span> ()
  <span style="color: #95e454;">"Sort marked lines with case sensitivity."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((sort-fold-case t))
    (call-interactively 'sort-lines)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-7" class="outline-3">
<h3 id="sec-12-7"><span class="section-number-3">12.7</span> Surround stuff</h3>
<div class="outline-text-3" id="text-12-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/surround</span> (begin end open close)
  <span style="color: #95e454;">"Put OPEN at BEGIN and CLOSE at END of the region.</span>

<span style="color: #95e454;">If you omit CLOSE, it will reuse OPEN."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>  <span style="color: #95e454;">"r\nsStart: \nsEnd: "</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">save-excursion</span>
    (goto-char end)
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> (string= close <span style="color: #95e454;">""</span>)
        (insert open)
      (insert close))
    (goto-char begin)
    (insert open)))
(global-set-key (kbd <span style="color: #95e454;">"M-s M-s"</span>) 'my/surround)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-8" class="outline-3">
<h3 id="sec-12-8"><span class="section-number-3">12.8</span> Untabify a buffer</h3>
<div class="outline-text-3" id="text-12-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/untabify-buffer</span> ()
  <span style="color: #95e454;">"Convert all tabs to spaces in the buffer."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (untabify (point-min) (point-max)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-9" class="outline-3">
<h3 id="sec-12-9"><span class="section-number-3">12.9</span> XML pretty print</h3>
<div class="outline-text-3" id="text-12-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/xml-pretty-print</span> ()
  <span style="color: #95e454;">"Reformat and indent XML."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">save-excursion</span>
    (sgml-pretty-print (point-min) (point-max))
    (indent-region (point-min) (point-max))))
</pre>
</div>
</div>
</div>
