README.org
** Yank pop forwards

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/yank-pop-forwards (arg)
    "Cycle forwards through the kill.  Reverse `yank-pop'.  With ARG."
    (interactive "p")
    (yank-pop (- arg)))
  (global-set-key (kbd "C-M-y") 'my/yank-pop-forwards)
#+end_src

** Editing related keyboard built-in keybindings

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c C-e") 'pp-eval-last-sexp)
  (global-set-key (kbd "M-;") 'comment-line)
  (global-set-key (kbd "M-z") 'zap-up-to-char)
  (global-set-key (kbd "C-x M-t") 'transpose-regions)
  (global-set-key (kbd "C-x M-p") 'transpose-paragraphs)
  (global-set-key (kbd "M-SPC") 'cycle-spacing)
  (global-set-key (kbd "M-%") 'query-replace-regexp)
#+end_src

** DWIM replacements for changing case

#+begin_src emacs-lisp
  (global-set-key [remap capitalize-word] 'capitalize-dwim)
  (global-set-key [remap downcase-word] 'downcase-dwim)
  (global-set-key [remap upcase-word] 'upcase-dwim)
#+end_src

* File manipulation functions
** Delete this file

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/delete-this-file ()
    "Delete the current file, and kill the buffer."
    (interactive)
    (or (buffer-file-name) (error "No file is currently being edited"))
    (when (yes-or-no-p (format "Really delete '%s'?"
                               (file-name-nondirectory buffer-file-name)))
      (delete-file (buffer-file-name))
      (kill-this-buffer)))
  (global-set-key (kbd "C-c f d") 'my/delete-this-file)
#+end_src

** Yank current file name to kill ring

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/copy-file-name-to-clipboard ()
    "Copy the current buffer file name to the clipboard."
    (interactive)
    (let ((filename (if (equal major-mode 'dired-mode)
                        default-directory
                      (buffer-file-name))))
      (when filename
        (kill-new filename)
        (message "Copied buffer file name '%s' to the clipboard." filename))))
  (global-set-key (kbd "C-c f w") 'my/copy-file-name-to-clipboard)
#+end_src

** Make backup of current file

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/make-backup ()
    "Make a backup copy of current file or dired marked files.

  If in dired, backup current file or marked files."
    (interactive)
    (let (($fname (buffer-file-name)))
      (if $fname
          (let (($backup-name
                 (concat $fname "." (format-time-string "%y%m%d%H%M") ".bak")))
            (copy-file $fname $backup-name t)
            (message (concat "Backup saved at: " $backup-name)))
        (if (string-equal major-mode "dired-mode")
            (progn
              (mapc (lambda ($x)
                      (let (($backup-name
                             (concat $x "." (format-time-string "%y%m%d%H%M") ".bak")))
                        (copy-file $x $backup-name t)))
                    (dired-get-marked-files))
              (message "marked files backed up"))
          (user-error "Buffer not file nor dired")))))
#+end_src

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/make-backup-and-save ()
    "Backup of current file and save, or backup dired marked files.
  For detail, see `my/make-backup'."
    (interactive)
    (if (buffer-file-name)
        (progn
          (my/make-backup)
          (when (buffer-modified-p)
            (save-buffer)))
      (progn
        (my/make-backup))))
  (global-set-key (kbd "C-c f b") 'my/make-backup-and-save)
#+end_src

** Rename file and buffer

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/rename-this-file-and-buffer (new-name)
    "Renames both current buffer and file it's visiting to NEW-NAME."
    (interactive "FNew name: ")
    (let ((name (buffer-name))
          (filename (buffer-file-name)))
      (unless filename
        (error "Buffer '%s' is not visiting a file!" name))
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (when (file-exists-p filename)
            (rename-file filename new-name 1))
          (rename-buffer new-name)
          (set-visited-file-name new-name)))))
  (global-set-key (kbd "C-c f r") 'my/rename-this-file-and-buffer)
#+end_src

