README.html

<div id="outline-container-sec-12-10" class="outline-3">
<h3 id="sec-12-10"><span class="section-number-3">12.10</span> Yank pop forwards</h3>
<div class="outline-text-3" id="text-12-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/yank-pop-forwards</span> (arg)
  <span style="color: #95e454;">"Cycle forwards through the kill.  Reverse `</span><span style="color: #e5786d;">yank-pop</span><span style="color: #95e454;">'.  With ARG."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"p"</span>)
  (yank-pop (- arg)))
(global-set-key (kbd <span style="color: #95e454;">"C-M-y"</span>) 'my/yank-pop-forwards)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-11" class="outline-3">
<h3 id="sec-12-11"><span class="section-number-3">12.11</span> Editing related keyboard built-in keybindings</h3>
<div class="outline-text-3" id="text-12-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #95e454;">"C-c C-e"</span>) 'pp-eval-last-sexp)
(global-set-key (kbd <span style="color: #95e454;">"M-;"</span>) 'comment-line)
(global-set-key (kbd <span style="color: #95e454;">"M-z"</span>) 'zap-up-to-char)
(global-set-key (kbd <span style="color: #95e454;">"C-x M-t"</span>) 'transpose-regions)
(global-set-key (kbd <span style="color: #95e454;">"C-x M-p"</span>) 'transpose-paragraphs)
(global-set-key (kbd <span style="color: #95e454;">"M-SPC"</span>) 'cycle-spacing)
(global-set-key (kbd <span style="color: #95e454;">"M-%"</span>) 'query-replace-regexp)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12-12" class="outline-3">
<h3 id="sec-12-12"><span class="section-number-3">12.12</span> DWIM replacements for changing case</h3>
<div class="outline-text-3" id="text-12-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key [remap capitalize-word] 'capitalize-dwim)
(global-set-key [remap downcase-word] 'downcase-dwim)
(global-set-key [remap upcase-word] 'upcase-dwim)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> File manipulation functions</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> Delete this file</h3>
<div class="outline-text-3" id="text-13-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/delete-this-file</span> ()
  <span style="color: #95e454;">"Delete the current file, and kill the buffer."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">or</span> (buffer-file-name) (<span style="color: #ccaa8f;">error</span> <span style="color: #95e454;">"No file is currently being edited"</span>))
  (<span style="color: #8ac6f2; font-weight: bold;">when</span> (yes-or-no-p (format <span style="color: #95e454;">"Really delete '%s'?"</span>
                             (file-name-nondirectory buffer-file-name)))
    (delete-file (buffer-file-name))
    (kill-this-buffer)))
(global-set-key (kbd <span style="color: #95e454;">"C-c f d"</span>) 'my/delete-this-file)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> Yank current file name to kill ring</h3>
<div class="outline-text-3" id="text-13-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/copy-file-name-to-clipboard</span> ()
  <span style="color: #95e454;">"Copy the current buffer file name to the clipboard."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((filename (<span style="color: #8ac6f2; font-weight: bold;">if</span> (equal major-mode 'dired-mode)
                      default-directory
                    (buffer-file-name))))
    (<span style="color: #8ac6f2; font-weight: bold;">when</span> filename
      (kill-new filename)
      (message <span style="color: #95e454;">"Copied buffer file name '%s' to the clipboard."</span> filename))))
(global-set-key (kbd <span style="color: #95e454;">"C-c f w"</span>) 'my/copy-file-name-to-clipboard)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> Make backup of current file</h3>
<div class="outline-text-3" id="text-13-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/make-backup</span> ()
  <span style="color: #95e454;">"Make a backup copy of current file or dired marked files.</span>

<span style="color: #95e454;">If in dired, backup current file or marked files."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> (($fname (buffer-file-name)))
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> $fname
        (<span style="color: #8ac6f2; font-weight: bold;">let</span> (($backup-name
               (concat $fname <span style="color: #95e454;">"."</span> (format-time-string <span style="color: #95e454;">"%y%m%d%H%M"</span>) <span style="color: #95e454;">".bak"</span>)))
          (copy-file $fname $backup-name t)
          (message (concat <span style="color: #95e454;">"Backup saved at: "</span> $backup-name)))
      (<span style="color: #8ac6f2; font-weight: bold;">if</span> (string-equal major-mode <span style="color: #95e454;">"dired-mode"</span>)
          (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
            (mapc (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> ($x)
                    (<span style="color: #8ac6f2; font-weight: bold;">let</span> (($backup-name
                           (concat $x <span style="color: #95e454;">"."</span> (format-time-string <span style="color: #95e454;">"%y%m%d%H%M"</span>) <span style="color: #95e454;">".bak"</span>)))
                      (copy-file $x $backup-name t)))
                  (dired-get-marked-files))
            (message <span style="color: #95e454;">"marked files backed up"</span>))
        (<span style="color: #ccaa8f;">user-error</span> <span style="color: #95e454;">"Buffer not file nor dired"</span>)))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/make-backup-and-save</span> ()
  <span style="color: #95e454;">"Backup of current file and save, or backup dired marked files.</span>
<span style="color: #95e454;">For detail, see `</span><span style="color: #e5786d;">my/make-backup</span><span style="color: #95e454;">'."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (buffer-file-name)
      (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
        (my/make-backup)
        (<span style="color: #8ac6f2; font-weight: bold;">when</span> (buffer-modified-p)
          (save-buffer)))
    (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
      (my/make-backup))))
(global-set-key (kbd <span style="color: #95e454;">"C-c f b"</span>) 'my/make-backup-and-save)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-13-4" class="outline-3">
<h3 id="sec-13-4"><span class="section-number-3">13.4</span> Rename file and buffer</h3>
<div class="outline-text-3" id="text-13-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/rename-this-file-and-buffer</span> (new-name)
  <span style="color: #95e454;">"Renames both current buffer and file it's visiting to NEW-NAME."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"FNew name: "</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((name (buffer-name))
        (filename (buffer-file-name)))
    (<span style="color: #8ac6f2; font-weight: bold;">unless</span> filename
      (<span style="color: #ccaa8f;">error</span> <span style="color: #95e454;">"Buffer '%s' is not visiting a file!"</span> name))
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> (get-buffer new-name)
        (message <span style="color: #95e454;">"A buffer named '%s' already exists!"</span> new-name)
      (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
        (<span style="color: #8ac6f2; font-weight: bold;">when</span> (file-exists-p filename)
          (rename-file filename new-name 1))
        (rename-buffer new-name)
        (set-visited-file-name new-name)))))
(global-set-key (kbd <span style="color: #95e454;">"C-c f r"</span>) 'my/rename-this-file-and-buffer)
</pre>
</div>
</div>
</div>
