README.org
** Open current file as root

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/sudoedit (&optional arg)
    "Open current or ARG file as root."
    (interactive "P")
    (if (or arg (not buffer-file-name))
        (find-file (concat "/sudo:root@localhost:"
                           (read-file-name "Find file (as root): ")))
      (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))
  (global-set-key (kbd "C-c f s") 'my/sudoedit)
#+end_src

* Miscellaneous functions

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/google (arg)
    "Googles a query or region.  With prefix ARG, wrap in quotes."
    (interactive "P")
    (let ((query
           (if (region-active-p)
               (buffer-substring (region-beginning) (region-end))
             (read-string "Query: "))))
      (when arg (setq query (concat "\"" query "\"")))
      (browse-url
       (concat "http://www.google.com/search?ie=utf-8&oe=utf-8&q=" query))))
  (global-set-key (kbd "C-c M-g") 'my/google)

  ;;;###autoload
  (defmacro my/measure-time (&rest body)
    "Measure the time it takes to evaluate BODY."
    `(let ((time (current-time)))
       ,@body
       (message "%.06f" (float-time (time-since time)))))
#+end_src

* Window manipulation functions
** Kill buffer other window

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/kill-buffer-other-window ()
    "Kill the buffer in the last used window."
    (interactive)
    ;; Window selection is used because point goes to a different window if more
    ;; than 2 windows are present
    (let ((current-window (selected-window))
          (other-window (get-mru-window t t t)))
      (select-window other-window)
      (kill-this-buffer)
      (select-window current-window)))
  (define-key ctl-x-4-map "k" 'my/kill-buffer-other-window)
#+end_src

** Toggle focus to last window

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/last-window ()
    "Switch back and forth between two windows easily."
    (interactive)
    (let ((win (get-mru-window t t t)))
      (unless win (error "Last window not found"))
      (let ((frame (window-frame win)))
        (raise-frame frame)
        (select-frame frame)
        (select-window win))))
  (global-set-key (kbd "C-c w w") 'my/last-window)
#+end_src

** Open a buffer in another window

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/open-buffer-other-window (buffer)
    "Open a BUFFER in another window without switching to it."
    (interactive "BBuffer: ")
    (switch-to-buffer-other-window buffer)
    (other-window -1))
  (define-key ctl-x-4-map "o" 'my/open-buffer-other-window)
#+end_src

** Switch to the previous window

This is basically ~other-window~ backwards.

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/prev-window ()
    "Go the previously used window, excluding other frames."
    (interactive)
    (other-window -1))
  (global-set-key (kbd "C-x O") 'my/prev-window)
#+end_src

** Scroll lines up like Ctrl-e in Vim

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/scroll-line-up (n)
    "Scroll line up N lines.  Like Ctrl-e in Vim."
    (interactive "p")
    (scroll-up n))
  (global-set-key (kbd "M-p") 'my/scroll-line-up)
#+end_src

** Scroll lines down like Ctrl-y in Vim

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/scroll-line-down (n)
    "Scroll line down N lines.  Ctrl-y in Vim."
    (interactive "p")
    (scroll-down n))
  (global-set-key (kbd "M-n") 'my/scroll-line-down)
#+end_src

** Open last buffer in horizontal split

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/hsplit-last-buffer (prefix)
    "Split the window vertically and display the previous buffer.
  With PREFIX stay in current buffer."
    (interactive "p")
    (split-window-vertically)
    (other-window 1 nil)
    (if (= prefix 1)
        (switch-to-next-buffer)))
  (global-set-key (kbd "C-c 2") 'my/hsplit-last-buffer)
#+end_src

