README.html

<div id="outline-container-sec-13-5" class="outline-3">
<h3 id="sec-13-5"><span class="section-number-3">13.5</span> Open current file as root</h3>
<div class="outline-text-3" id="text-13-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/sudoedit</span> (<span style="color: #92a65e; font-weight: bold;">&amp;optional</span> arg)
  <span style="color: #95e454;">"Open current or ARG file as root."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"P"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (<span style="color: #8ac6f2; font-weight: bold;">or</span> arg (not buffer-file-name))
      (find-file (concat <span style="color: #95e454;">"/sudo:root@localhost:"</span>
                         (read-file-name <span style="color: #95e454;">"Find file (as root): "</span>)))
    (find-alternate-file (concat <span style="color: #95e454;">"/sudo:root@localhost:"</span> buffer-file-name))))
(global-set-key (kbd <span style="color: #95e454;">"C-c f s"</span>) 'my/sudoedit)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Miscellaneous functions</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/google</span> (arg)
  <span style="color: #95e454;">"Googles a query or region.  With prefix ARG, wrap in quotes."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"P"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((query
         (<span style="color: #8ac6f2; font-weight: bold;">if</span> (region-active-p)
             (buffer-substring (region-beginning) (region-end))
           (read-string <span style="color: #95e454;">"Query: "</span>))))
    (<span style="color: #8ac6f2; font-weight: bold;">when</span> arg (<span style="color: #8ac6f2; font-weight: bold;">setq</span> query (concat <span style="color: #95e454;">"\""</span> query <span style="color: #95e454;">"\""</span>)))
    (browse-url
     (concat <span style="color: #95e454;">"http://www.google.com/search?ie=utf-8&amp;oe=utf-8&amp;q="</span> query))))
(global-set-key (kbd <span style="color: #95e454;">"C-c M-g"</span>) 'my/google)

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defmacro</span> <span style="color: #cae682;">my/measure-time</span> (<span style="color: #92a65e; font-weight: bold;">&amp;rest</span> body)
  <span style="color: #95e454;">"Measure the time it takes to evaluate BODY."</span>
  `(<span style="color: #8ac6f2; font-weight: bold;">let</span> ((time (current-time)))
     ,@body
     (message <span style="color: #95e454;">"%.06f"</span> (float-time (time-since time)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Window manipulation functions</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> Kill buffer other window</h3>
<div class="outline-text-3" id="text-15-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/kill-buffer-other-window</span> ()
  <span style="color: #95e454;">"Kill the buffer in the last used window."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  <span style="color: #99968b;">;; </span><span style="color: #99968b;">Window selection is used because point goes to a different window if more</span>
  <span style="color: #99968b;">;; </span><span style="color: #99968b;">than 2 windows are present</span>
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((current-window (selected-window))
        (other-window (get-mru-window t t t)))
    (select-window other-window)
    (kill-this-buffer)
    (select-window current-window)))
(define-key ctl-x-4-map <span style="color: #95e454;">"k"</span> 'my/kill-buffer-other-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2"><span class="section-number-3">15.2</span> Toggle focus to last window</h3>
<div class="outline-text-3" id="text-15-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/last-window</span> ()
  <span style="color: #95e454;">"Switch back and forth between two windows easily."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((win (get-mru-window t t t)))
    (<span style="color: #8ac6f2; font-weight: bold;">unless</span> win (<span style="color: #ccaa8f;">error</span> <span style="color: #95e454;">"Last window not found"</span>))
    (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((frame (window-frame win)))
      (raise-frame frame)
      (select-frame frame)
      (select-window win))))
(global-set-key (kbd <span style="color: #95e454;">"C-c w w"</span>) 'my/last-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-3" class="outline-3">
<h3 id="sec-15-3"><span class="section-number-3">15.3</span> Open a buffer in another window</h3>
<div class="outline-text-3" id="text-15-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/open-buffer-other-window</span> (buffer)
  <span style="color: #95e454;">"Open a BUFFER in another window without switching to it."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"BBuffer: "</span>)
  (switch-to-buffer-other-window buffer)
  (other-window -1))
(define-key ctl-x-4-map <span style="color: #95e454;">"o"</span> 'my/open-buffer-other-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-4" class="outline-3">
<h3 id="sec-15-4"><span class="section-number-3">15.4</span> Switch to the previous window</h3>
<div class="outline-text-3" id="text-15-4">
<p>
This is basically <code>other-window</code> backwards.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/prev-window</span> ()
  <span style="color: #95e454;">"Go the previously used window, excluding other frames."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (other-window -1))
(global-set-key (kbd <span style="color: #95e454;">"C-x O"</span>) 'my/prev-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-5" class="outline-3">
<h3 id="sec-15-5"><span class="section-number-3">15.5</span> Scroll lines up like Ctrl-e in Vim</h3>
<div class="outline-text-3" id="text-15-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/scroll-line-up</span> (n)
  <span style="color: #95e454;">"Scroll line up N lines.  Like Ctrl-e in Vim."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"p"</span>)
  (scroll-up n))
(global-set-key (kbd <span style="color: #95e454;">"M-p"</span>) 'my/scroll-line-up)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-6" class="outline-3">
<h3 id="sec-15-6"><span class="section-number-3">15.6</span> Scroll lines down like Ctrl-y in Vim</h3>
<div class="outline-text-3" id="text-15-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/scroll-line-down</span> (n)
  <span style="color: #95e454;">"Scroll line down N lines.  Ctrl-y in Vim."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"p"</span>)
  (scroll-down n))
(global-set-key (kbd <span style="color: #95e454;">"M-n"</span>) 'my/scroll-line-down)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-7" class="outline-3">
<h3 id="sec-15-7"><span class="section-number-3">15.7</span> Open last buffer in horizontal split</h3>
<div class="outline-text-3" id="text-15-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/hsplit-last-buffer</span> (prefix)
  <span style="color: #95e454;">"Split the window vertically and display the previous buffer.</span>
<span style="color: #95e454;">With PREFIX stay in current buffer."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"p"</span>)
  (split-window-vertically)
  (other-window 1 nil)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (= prefix 1)
      (switch-to-next-buffer)))
(global-set-key (kbd <span style="color: #95e454;">"C-c 2"</span>) 'my/hsplit-last-buffer)
</pre>
</div>
</div>
</div>
