README.org
** Open last buffer in vertical split

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/vsplit-last-buffer (prefix)
    "Split the window horizontally and display the previous buffer.
  With PREFIX stay in current buffer."
    (interactive "p")
    (split-window-horizontally)
    (other-window 1 nil)
    (if (= prefix 1) (switch-to-next-buffer)))
  (global-set-key (kbd "C-c 3") 'my/vsplit-last-buffer)
#+end_src

** Toggle vertical -> horizontal splits

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/toggle-split ()
    "Switch window split from horizontally to vertically.

  Or vice versa.  Change right window to bottom, or change bottom
  window to right."
    (interactive)
    (let ((done))
      (dolist (dirs '((right . down) (down . right)))
        (unless done
          (let* ((win (selected-window))
                 (nextdir (car dirs))
                 (neighbour-dir (cdr dirs))
                 (next-win (windmove-find-other-window nextdir win))
                 (neighbour1 (windmove-find-other-window neighbour-dir win))
                 (neighbour2 (if next-win (with-selected-window next-win
                                            (windmove-find-other-window neighbour-dir next-win)))))
            ;;(message "win: %s\nnext-win: %s\nneighbour1: %s\nneighbour2:%s" win next-win neighbour1 neighbour2)
            (setq done (and (eq neighbour1 neighbour2)
                            (not (eq (minibuffer-window) next-win))))
            (if done
                (let* ((other-buf (window-buffer next-win)))
                  (delete-window next-win)
                  (if (eq nextdir 'right)
                      (split-window-vertically)
                    (split-window-horizontally))
                  (set-window-buffer (windmove-find-other-window neighbour-dir) other-buf))))))))
  (define-key ctl-x-4-map "s" 'my/toggle-split)
#+end_src

** Transpose windows

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/transpose-windows (arg)
    "Transpose windows.  Use prefix ARG to transpose in the other direction."
    (interactive "P")
    (if (not (> (count-windows) 1))
        (message "You can't rotate a single window!")
      (let* ((rotate-times (prefix-numeric-value arg))
             (direction (if (or (< rotate-times 0) (equal arg '(4)))
                            'reverse 'identity)))
        (dotimes (_ (abs rotate-times))
          (dotimes (i (- (count-windows) 1))
            (let* ((w1 (elt (funcall direction (window-list)) i))
                   (w2 (elt (funcall direction (window-list)) (+ i 1)))
                   (b1 (window-buffer w1))
                   (b2 (window-buffer w2))
                   (s1 (window-start w1))
                   (s2 (window-start w2))
                   (p1 (window-point w1))
                   (p2 (window-point w2)))
              (set-window-buffer-start-and-point w1 b2 s2 p2)
              (set-window-buffer-start-and-point w2 b1 s1 p1)))))))
  (define-key ctl-x-4-map "t" 'my/transpose-windows)
#+end_src

** Windmove keybindings

#+begin_src emacs-lisp
  (autoload 'windmove-left "windmove" nil t)
  (global-set-key (kbd "C-c w b") 'windmove-left)
  (autoload 'windmove-right "windmove" nil t)
  (global-set-key (kbd "C-c w f") 'windmove-right)
  (autoload 'windmove-up "windmove" nil t)
  (global-set-key (kbd "C-c w p") 'windmove-up)
  (autoload 'windmove-down "windmove" nil t)
  (global-set-key (kbd "C-c w n") 'windmove-down)
  (with-eval-after-load 'windmove
    (setq windmove-wrap-around t)
    (message "Lazy loaded windmove :-)"))
#+end_src

** Winner mode

[[https://www.gnu.org/software/emacs/manual/html_node/elisp/Startup-Summary.html#Startup-Summary][Startup Summary]]

#+begin_src emacs-lisp
  (add-hook 'window-setup-hook 'winner-mode)
  (global-set-key (kbd "C-c w u") 'winner-undo)
  (global-set-key (kbd "C-c w r") 'winner-redo)
#+end_src

** Scroll other window down

#+begin_src emacs-lisp
(global-set-key (kbd "C-c v") 'scroll-other-window-down)
#+end_src>
* Emacs built in package configuration
** Auto-revert

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'global-auto-revert-mode) ;; reload if file changed on disk
#+end_src

** Dabbrev

#+begin_src emacs-lisp
  (with-eval-after-load 'dabbrev
    (setq abbrev-file-name (concat user-emacs-directory "abbrevs"))
    (setq save-abbrevs 'silently)
    (setq dabbrev-abbrev-char-regexp "\\sw\\|\\s_")
    (setq dabbrev-abbrev-skip-leading-regexp "[$*/=']")
    (setq dabbrev-backward-only nil)
    (setq dabbrev-case-distinction 'case-replace)
    (setq dabbrev-case-fold-search t)
    (setq dabbrev-case-replace 'case-replace)
    (setq dabbrev-check-other-buffers t)
    (setq dabbrev-eliminate-newlines t)
    (setq dabbrev-upcase-means-case-search t)
    (message "Lazy loaded dabbrev :-)"))
#+end_src

