README.html

<div id="outline-container-sec-15-8" class="outline-3">
<h3 id="sec-15-8"><span class="section-number-3">15.8</span> Open last buffer in vertical split</h3>
<div class="outline-text-3" id="text-15-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/vsplit-last-buffer</span> (prefix)
  <span style="color: #95e454;">"Split the window horizontally and display the previous buffer.</span>
<span style="color: #95e454;">With PREFIX stay in current buffer."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"p"</span>)
  (split-window-horizontally)
  (other-window 1 nil)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (= prefix 1) (switch-to-next-buffer)))
(global-set-key (kbd <span style="color: #95e454;">"C-c 3"</span>) 'my/vsplit-last-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-9" class="outline-3">
<h3 id="sec-15-9"><span class="section-number-3">15.9</span> Toggle vertical -&gt; horizontal splits</h3>
<div class="outline-text-3" id="text-15-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/toggle-split</span> ()
  <span style="color: #95e454;">"Switch window split from horizontally to vertically.</span>

<span style="color: #95e454;">Or vice versa.  Change right window to bottom, or change bottom</span>
<span style="color: #95e454;">window to right."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((done))
    (<span style="color: #8ac6f2; font-weight: bold;">dolist</span> (dirs '((right . down) (down . right)))
      (<span style="color: #8ac6f2; font-weight: bold;">unless</span> done
        (<span style="color: #8ac6f2; font-weight: bold;">let*</span> ((win (selected-window))
               (nextdir (car dirs))
               (neighbour-dir (cdr dirs))
               (next-win (windmove-find-other-window nextdir win))
               (neighbour1 (windmove-find-other-window neighbour-dir win))
               (neighbour2 (<span style="color: #8ac6f2; font-weight: bold;">if</span> next-win (<span style="color: #8ac6f2; font-weight: bold;">with-selected-window</span> next-win
                                          (windmove-find-other-window neighbour-dir next-win)))))
          <span style="color: #99968b;">;;</span><span style="color: #99968b;">(message "win: %s\nnext-win: %s\nneighbour1: %s\nneighbour2:%s" win next-win neighbour1 neighbour2)</span>
          (<span style="color: #8ac6f2; font-weight: bold;">setq</span> done (<span style="color: #8ac6f2; font-weight: bold;">and</span> (eq neighbour1 neighbour2)
                          (not (eq (minibuffer-window) next-win))))
          (<span style="color: #8ac6f2; font-weight: bold;">if</span> done
              (<span style="color: #8ac6f2; font-weight: bold;">let*</span> ((other-buf (window-buffer next-win)))
                (delete-window next-win)
                (<span style="color: #8ac6f2; font-weight: bold;">if</span> (eq nextdir 'right)
                    (split-window-vertically)
                  (split-window-horizontally))
                (set-window-buffer (windmove-find-other-window neighbour-dir) other-buf))))))))
(define-key ctl-x-4-map <span style="color: #95e454;">"s"</span> 'my/toggle-split)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-10" class="outline-3">
<h3 id="sec-15-10"><span class="section-number-3">15.10</span> Transpose windows</h3>
<div class="outline-text-3" id="text-15-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/transpose-windows</span> (arg)
  <span style="color: #95e454;">"Transpose windows.  Use prefix ARG to transpose in the other direction."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"P"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (not (&gt; (count-windows) 1))
      (message <span style="color: #95e454;">"You can't rotate a single window!"</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">let*</span> ((rotate-times (prefix-numeric-value arg))
           (direction (<span style="color: #8ac6f2; font-weight: bold;">if</span> (<span style="color: #8ac6f2; font-weight: bold;">or</span> (&lt; rotate-times 0) (equal arg '(4)))
                          'reverse 'identity)))
      (<span style="color: #8ac6f2; font-weight: bold;">dotimes</span> (_ (abs rotate-times))
        (<span style="color: #8ac6f2; font-weight: bold;">dotimes</span> (i (- (count-windows) 1))
          (<span style="color: #8ac6f2; font-weight: bold;">let*</span> ((w1 (elt (funcall direction (window-list)) i))
                 (w2 (elt (funcall direction (window-list)) (+ i 1)))
                 (b1 (window-buffer w1))
                 (b2 (window-buffer w2))
                 (s1 (window-start w1))
                 (s2 (window-start w2))
                 (p1 (window-point w1))
                 (p2 (window-point w2)))
            (set-window-buffer-start-and-point w1 b2 s2 p2)
            (set-window-buffer-start-and-point w2 b1 s1 p1)))))))
(define-key ctl-x-4-map <span style="color: #95e454;">"t"</span> 'my/transpose-windows)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-11" class="outline-3">
<h3 id="sec-15-11"><span class="section-number-3">15.11</span> Windmove keybindings</h3>
<div class="outline-text-3" id="text-15-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(autoload 'windmove-left <span style="color: #95e454;">"windmove"</span> nil t)
(global-set-key (kbd <span style="color: #95e454;">"C-c w b"</span>) 'windmove-left)
(autoload 'windmove-right <span style="color: #95e454;">"windmove"</span> nil t)
(global-set-key (kbd <span style="color: #95e454;">"C-c w f"</span>) 'windmove-right)
(autoload 'windmove-up <span style="color: #95e454;">"windmove"</span> nil t)
(global-set-key (kbd <span style="color: #95e454;">"C-c w p"</span>) 'windmove-up)
(autoload 'windmove-down <span style="color: #95e454;">"windmove"</span> nil t)
(global-set-key (kbd <span style="color: #95e454;">"C-c w n"</span>) 'windmove-down)
(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'windmove
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> windmove-wrap-around t)
  (message <span style="color: #95e454;">"Lazy loaded windmove :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-12" class="outline-3">
<h3 id="sec-15-12"><span class="section-number-3">15.12</span> Winner mode</h3>
<div class="outline-text-3" id="text-15-12">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Startup-Summary.html#Startup-Summary">Startup Summary</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'window-setup-hook 'winner-mode)
(global-set-key (kbd <span style="color: #95e454;">"C-c w u"</span>) 'winner-undo)
(global-set-key (kbd <span style="color: #95e454;">"C-c w r"</span>) 'winner-redo)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15-13" class="outline-3">
<h3 id="sec-15-13"><span class="section-number-3">15.13</span> Scroll other window down</h3>
<div class="outline-text-3" id="text-15-13">
<p>
#+begin<sub>src</sub> emacs-lisp
(global-set-key (kbd "C-c v") 'scroll-other-window-down)
#+end<sub>src</sub>&gt;
</p>
</div>
</div>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Emacs built in package configuration</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> Auto-revert</h3>
<div class="outline-text-3" id="text-16-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'global-auto-revert-mode) <span style="color: #99968b;">;; </span><span style="color: #99968b;">reload if file changed on disk</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> Dabbrev</h3>
<div class="outline-text-3" id="text-16-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'dabbrev
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> abbrev-file-name (concat user-emacs-directory <span style="color: #95e454;">"abbrevs"</span>))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> save-abbrevs 'silently)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dabbrev-abbrev-char-regexp <span style="color: #95e454;">"\\sw</span><span style="color: #95e454; font-weight: bold;">\\</span><span style="color: #95e454; font-weight: bold;">|</span><span style="color: #95e454;">\\s_"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dabbrev-abbrev-skip-leading-regexp <span style="color: #95e454;">"[$*/=']"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dabbrev-backward-only nil)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dabbrev-case-distinction 'case-replace)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dabbrev-case-fold-search t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dabbrev-case-replace 'case-replace)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dabbrev-check-other-buffers t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dabbrev-eliminate-newlines t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dabbrev-upcase-means-case-search t)
  (message <span style="color: #95e454;">"Lazy loaded dabbrev :-)"</span>))
</pre>
</div>
</div>
</div>
