README.org
** Dired
#+begin_src emacs-lisp
  (with-eval-after-load 'dired
    ;;;###autoload
    (defun my/dired-get-size ()
      "Get cumlative size of marked or current item."
      (interactive)
      (let ((files (dired-get-marked-files)))
        (with-temp-buffer
          (apply 'call-process "/usr/bin/du" nil t nil "-sch" files)
          (message "Size of all marked files: %s"
                   (progn
                     (re-search-backward "\\(^[0-9.,]+[A-Za-z]+\\).*total$")
                     (match-string 1))))))

    ;;;###autoload
    (defun my/dired-open-marked-files ()
      "Open marked files."
      (interactive)
      (let ((distinguish-one-marked nil))
        (mapc 'find-file
              (dired-map-over-marks
               (dired-get-file-for-visit)
               current-prefix-arg))))

    ;;;###autoload
    (defun my/dired-back-to-top ()
      "Go to first file in directory."
      (interactive)
      (goto-char (point-min))
      (dired-next-line 2))

    ;;;###autoload
    (defun my/dired-jump-to-bottom ()
      "Go to last file in directory."
      (interactive)
      (goto-char (point-max))
      (dired-next-line -1))

    (defgroup my/dired-peep nil
      "See the file at point when browsing in a Dired buffer."
      :group 'dired)

    (setq my/dired-peep-next-current-buffer nil)

    ;;;###autoload
    (defun my/dired-peep-next ()
      (interactive)
      (next-line 1)
      (dired-find-file-other-window)
      (if my/dired-peep-next-current-buffer (kill-buffer my/dired-peep-next-current-buffer))
      (setq my/dired-peep-next-current-buffer (current-buffer))
      (other-window 1))

    ;;;###autoload
    (defun my/dired-peep-previous ()
      (interactive)
      (previous-line 1)
      (dired-find-file-other-window)
      (if my/dired-peep-next-current-buffer (kill-buffer my/dired-peep-next-current-buffer))
      (setq my/dired-peep-next-current-buffer (current-buffer))
      (other-window 1))

    ;;;###autoload
    (define-minor-mode my/dired-peep-mode
      "Toggle preview of files when browsing in a Dired buffer."
      :global t
      :group 'my/dired-peep
      (if my/dired-peep-mode
          (progn
            (define-key dired-mode-map "n" 'my/dired-peep-next)
            (define-key dired-mode-map "p" 'my/dired-peep-previous))
        (progn
          (define-key dired-mode-map "n" 'dired-next-line)
          (define-key dired-mode-map "p" 'dired-previous-line)
          (other-window 1)
          (kill-buffer)
          (other-window 1))))

    (defalias 'ranger-mode 'my/dired-peep-mode)

    (defvar dired-compress-files-alist
      '(("\\.tar\\.gz\\'" . "tar -c %i | gzip -c9 > %o")
        ("\\.zip\\'" . "zip %o -r --filesync %i"))
      "Control the compression shell command for `dired-do-compress-to'.

    Each element is (REGEXP . CMD), where REGEXP is the name of the
    archive to which you want to compress, and CMD the the
    corresponding command.

    Within CMD, %i denotes the input file(s), and %o denotes the
    output file.  %i path(s) are relative, while %o is absolute.")

    (autoload 'dired-omit-mode "dired-x"
      "Omit files from dired listings." t)

    (autoload 'dired-omit-files "dired-x"
      "User regex to specify what files to omit." t)

    (when (eq system-type 'berkeley-unix)
      (setq dired-listing-switches "-alhpL"))

    (when (eq system-type 'gnu/linux)
      (setq dired-listing-switches
            "-AGFhlv --group-directories-first --time-style=long-iso"))

    (setq dired-omit-files "\\`[.]?#\\|\\`[.][.]?\\'\\|^\\..+$")
    (setq dired-dwim-target t
          delete-by-moving-to-trash t
          dired-use-ls-dired nil
          dired-recursive-copies 'always
          dired-recursive-deletes 'always)

    (defun my/dired-up-directory ()
      (interactive)
      (find-alternate-file ".."))

    (define-key dired-mode-map "b" 'my/dired-up-directory)
    (define-key dired-mode-map "f" 'dired-find-alternate-file)
    (define-key dired-mode-map "c" 'dired-do-compress-to)
    (define-key dired-mode-map ")" 'dired-omit-mode)
    (define-key dired-mode-map "r" 'ranger-mode)
    (define-key dired-mode-map "?" 'my/dired-get-size)
    (define-key dired-mode-map (vector 'remap 'end-of-buffer) 'my/dired-jump-to-bottom)
    (define-key dired-mode-map (vector 'remap 'beginning-of-buffer) 'my/dired-back-to-top)
    (message "Lazy loaded dired :-)"))

  (with-eval-after-load 'dired-aux
    (setq dired-isearch-filenames 'dwim)
    ;; The following variables were introduced in Emacs 27.1
    (when (not (version< emacs-version "27.1"))
      (setq dired-create-destination-dirs 'ask)
      (setq dired-vc-rename-file t))
    (message "Lazy loaded dired-aux :-)"))

  (with-eval-after-load 'find-dired
    ;; (setq find-ls-option '("-print0 | xargs -0 ls -ld" . "-ld"))
    (setq find-ls-option
          '("-ls" . "-AGFhlv --group-directories-first --time-style=long-iso"))
    (setq find-name-arg "-iname")
    (message "Lazy loaded find-dired :-)"))

  (with-eval-after-load 'wdired
    (setq wdired-allow-to-change-permissions t)
    (setq wdired-create-parent-directories t)
    (message "Lazy loaded wdired :-)"))

  (autoload 'dired "dired" nil t)

  ;; has to come outside of with-eval-after-load otherwise we have no dired-jump
  (autoload 'dired-jump "dired-x" ;; bound to C-x C-j by default
    "Jump to Dired buffer corresponding to current buffer." t)
  (global-set-key (kbd "C-x C-j") 'dired-jump)

  (autoload 'dired-jump-other-window "dired-x" ;; bound to C-x 4 C-j by default.
    "Like \\[dired-jump] (dired-jump) but in other window." t)
  (define-key ctl-x-4-map "C-j" 'dired-jump-other-window)

  (add-hook 'dired-mode-hook 'hl-line-mode)
#+end_src
