README.html

<div id="outline-container-sec-16-3" class="outline-3">
<h3 id="sec-16-3"><span class="section-number-3">16.3</span> Dired</h3>
<div class="outline-text-3" id="text-16-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'dired
  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/dired-get-size</span> ()
    <span style="color: #95e454;">"Get cumlative size of marked or current item."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((files (dired-get-marked-files)))
      (<span style="color: #8ac6f2; font-weight: bold;">with-temp-buffer</span>
        (apply 'call-process <span style="color: #95e454;">"/usr/bin/du"</span> nil t nil <span style="color: #95e454;">"-sch"</span> files)
        (message <span style="color: #95e454;">"Size of all marked files: %s"</span>
                 (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
                   (re-search-backward <span style="color: #95e454;">"</span><span style="color: #95e454; font-weight: bold;">\\</span><span style="color: #95e454; font-weight: bold;">(</span><span style="color: #95e454;">^[0-9.,]+[A-Za-z]+</span><span style="color: #95e454; font-weight: bold;">\\</span><span style="color: #95e454; font-weight: bold;">)</span><span style="color: #95e454;">.*total$"</span>)
                   (match-string 1))))))

  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/dired-open-marked-files</span> ()
    <span style="color: #95e454;">"Open marked files."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((distinguish-one-marked nil))
      (mapc 'find-file
            (<span style="color: #8ac6f2; font-weight: bold;">dired-map-over-marks</span>
             (dired-get-file-for-visit)
             current-prefix-arg))))

  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/dired-back-to-top</span> ()
    <span style="color: #95e454;">"Go to first file in directory."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (goto-char (point-min))
    (dired-next-line 2))

  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/dired-jump-to-bottom</span> ()
    <span style="color: #95e454;">"Go to last file in directory."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (goto-char (point-max))
    (dired-next-line -1))

  (<span style="color: #8ac6f2; font-weight: bold;">defgroup</span> <span style="color: #92a65e; font-weight: bold;">my/dired-peep</span> nil
    <span style="color: #95e454;">"See the file at point when browsing in a Dired buffer."</span>
    <span style="color: #e5786d;">:group</span> 'dired)

  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> my/dired-peep-next-current-buffer nil)

  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/dired-peep-next</span> ()
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (next-line 1)
    (dired-find-file-other-window)
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> my/dired-peep-next-current-buffer (kill-buffer my/dired-peep-next-current-buffer))
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> my/dired-peep-next-current-buffer (current-buffer))
    (other-window 1))

  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/dired-peep-previous</span> ()
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (previous-line 1)
    (dired-find-file-other-window)
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> my/dired-peep-next-current-buffer (kill-buffer my/dired-peep-next-current-buffer))
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> my/dired-peep-next-current-buffer (current-buffer))
    (other-window 1))

  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">define-minor-mode</span> <span style="color: #cae682;">my/dired-peep-mode</span>
    <span style="color: #95e454;">"Toggle preview of files when browsing in a Dired buffer."</span>
    <span style="color: #e5786d;">:global</span> t
    <span style="color: #e5786d;">:group</span> 'my/dired-peep
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> my/dired-peep-mode
        (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
          (define-key dired-mode-map <span style="color: #95e454;">"n"</span> 'my/dired-peep-next)
          (define-key dired-mode-map <span style="color: #95e454;">"p"</span> 'my/dired-peep-previous))
      (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
        (define-key dired-mode-map <span style="color: #95e454;">"n"</span> 'dired-next-line)
        (define-key dired-mode-map <span style="color: #95e454;">"p"</span> 'dired-previous-line)
        (other-window 1)
        (kill-buffer)
        (other-window 1))))

  (<span style="color: #8ac6f2; font-weight: bold;">defalias</span> '<span style="color: #cae682;">ranger-mode</span> 'my/dired-peep-mode)

  (<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">dired-compress-files-alist</span>
    '((<span style="color: #95e454;">"\\.tar\\.gz\\'"</span> . <span style="color: #95e454;">"tar -c %i | gzip -c9 &gt; %o"</span>)
      (<span style="color: #95e454;">"\\.zip\\'"</span> . <span style="color: #95e454;">"zip %o -r --filesync %i"</span>))
    <span style="color: #95e454;">"Control the compression shell command for `</span><span style="color: #e5786d;">dired-do-compress-to</span><span style="color: #95e454;">'.</span>

<span style="color: #95e454;">  Each element is (REGEXP . CMD), where REGEXP is the name of the</span>
<span style="color: #95e454;">  archive to which you want to compress, and CMD the the</span>
<span style="color: #95e454;">  corresponding command.</span>

<span style="color: #95e454;">  Within CMD, %i denotes the input file(s), and %o denotes the</span>
<span style="color: #95e454;">  output file.  %i path(s) are relative, while %o is absolute."</span>)

  (autoload 'dired-omit-mode <span style="color: #95e454;">"dired-x"</span>
    <span style="color: #95e454;">"Omit files from dired listings."</span> t)

  (autoload 'dired-omit-files <span style="color: #95e454;">"dired-x"</span>
    <span style="color: #95e454;">"User regex to specify what files to omit."</span> t)

  (<span style="color: #8ac6f2; font-weight: bold;">when</span> (eq system-type 'berkeley-unix)
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dired-listing-switches <span style="color: #95e454;">"-alhpL"</span>))

  (<span style="color: #8ac6f2; font-weight: bold;">when</span> (eq system-type 'gnu/linux)
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dired-listing-switches
          <span style="color: #95e454;">"-AGFhlv --group-directories-first --time-style=long-iso"</span>))

  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dired-omit-files <span style="color: #95e454;">"\\`[.]?#</span><span style="color: #95e454; font-weight: bold;">\\</span><span style="color: #95e454; font-weight: bold;">|</span><span style="color: #95e454;">\\`[.][.]?\\'</span><span style="color: #95e454; font-weight: bold;">\\</span><span style="color: #95e454; font-weight: bold;">|</span><span style="color: #95e454;">^\\..+$"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dired-dwim-target t
        delete-by-moving-to-trash t
        dired-use-ls-dired nil
        dired-recursive-copies 'always
        dired-recursive-deletes 'always)

  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/dired-up-directory</span> ()
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (find-alternate-file <span style="color: #95e454;">".."</span>))

  (define-key dired-mode-map <span style="color: #95e454;">"b"</span> 'my/dired-up-directory)
  (define-key dired-mode-map <span style="color: #95e454;">"f"</span> 'dired-find-alternate-file)
  (define-key dired-mode-map <span style="color: #95e454;">"c"</span> 'dired-do-compress-to)
  (define-key dired-mode-map <span style="color: #95e454;">")"</span> 'dired-omit-mode)
  (define-key dired-mode-map <span style="color: #95e454;">"r"</span> 'ranger-mode)
  (define-key dired-mode-map <span style="color: #95e454;">"?"</span> 'my/dired-get-size)
  (define-key dired-mode-map (vector 'remap 'end-of-buffer) 'my/dired-jump-to-bottom)
  (define-key dired-mode-map (vector 'remap 'beginning-of-buffer) 'my/dired-back-to-top)
  (message <span style="color: #95e454;">"Lazy loaded dired :-)"</span>))
</pre>
</div>

<p>
Has to come outside of with-eval-after-load otherwise we have no dired-jump
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(autoload 'dired-jump <span style="color: #95e454;">"dired-x"</span> <span style="color: #99968b;">;; </span><span style="color: #99968b;">bound to C-x C-j by default</span>
  <span style="color: #95e454;">"Jump to Dired buffer corresponding to current buffer."</span> t)
(global-set-key (kbd <span style="color: #95e454;">"C-x C-j"</span>) 'dired-jump)

(autoload 'dired-jump-other-window <span style="color: #95e454;">"dired-x"</span> <span style="color: #99968b;">;; </span><span style="color: #99968b;">bound to C-x 4 C-j by default.</span>
  <span style="color: #95e454;">"Like \\[</span><span style="color: #e5786d;">dired-jump</span><span style="color: #95e454;">] (dired-jump) but in other window."</span> t)
(define-key ctl-x-4-map <span style="color: #95e454;">"C-j"</span> 'dired-jump-other-window)
</pre>
</div>

<p>
Turn on hl-line-mode
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'dired-mode-hook 'hl-line-mode)
</pre>
</div>
</div>

<div id="outline-container-sec-16-3-1" class="outline-4">
<h4 id="sec-16-3-1"><span class="section-number-4">16.3.1</span> Dired AUX</h4>
<div class="outline-text-4" id="text-16-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'dired-aux
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dired-isearch-filenames 'dwim)
  <span style="color: #99968b;">;; </span><span style="color: #99968b;">The following variables were introduced in Emacs 27.1</span>
  (<span style="color: #8ac6f2; font-weight: bold;">when</span> (not (version&lt; emacs-version <span style="color: #95e454;">"27.1"</span>))
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dired-create-destination-dirs 'ask)
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> dired-vc-rename-file t))
  (message <span style="color: #95e454;">"Lazy loaded dired-aux :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-3-2" class="outline-4">
<h4 id="sec-16-3-2"><span class="section-number-4">16.3.2</span> Find Dired</h4>
<div class="outline-text-4" id="text-16-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'find-dired
  <span style="color: #99968b;">;; </span><span style="color: #99968b;">(setq find-ls-option '("-print0 | xargs -0 ls -ld" . "-ld"))</span>
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> find-ls-option
        '(<span style="color: #95e454;">"-ls"</span> . <span style="color: #95e454;">"-AGFhlv --group-directories-first --time-style=long-iso"</span>))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> find-name-arg <span style="color: #95e454;">"-iname"</span>)
  (message <span style="color: #95e454;">"Lazy loaded find-dired :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-3-3" class="outline-4">
<h4 id="sec-16-3-3"><span class="section-number-4">16.3.3</span> Writeable Dired</h4>
<div class="outline-text-4" id="text-16-3-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'wdired
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> wdired-allow-to-change-permissions t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> wdired-create-parent-directories t)
  (message <span style="color: #95e454;">"Lazy loaded wdired :-)"</span>))
</pre>
</div>
</div>
</div>
</div>
