README.org
** Doc View

#+begin_src emacs-lisp
  (with-eval-after-load 'doc-view-mode
    (setq doc-view-continuous t)
    (setq doc-view-resolution 300)
    (message "Lazy loaded doc-view-mode :-)"))
#+end_src

** Ediff

#+begin_src emacs-lisp
  (with-eval-after-load 'ediff
    (setq ediff-diff-options "-w")
    (setq ediff-keep-variants nil)
    (setq ediff-make-buffers-readonly-at-startup nil)
    (setq ediff-merge-revisions-with-ancestor t)
    (setq ediff-show-clashes-only t)
    (setq ediff-split-window-function 'split-window-horizontally)
    (setq ediff-window-setup-function 'ediff-setup-windows-plain)
    (add-hook 'ediff-after-quit-hook-internal 'winner-undo)

    ;; https://emacs.stackexchange.com/a/24602
    ;;;###autoload
    (defun disable-y-or-n-p (orig-fun &rest args)
      "Advise ORIG-FUN with ARGS so it dynamically rebinds `y-or-n-p'."
      (cl-letf (((symbol-function 'y-or-n-p) (lambda () t)))
        (apply orig-fun args)))

    (advice-add 'ediff-quit :around #'disable-y-or-n-p)
    (message "Lazy loaded ediff :-)"))
#+end_src

** Electric

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'electric-indent-mode)
  (add-hook 'after-init-hook 'electric-pair-mode)
#+end_src

** ERC

#+begin_src emacs-lisp
  (with-eval-after-load 'erc
    (setq erc-autojoin-channels-alist '(("freenode.net"
                                         "#org-mode"
                                         "#emacs")))
    (setq erc-fill-column 80)
    (setq erc-hide-list '("JOIN" "PART" "QUIT"))
    (setq erc-input-line-position -2)
    (setq erc-keywords '("not2b"))
    (setq erc-nick "not2b")
    (setq erc-prompt-for-password t)
    (setq erc-track-enable-keybindings t)
    (message "Lazy loaded erc :-)"))
#+end_src

