README.html

<div id="outline-container-sec-16-4" class="outline-3">
<h3 id="sec-16-4"><span class="section-number-3">16.4</span> Doc View</h3>
<div class="outline-text-3" id="text-16-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'doc-view-mode
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> doc-view-continuous t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> doc-view-resolution 300)
  (message <span style="color: #95e454;">"Lazy loaded doc-view-mode :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-5" class="outline-3">
<h3 id="sec-16-5"><span class="section-number-3">16.5</span> Ediff</h3>
<div class="outline-text-3" id="text-16-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'ediff
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> ediff-diff-options <span style="color: #95e454;">"-w"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> ediff-keep-variants nil)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> ediff-make-buffers-readonly-at-startup nil)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> ediff-merge-revisions-with-ancestor t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> ediff-show-clashes-only t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> ediff-split-window-function 'split-window-horizontally)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> ediff-window-setup-function 'ediff-setup-windows-plain)
  (add-hook 'ediff-after-quit-hook-internal 'winner-undo)

  <span style="color: #99968b;">;; </span><span style="color: #99968b;">https://emacs.stackexchange.com/a/24602</span>
  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">disable-y-or-n-p</span> (orig-fun <span style="color: #92a65e; font-weight: bold;">&amp;rest</span> args)
    <span style="color: #95e454;">"Advise ORIG-FUN with ARGS so it dynamically rebinds `</span><span style="color: #e5786d;">y-or-n-p</span><span style="color: #95e454;">'."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">cl-letf</span> (((symbol-function 'y-or-n-p) (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> () t)))
      (apply orig-fun args)))

  (advice-add 'ediff-quit <span style="color: #e5786d;">:around</span> #'disable-y-or-n-p)
  (message <span style="color: #95e454;">"Lazy loaded ediff :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-6" class="outline-3">
<h3 id="sec-16-6"><span class="section-number-3">16.6</span> Electric</h3>
<div class="outline-text-3" id="text-16-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'electric-indent-mode)
(add-hook 'after-init-hook 'electric-pair-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-7" class="outline-3">
<h3 id="sec-16-7"><span class="section-number-3">16.7</span> ERC</h3>
<div class="outline-text-3" id="text-16-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'erc
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> erc-autojoin-channels-alist '((<span style="color: #95e454;">"freenode.net"</span>
                                       <span style="color: #95e454;">"#org-mode"</span>
                                       <span style="color: #95e454;">"#emacs"</span>)))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> erc-fill-column 80)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> erc-hide-list '(<span style="color: #95e454;">"JOIN"</span> <span style="color: #95e454;">"PART"</span> <span style="color: #95e454;">"QUIT"</span>))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> erc-input-line-position -2)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> erc-keywords '(<span style="color: #95e454;">"not2b"</span>))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> erc-nick <span style="color: #95e454;">"not2b"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> erc-prompt-for-password t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> erc-track-enable-keybindings t)
  (message <span style="color: #95e454;">"Lazy loaded erc :-)"</span>))
</pre>
</div>
</div>
</div>
