README.org
** Eshell

#+begin_src emacs-lisp
  (with-eval-after-load 'eshell
  ;;;###autoload
    (defun my/eshell-complete-recent-dir (&optional arg)
      "Switch to a recent `eshell' directory using completion.
  With \\[universal-argument] also open the directory in a `dired'
  buffer."
      (interactive "P")
      (let* ((dirs (ring-elements eshell-last-dir-ring))
             (dir (completing-read "Switch to recent dir: " dirs nil t)))
        (insert dir)
        (eshell-send-input)
        (when arg
          (dired dir))))

  ;;;###autoload
    (defun my/eshell-complete-history ()
      "Insert element from `eshell' history using completion."
      (interactive)
      (let ((hist (ring-elements eshell-history-ring)))
        (insert
         (completing-read "Input history: " hist nil t))))

  ;;;###autoload
    (defun my/eshell-prompt ()
      "Custom eshell prompt."
      (concat
       (propertize (user-login-name) 'face `(:foreground "green" ))
       (propertize "@" 'face `(:foreground "yellow"))
       (propertize (system-name) `face `(:foreground "green"))
       (propertize ":" 'face `(:foreground "yellow"))
       (if (string= (eshell/pwd) (getenv "HOME"))
           (propertize "~" 'face `(:foreground "magenta"))
         (propertize (eshell/basename (eshell/pwd)) 'face `(:foreground "magenta")))
       (propertize (ignore-errors (format " (%s)"
                                          (vc-responsible-backend default-directory)))
                   'face `(:foreground "cyan"))
       "\n"
       (if (= (user-uid) 0)
           (propertize "#" 'face `(:foreground "red"))
         (propertize "$" 'face `(:foreground "yellow")))
       (propertize " " 'face `(:foreground "white"))))

    ;; https://www.emacswiki.org/emacs/EshellPrompt
    (setq
     eshell-cd-on-directory t
     eshell-destroy-buffer-when-process-dies t
     eshell-highlight-prompt nil
     eshell-hist-ignoredups t
     eshell-history-size 4096
     eshell-ls-use-colors t
     eshell-prefer-lisp-functions t
     eshell-prefer-lisp-variables t
     eshell-prompt-regexp "^[^#$\n]*[#$] "
     eshell-prompt-function 'my/eshell-prompt
     eshell-review-quick-commands nil
     eshell-save-history-on-exit t
     eshell-smart-space-goes-to-end t
     eshell-where-to-jump 'begin)

    (add-to-list 'eshell-modules-list 'eshell-tramp) ;; no sudo password with ~/.authinfo
    (add-hook 'eshell-preoutput-filter-functions 'ansi-color-apply)

    (defun my/eshell-keys()
      (define-key eshell-mode-map (kbd "M-r") 'my/eshell-complete-history)
      (define-key eshell-mode-map (kbd "C-=") 'my/eshell-complete-recent-dir))

    (add-hook 'eshell-mode-hook 'my/eshell-keys)
    (message "Lazy loaded eshell :-)"))
#+end_src

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/eshell-other-window ()
    "Open an `eshell' in another window."
    (interactive)
    (split-window-sensibly)
    (other-window 1)
    (eshell))

  (autoload 'eshell "eshell" nil t)
  (global-set-key (kbd "C-c e") 'eshell)
  (global-set-key (kbd "C-c 4 e") 'my/eshell-other-window)
#+end_src

** Gnus

#+begin_src emacs-lisp
  (with-eval-after-load 'gnus
    (require 'nnir)
    (setq gnus-init-file "~/.emacs.d/init.el")
    (setq gnus-home-directory "~/.emacs.d/")
    (setq message-directory "~/.emacs.d/mail")
    (setq gnus-directory "~/.emacs.d/news")
    (setq nnfolder-directory "~/.emacs.d/mail/archive")
    (setq gnus-use-full-window nil)
    (setq gnus-select-method '(nntp "news.gwene.org"))
    ;; (setq gnus-secondary-select-methods '((nntp "news.gnus.org")))
    (setq gnus-summary-thread-gathering-function 'gnus-gather-threads-by-subject)
    (setq gnus-thread-hide-subtree t)
    (setq gnus-thread-ignore-subject t)
    (message "Lazy loaded gnus :-)"))
#+end_src

** Highlight changes

#+begin_src emacs-lisp
  (with-eval-after-load 'highlight-changes
    (global-set-key (kbd "C-c h n") 'highlight-changes-next-change)
    (global-set-key (kbd "C-c h p") 'highlight-changes-previous-change)
    (message "Lazy loaded highlight-changes-mode :-)"))
  (setq highlight-changes-visibility-initial-state nil)
  (add-hook 'emacs-startup-hook 'global-highlight-changes-mode)
#+end_src

