README.html

<div id="outline-container-sec-16-8" class="outline-3">
<h3 id="sec-16-8"><span class="section-number-3">16.8</span> Eshell</h3>
<div class="outline-text-3" id="text-16-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'eshell
<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/eshell-complete-recent-dir</span> (<span style="color: #92a65e; font-weight: bold;">&amp;optional</span> arg)
    <span style="color: #95e454;">"Switch to a recent `</span><span style="color: #e5786d;">eshell</span><span style="color: #95e454;">' directory using completion.</span>
<span style="color: #95e454;">With \\[</span><span style="color: #e5786d;">universal-argument</span><span style="color: #95e454;">] also open the directory in a `</span><span style="color: #e5786d;">dired</span><span style="color: #95e454;">'</span>
<span style="color: #95e454;">buffer."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"P"</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">let*</span> ((dirs (ring-elements eshell-last-dir-ring))
           (dir (completing-read <span style="color: #95e454;">"Switch to recent dir: "</span> dirs nil t)))
      (insert dir)
      (eshell-send-input)
      (<span style="color: #8ac6f2; font-weight: bold;">when</span> arg
        (dired dir))))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/eshell-complete-history</span> ()
    <span style="color: #95e454;">"Insert element from `</span><span style="color: #e5786d;">eshell</span><span style="color: #95e454;">' history using completion."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((hist (ring-elements eshell-history-ring)))
      (insert
       (completing-read <span style="color: #95e454;">"Input history: "</span> hist nil t))))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/eshell-prompt</span> ()
    <span style="color: #95e454;">"Custom eshell prompt."</span>
    (concat
     (propertize (user-login-name) 'face `(<span style="color: #e5786d;">:foreground</span> <span style="color: #95e454;">"green"</span> ))
     (propertize <span style="color: #95e454;">"@"</span> 'face `(<span style="color: #e5786d;">:foreground</span> <span style="color: #95e454;">"yellow"</span>))
     (propertize (system-name) `face `(<span style="color: #e5786d;">:foreground</span> <span style="color: #95e454;">"green"</span>))
     (propertize <span style="color: #95e454;">":"</span> 'face `(<span style="color: #e5786d;">:foreground</span> <span style="color: #95e454;">"yellow"</span>))
     (<span style="color: #8ac6f2; font-weight: bold;">if</span> (string= (eshell/pwd) (getenv <span style="color: #95e454;">"HOME"</span>))
         (propertize <span style="color: #95e454;">"~"</span> 'face `(<span style="color: #e5786d;">:foreground</span> <span style="color: #95e454;">"magenta"</span>))
       (propertize (eshell/basename (eshell/pwd)) 'face `(<span style="color: #e5786d;">:foreground</span> <span style="color: #95e454;">"magenta"</span>)))
     (propertize (<span style="color: #8ac6f2; font-weight: bold;">ignore-errors</span> (format <span style="color: #95e454;">" (%s)"</span>
                                        (vc-responsible-backend default-directory)))
                 'face `(<span style="color: #e5786d;">:foreground</span> <span style="color: #95e454;">"cyan"</span>))
     <span style="color: #95e454;">"\n"</span>
     (<span style="color: #8ac6f2; font-weight: bold;">if</span> (= (user-uid) 0)
         (propertize <span style="color: #95e454;">"#"</span> 'face `(<span style="color: #e5786d;">:foreground</span> <span style="color: #95e454;">"red"</span>))
       (propertize <span style="color: #95e454;">"$"</span> 'face `(<span style="color: #e5786d;">:foreground</span> <span style="color: #95e454;">"yellow"</span>)))
     (propertize <span style="color: #95e454;">" "</span> 'face `(<span style="color: #e5786d;">:foreground</span> <span style="color: #95e454;">"white"</span>))))

  <span style="color: #99968b;">;; </span><span style="color: #99968b;">https://www.emacswiki.org/emacs/EshellPrompt</span>
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span>
   eshell-cd-on-directory t
   eshell-destroy-buffer-when-process-dies t
   eshell-highlight-prompt nil
   eshell-hist-ignoredups t
   eshell-history-size 4096
   eshell-ls-use-colors t
   eshell-prefer-lisp-functions t
   eshell-prefer-lisp-variables t
   eshell-prompt-regexp <span style="color: #95e454;">"^[</span><span style="color: #95e454;">^</span><span style="color: #95e454;">#$\n]*[#$] "</span>
   eshell-prompt-function 'my/eshell-prompt
   eshell-review-quick-commands nil
   eshell-save-history-on-exit t
   eshell-smart-space-goes-to-end t
   eshell-where-to-jump 'begin)

  (add-to-list 'eshell-modules-list 'eshell-tramp) <span style="color: #99968b;">;; </span><span style="color: #99968b;">no sudo password with ~/.authinfo</span>
  (add-hook 'eshell-preoutput-filter-functions 'ansi-color-apply)

  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/eshell-keys</span>()
    (define-key eshell-mode-map (kbd <span style="color: #95e454;">"M-r"</span>) 'my/eshell-complete-history)
    (define-key eshell-mode-map (kbd <span style="color: #95e454;">"C-="</span>) 'my/eshell-complete-recent-dir))

  (add-hook 'eshell-mode-hook 'my/eshell-keys)
  (message <span style="color: #95e454;">"Lazy loaded eshell :-)"</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/eshell-other-window</span> ()
  <span style="color: #95e454;">"Open an `</span><span style="color: #e5786d;">eshell</span><span style="color: #95e454;">' in another window."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (split-window-sensibly)
  (other-window 1)
  (eshell))

(autoload 'eshell <span style="color: #95e454;">"eshell"</span> nil t)
(global-set-key (kbd <span style="color: #95e454;">"C-c e"</span>) 'eshell)
(global-set-key (kbd <span style="color: #95e454;">"C-c 4 e"</span>) 'my/eshell-other-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-9" class="outline-3">
<h3 id="sec-16-9"><span class="section-number-3">16.9</span> Gnus</h3>
<div class="outline-text-3" id="text-16-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'gnus
  (<span style="color: #8ac6f2; font-weight: bold;">require</span> '<span style="color: #e5786d;">nnir</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gnus-init-file <span style="color: #95e454;">"~/.emacs.d/init.el"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gnus-home-directory <span style="color: #95e454;">"~/.emacs.d/"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> message-directory <span style="color: #95e454;">"~/.emacs.d/mail"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gnus-directory <span style="color: #95e454;">"~/.emacs.d/news"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> nnfolder-directory <span style="color: #95e454;">"~/.emacs.d/mail/archive"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gnus-use-full-window nil)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gnus-select-method '(nntp <span style="color: #95e454;">"news.gwene.org"</span>))
  <span style="color: #99968b;">;; </span><span style="color: #99968b;">(setq gnus-secondary-select-methods '((nntp "news.gnus.org")))</span>
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gnus-summary-thread-gathering-function 'gnus-gather-threads-by-subject)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gnus-thread-hide-subtree t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gnus-thread-ignore-subject t)
  (message <span style="color: #95e454;">"Lazy loaded gnus :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-10" class="outline-3">
<h3 id="sec-16-10"><span class="section-number-3">16.10</span> Highlight changes</h3>
<div class="outline-text-3" id="text-16-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'highlight-changes
  (global-set-key (kbd <span style="color: #95e454;">"C-c h n"</span>) 'highlight-changes-next-change)
  (global-set-key (kbd <span style="color: #95e454;">"C-c h p"</span>) 'highlight-changes-previous-change)
  (message <span style="color: #95e454;">"Lazy loaded highlight-changes-mode :-)"</span>))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> highlight-changes-visibility-initial-state nil)
(add-hook 'emacs-startup-hook 'global-highlight-changes-mode)
</pre>
</div>
</div>
</div>
