README.org
** Hippie Expand

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/hippie-expand-completions (&optional hippie-expand-function)
    "Return the full list of completions generated by HIPPIE-EXPAND-FUNCTION.
  The optional argument can be generated with `make-hippie-expand-function'."
    (let ((this-command 'my/hippie-expand-completions)
          (last-command last-command)
          (buffer-modified (buffer-modified-p))
          (hippie-expand-function (or hippie-expand-function 'hippie-expand)))
      (cl-flet ((ding)) ; avoid the (ding) when hippie-expand exhausts its options.
        (while (progn
                 (funcall hippie-expand-function nil)
                 (setq last-command 'my/hippie-expand-completions)
                 (not (equal he-num -1)))))
      ;; Evaluating the completions modifies the buffer, however we will finish
      ;; up in the same state that we began.
      (set-buffer-modified-p buffer-modified)
      ;; Provide the options in the order in which they are normally generated.
      (delete he-search-string (reverse he-tried-table))))

  ;;;###autoload
  (defun my/hippie-complete-with (hippie-expand-function)
    "Offer `completing-read' using the specified HIPPIE-EXPAND-FUNCTION."
    (let* ((options (my/hippie-expand-completions hippie-expand-function))
           (selection (and options (completing-read "Completions: " options))))
      (if selection
          (he-substitute-string selection t)
        (message "No expansion found"))))

  ;;;###autoload
  (defun my/hippie-expand-completing-read ()
    "Offer `completing-read' for the word at point."
    (interactive)
    (my/hippie-complete-with 'hippie-expand))
  (global-set-key (kbd "C-c /") 'my/hippie-expand-completing-read)

  (global-set-key (kbd "M-/") 'hippie-expand)
#+end_src

** Icomplete

Turn on ~fido-mode~ if we are on Emacs 27+

#+begin_src emacs-lisp
  (if (version< emacs-version "27")
      (icomplete-mode)
    (fido-mode))
#+end_src

*** Change completion styles

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/icomplete-styles ()
    "Set icomplete styles based on Emacs version."
    (if (version< emacs-version "27")
        (setq-local completion-styles '(initials partial-completion substring basic))
      (setq-local completion-styles '(initials partial-completion flex substring basic))))
  (add-hook 'icomplete-minibuffer-setup-hook 'my/icomplete-styles)
#+end_src

*** Icomplete settings

#+begin_src emacs-lisp
  (setq icomplete-delay-completions-threshold 100)
  (setq icomplete-max-delay-chars 2)
  (setq icomplete-compute-delay 0.2)
  (setq icomplete-show-matches-on-no-input t)
  (setq icomplete-hide-common-prefix nil)
  (setq icomplete-prospects-height 1)
  ;; (setq icomplete-separator "\n")
  (setq icomplete-separator (propertize " · " 'face 'shadow))
  (setq icomplete-with-completion-tables t)
  (setq icomplete-tidy-shadowed-file-names t)
  (setq icomplete-in-buffer t)
#+end_src

*** Icomplete keybindings

#+begin_src emacs-lisp
  (if (version< emacs-version "27")
      (define-key icomplete-minibuffer-map (kbd "C-j") 'icomplete-fido-exit))
  (define-key icomplete-minibuffer-map (kbd "M-j") 'exit-minibuffer)
  (define-key icomplete-minibuffer-map (kbd "C-n") 'icomplete-forward-completions)
  (define-key icomplete-minibuffer-map (kbd "C-p") 'icomplete-backward-completions)
  (define-key icomplete-minibuffer-map (kbd "<up>") 'icomplete-backward-completions)
  (define-key icomplete-minibuffer-map (kbd "<down>") 'icomplete-forward-completions)
  (define-key icomplete-minibuffer-map (kbd "<left>") 'icomplete-backward-completions)
  (define-key icomplete-minibuffer-map (kbd "<right>") 'icomplete-forward-completions)
#+end_src

** Imenu

#+begin_src emacs-lisp
  (with-eval-after-load 'imenu
    (setq imenu-auto-rescan t)
    (setq imenu-auto-rescan-maxout 600000)
    (setq imenu-eager-completion-buffer t)
    (setq imenu-level-separator "/")
    (setq imenu-max-item-length 100)
    (setq imenu-space-replacement " ")
    (setq imenu-use-markers t)
    (setq imenu-use-popup-menu nil)
    (message "Lazy loaded imenu :-)"))

  (autoload 'imenu "imenu" nil t)
  (global-set-key (kbd "C-c i") 'imenu)
#+end_src

