README.html

<div id="outline-container-sec-16-11" class="outline-3">
<h3 id="sec-16-11"><span class="section-number-3">16.11</span> Hippie Expand</h3>
<div class="outline-text-3" id="text-16-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/hippie-expand-completions</span> (<span style="color: #92a65e; font-weight: bold;">&amp;optional</span> hippie-expand-function)
  <span style="color: #95e454;">"Return the full list of completions generated by HIPPIE-EXPAND-FUNCTION.</span>
<span style="color: #95e454;">The optional argument can be generated with `</span><span style="color: #e5786d;">make-hippie-expand-function</span><span style="color: #95e454;">'."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((this-command 'my/hippie-expand-completions)
        (last-command last-command)
        (buffer-modified (buffer-modified-p))
        (hippie-expand-function (<span style="color: #8ac6f2; font-weight: bold;">or</span> hippie-expand-function 'hippie-expand)))
    (<span style="color: #8ac6f2; font-weight: bold;">cl-flet</span> ((ding)) <span style="color: #99968b;">; </span><span style="color: #99968b;">avoid the (ding) when hippie-expand exhausts its options.</span>
      (<span style="color: #8ac6f2; font-weight: bold;">while</span> (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
               (funcall hippie-expand-function nil)
               (<span style="color: #8ac6f2; font-weight: bold;">setq</span> last-command 'my/hippie-expand-completions)
               (not (equal he-num -1)))))
    <span style="color: #99968b;">;; </span><span style="color: #99968b;">Evaluating the completions modifies the buffer, however we will finish</span>
    <span style="color: #99968b;">;; </span><span style="color: #99968b;">up in the same state that we began.</span>
    (set-buffer-modified-p buffer-modified)
    <span style="color: #99968b;">;; </span><span style="color: #99968b;">Provide the options in the order in which they are normally generated.</span>
    (delete he-search-string (reverse he-tried-table))))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/hippie-complete-with</span> (hippie-expand-function)
  <span style="color: #95e454;">"Offer `</span><span style="color: #e5786d;">completing-read</span><span style="color: #95e454;">' using the specified HIPPIE-EXPAND-FUNCTION."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">let*</span> ((options (my/hippie-expand-completions hippie-expand-function))
         (selection (<span style="color: #8ac6f2; font-weight: bold;">and</span> options (completing-read <span style="color: #95e454;">"Completions: "</span> options))))
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> selection
        (he-substitute-string selection t)
      (message <span style="color: #95e454;">"No expansion found"</span>))))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/hippie-expand-completing-read</span> ()
  <span style="color: #95e454;">"Offer `</span><span style="color: #e5786d;">completing-read</span><span style="color: #95e454;">' for the word at point."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (my/hippie-complete-with 'hippie-expand))
(global-set-key (kbd <span style="color: #95e454;">"C-c /"</span>) 'my/hippie-expand-completing-read)

(global-set-key (kbd <span style="color: #95e454;">"M-/"</span>) 'hippie-expand)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-12" class="outline-3">
<h3 id="sec-16-12"><span class="section-number-3">16.12</span> Icomplete</h3>
<div class="outline-text-3" id="text-16-12">
<p>
Turn on <code>fido-mode</code> if we are on Emacs 27+
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">if</span> (version&lt; emacs-version <span style="color: #95e454;">"27"</span>)
    (icomplete-mode)
  (fido-mode))
</pre>
</div>
</div>

<div id="outline-container-sec-16-12-1" class="outline-4">
<h4 id="sec-16-12-1"><span class="section-number-4">16.12.1</span> Change completion styles</h4>
<div class="outline-text-4" id="text-16-12-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/icomplete-styles</span> ()
  <span style="color: #95e454;">"Set icomplete styles based on Emacs version."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (version&lt; emacs-version <span style="color: #95e454;">"27"</span>)
      (<span style="color: #8ac6f2; font-weight: bold;">setq-local</span> completion-styles '(initials partial-completion substring basic))
    (<span style="color: #8ac6f2; font-weight: bold;">setq-local</span> completion-styles '(initials partial-completion flex substring basic))))
(add-hook 'icomplete-minibuffer-setup-hook 'my/icomplete-styles)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-12-2" class="outline-4">
<h4 id="sec-16-12-2"><span class="section-number-4">16.12.2</span> Icomplete settings</h4>
<div class="outline-text-4" id="text-16-12-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> icomplete-delay-completions-threshold 100)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> icomplete-max-delay-chars 2)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> icomplete-compute-delay 0.2)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> icomplete-show-matches-on-no-input t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> icomplete-hide-common-prefix nil)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> icomplete-prospects-height 1)
<span style="color: #99968b;">;; </span><span style="color: #99968b;">(setq icomplete-separator "\n")</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> icomplete-separator (propertize <span style="color: #95e454;">" &#183; "</span> 'face 'shadow))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> icomplete-with-completion-tables t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> icomplete-tidy-shadowed-file-names t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> icomplete-in-buffer t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-12-3" class="outline-4">
<h4 id="sec-16-12-3"><span class="section-number-4">16.12.3</span> Icomplete keybindings</h4>
<div class="outline-text-4" id="text-16-12-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">if</span> (version&lt; emacs-version <span style="color: #95e454;">"27"</span>)
    (define-key icomplete-minibuffer-map (kbd <span style="color: #95e454;">"C-j"</span>) 'icomplete-fido-exit))
(define-key icomplete-minibuffer-map (kbd <span style="color: #95e454;">"M-j"</span>) 'exit-minibuffer)
(define-key icomplete-minibuffer-map (kbd <span style="color: #95e454;">"C-n"</span>) 'icomplete-forward-completions)
(define-key icomplete-minibuffer-map (kbd <span style="color: #95e454;">"C-p"</span>) 'icomplete-backward-completions)
(define-key icomplete-minibuffer-map (kbd <span style="color: #95e454;">"&lt;up&gt;"</span>) 'icomplete-backward-completions)
(define-key icomplete-minibuffer-map (kbd <span style="color: #95e454;">"&lt;down&gt;"</span>) 'icomplete-forward-completions)
(define-key icomplete-minibuffer-map (kbd <span style="color: #95e454;">"&lt;left&gt;"</span>) 'icomplete-backward-completions)
(define-key icomplete-minibuffer-map (kbd <span style="color: #95e454;">"&lt;right&gt;"</span>) 'icomplete-forward-completions)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-16-13" class="outline-3">
<h3 id="sec-16-13"><span class="section-number-3">16.13</span> Imenu</h3>
<div class="outline-text-3" id="text-16-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'imenu
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> imenu-auto-rescan t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> imenu-auto-rescan-maxout 600000)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> imenu-eager-completion-buffer t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> imenu-level-separator <span style="color: #95e454;">"/"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> imenu-max-item-length 100)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> imenu-space-replacement <span style="color: #95e454;">" "</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> imenu-use-markers t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> imenu-use-popup-menu nil)
  (message <span style="color: #95e454;">"Lazy loaded imenu :-)"</span>))

(autoload 'imenu <span style="color: #95e454;">"imenu"</span> nil t)
(global-set-key (kbd <span style="color: #95e454;">"C-c i"</span>) 'imenu)
</pre>
</div>
</div>
</div>
