README.html

<div id="outline-container-sec-16-14" class="outline-3">
<h3 id="sec-16-14"><span class="section-number-3">16.14</span> Isearch</h3>
<div class="outline-text-3" id="text-16-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'isearch
   <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/isearch-exit</span> ()
    <span style="color: #95e454;">"Move point to the start of the matched string."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">when</span> (eq isearch-forward t)
      (goto-char isearch-other-end))
    (isearch-exit))

  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/isearch-abort-dwim</span> ()
    <span style="color: #95e454;">"Delete failed `</span><span style="color: #e5786d;">isearch</span><span style="color: #95e454;">' input, single char, or cancel search.</span>

<span style="color: #95e454;">This is a modified variant of `</span><span style="color: #e5786d;">isearch-abort</span><span style="color: #95e454;">' that allows us to</span>
<span style="color: #95e454;">perform the following, based on the specifics of the case: (i)</span>
<span style="color: #95e454;">delete the entirety of a non-matching part, when present; (ii)</span>
<span style="color: #95e454;">delete a single character, when possible; (iii) exit current</span>
<span style="color: #95e454;">search if no character is present and go back to point where the</span>
<span style="color: #95e454;">search started."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> (eq (length isearch-string) 0)
        (isearch-cancel)
      (isearch-del-char)
      (<span style="color: #8ac6f2; font-weight: bold;">while</span> (<span style="color: #8ac6f2; font-weight: bold;">or</span> (not isearch-success) isearch-error)
        (isearch-pop-state)))
    (isearch-update))

  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/copy-to-isearch</span> ()
    <span style="color: #95e454;">"Copy up to the search match when searching forward.</span>

<span style="color: #95e454;">When searching backward, copy to the start of the search match."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (my/isearch-exit)
    (call-interactively 'kill-ring-save)
    (exchange-point-and-mark))

  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/kill-to-isearch</span> ()
    <span style="color: #95e454;">"Kill up to the search match when searching forward.</span>

<span style="color: #95e454;">When searching backward, kill to the beginning of the match."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (my/isearch-exit)
    (call-interactively 'kill-region))

  (<span style="color: #8ac6f2; font-weight: bold;">when</span> (not (version&lt; emacs-version <span style="color: #95e454;">"27.1"</span>))
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> isearch-allow-scroll 'unlimited)
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> isearch-yank-on-move 't)
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> isearch-lazy-count t)
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> lazy-count-prefix-format nil)
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> lazy-count-suffix-format <span style="color: #95e454;">" (%s/%s)"</span>))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> search-highlight t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> search-whitespace-regexp <span style="color: #95e454;">".*?"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> isearch-lax-whitespace t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> isearch-regexp-lax-whitespace nil)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> isearch-lazy-highlight t)

  (define-key isearch-mode-map (kbd <span style="color: #95e454;">"RET"</span>) 'my/isearch-exit)
  (define-key isearch-mode-map (kbd <span style="color: #95e454;">"&lt;backspace&gt;"</span>) 'my/isearch-abort-dwim)
  (define-key isearch-mode-map (kbd <span style="color: #95e454;">"M-w"</span>) 'my/copy-to-isearch)
  (define-key isearch-mode-map (kbd <span style="color: #95e454;">"C-M-w"</span>) 'my/kill-to-isearch)
  (define-key isearch-mode-map (kbd <span style="color: #95e454;">"M-/"</span>) 'isearch-complete)
  (define-key minibuffer-local-isearch-map (kbd <span style="color: #95e454;">"M-/"</span>) 'isearch-complete-edit)
  (message <span style="color: #95e454;">"Lazy loaded isearch :-)"</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #95e454;">"C-r"</span>) 'isearch-backward-regexp)
(global-set-key (kbd <span style="color: #95e454;">"C-s"</span>) 'isearch-forward-regexp)
(global-set-key (kbd <span style="color: #95e454;">"M-s b"</span>) 'multi-isearch-buffers-regexp)
(global-set-key (kbd <span style="color: #95e454;">"M-s f"</span>) 'multi-isearch-files-regexp)
(global-set-key (kbd <span style="color: #95e454;">"M-s M-o"</span>) 'multi-occur)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'occur-mode-hook 'hl-line-mode)
(define-key occur-mode-map <span style="color: #95e454;">"t"</span> 'toggle-truncate-lines)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-15" class="outline-3">
<h3 id="sec-16-15"><span class="section-number-3">16.15</span> Minibuffer</h3>
<div class="outline-text-3" id="text-16-15">
</div><div id="outline-container-sec-16-15-1" class="outline-4">
<h4 id="sec-16-15-1"><span class="section-number-4">16.15.1</span> Save history mode</h4>
<div class="outline-text-4" id="text-16-15-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'savehist
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> savehist-additional-variables '(kill-ring search-ring regexp-search-ring))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> savehist-save-minibuffer-history 1)
  (message <span style="color: #95e454;">"Lazy loaded savehist :-)"</span>))
(add-hook 'after-init-hook 'savehist-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-15-2" class="outline-4">
<h4 id="sec-16-15-2"><span class="section-number-4">16.15.2</span> Completion framework settings</h4>
<div class="outline-text-4" id="text-16-15-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> completion-category-defaults nil)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> completion-cycle-threshold 3)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> completion-flex-nospace nil)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> completion-ignore-case t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> completion-pcm-complete-word-inserts-delimiters t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> completion-pcm-word-delimiters <span style="color: #95e454;">"-_./:| "</span>)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> completion-show-help nil)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> completions-detailed t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> completions-format 'one-column)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-15-3" class="outline-4">
<h4 id="sec-16-15-3"><span class="section-number-4">16.15.3</span> Misc Minibuffer settings</h4>
<div class="outline-text-4" id="text-16-15-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> enable-recursive-minibuffers t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> file-name-shadow-mode 1)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> minibuffer-depth-indicate-mode 1)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> minibuffer-eldef-shorten-default t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> minibuffer-electric-default-mode 1)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> read-answer-short t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> read-buffer-completion-ignore-case t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> read-file-name-completion-ignore-case t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> resize-mini-windows t)
</pre>
</div>

<p>
It may also be wise to raise gc-cons-threshold while the minibuffer is active,
so the GC doesn’t slow down expensive commands (or completion frameworks, like
helm and ivy). Stolen from <a href="https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly">Doom Emacs FAQ</a>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'minibuffer-setup-hook (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> () (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gc-cons-threshold most-positive-fixnum)))
(add-hook 'minibuffer-exit-hook (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> () (<span style="color: #8ac6f2; font-weight: bold;">setq</span> gc-cons-threshold 16777216))) <span style="color: #99968b;">; </span><span style="color: #99968b;">16mb</span>
</pre>
</div>
</div>
</div>
</div>
