README.org
** Org

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (require 'org-tempo)
  ;;;###autoload
    (defun my/org-recursive-sort ()
      "Sort all entries in the current buffer, recursively."
      (interactive)
      (org-map-entries
       (lambda ()
         (condition-case x
             (org-sort-entries nil ?a)
           (user-error)))))

  ;;;###autoload
    (defun my/org-tangle-block ()
      "Only tangle the block at point."
      (interactive)
      (let ((current-prefix-arg '(4)))
        (call-interactively 'org-babel-tangle)))

  ;;;###autoload
    (defun my/org-babel-insert-elisp-boilerplate (file)
      "Insert elisp documentation boilerplate into FILE, using COMMENTARY.
  Return the file name, so that this function can be piped to other
  functions."
      (when (equal (file-name-extension file) "el")
        (with-current-buffer (find-file-noselect file)
          (let* ((filename (file-name-sans-extension (file-name-nondirectory file)))
                 (copyright (concat (format-time-string "%Y") " " user-full-name))
                 (author (concat user-full-name " <"user-mail-address">"))
                 (header (concat ";;; " filename ".el --- " filename"\n\n"
                                 ";;; Commentary:\n\n"
                                 ";; Copyright: (C) " copyright "\n"
                                 ";; Author: " author "\n\n"
                                 ";;; Code:\n"))
                 (footer (concat "\n(provide '" filename ")\n"
                                 ";; Local Variables:\n"
                                 ";; indent-tabs-mode: nil\n"
                                 ";; byte-compile-warnings: (not free-vars noruntime)\n"
                                 ";; End:\n"
                                 ";;; " filename ".el ends here")))
            (goto-char (point-min)) (insert header)
            (goto-char (point-max)) (insert footer)
            (add-file-local-variable-prop-line 'lexical-binding t)
            (save-buffer) (kill-buffer)
            (message (concat "Inserted boilerplate into " file))))
        (when (file-readable-p (concat file "~"))
          (delete-file (concat file "~"))
          (message (concat "Deleted " file "~ backup file")))))
    (add-hook 'org-babel-post-tangle-hook
              (lambda () (my/org-babel-insert-elisp-boilerplate buffer-file-name)))

  ;;;###autoload
    (defun my/buffer-substring-p (string)
      (save-excursion
        (save-match-data
          (goto-char (point-min))
          (if (re-search-forward string nil t) t nil))))

  ;;;###autoload
    (defun my/org-babel-auto-tangle-init-file ()
      (if (and (equal (buffer-name) "README.org")
               (my/buffer-substring-p
                "^\\#\\+PROPERTY\\: header-args\\+ \\:tangle \\~\\/\\.emacs.d\\/init\\.el"))
          (org-babel-tangle)))
    (add-hook 'after-save-hook 'my/org-babel-auto-tangle-init-file)

    (setq org-image-actual-width nil)
    (setf org-blank-before-new-entry '((heading . nil) (plain-list-item . nil)))
    (setq org-emphasis-regexp-components '(" \t('\"{" "- \t.,:!?;'\")}\\" " \t\r\n,\"'" "." 300))
    (setq org-confirm-babel-evaluate t)
    (setq org-agenda-files (file-expand-wildcards "~/*.org"))
    (setq org-agenda-files (quote ("~/org/todo.org")))
    (setq org-default-notes-file "~/org/notes.org")
    (setq org-directory "~/org")
    (setq org-export-with-toc t)
    (setq org-indent-indentation-per-level 1)
    (setq org-list-allow-alphabetical t)
    (setq org-list-indent-offset 1)
    ;; (setq org-replace-disputed-keys t) ;; fix windmove conflicts
    (setq org-return-follows-link t)
    (setq org-refile-use-outline-path 'file)
    (setq org-outline-path-complete-in-steps nil)
    (setq org-refile-allow-creating-parent-nodes 'confirm)
    (setq org-refile-targets '((nil :maxlevel . 9)))
    (setq org-speed-commands-user (quote (("N" . org-down-element)
                                          ("P" . org-up-element))))
    (setq org-src-fontify-natively t)
    (setq org-src-tab-acts-natively t)
    (setq org-src-window-setup 'current-window)
    (setq org-startup-indented t)
    (setq org-use-fast-todo-selection t)
    (setq org-use-speed-commands t)

    (setq org-latex-listings 'minted)
    (setq org-latex-pdf-process
          '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
            "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
            "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
    (add-to-list 'org-latex-packages-alist '("" "minted"))

    (setq org-capture-templates
          '(("t" "TODO Entry" entry (file+headline "~/org/todo.org" "CURRENT")
             "* TODO %?\n  %i\n  %a")
            ("j" "Journal Entry" entry (file+datetree "~/org/journal.org" "JOURNAL")
             "* %?\nEntered on %U\n  %i\n  %a")))

    (add-to-list 'org-structure-template-alist '("cl" . "src common-lisp"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("go" . "src go"))
    (add-to-list 'org-structure-template-alist '("ja" . "src java"))
    (add-to-list 'org-structure-template-alist '("js" . "src javascript"))
    (add-to-list 'org-structure-template-alist '("kr" . "src c"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("sq" . "src sql"))
    (add-to-list 'org-structure-template-alist '("tx" . "src text"))

    (org-babel-do-load-languages
     'org-babel-load-languages
     '((awk . t)
       (C . t)
       (clojure . t)
       (css . t)
       (dot . t) ;; graphviz language
       (emacs-lisp . t)
       (gnuplot . t)
       (haskell . t)
       ;; (http . t)
       (java . t)
       (js . t)
       (latex . t)
       (lisp . t)
       (makefile . t)
       (ocaml . t)
       (perl . t)
       (python . t)
       (plantuml . t)
       (ruby . t)
       (scheme . t)
       (sed . t)
       (shell . t)
       (sql . t)
       (sqlite . t)))

    (add-hook 'org-mode-hook 'auto-fill-mode)
    (add-hook 'org-mode-hook 'hl-line-mode)
    (message "Lazy loaded org :-)"))
#+end_src

