README.html

<div id="outline-container-sec-16-16" class="outline-3">
<h3 id="sec-16-16"><span class="section-number-3">16.16</span> Org</h3>
<div class="outline-text-3" id="text-16-16">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'org
  (<span style="color: #8ac6f2; font-weight: bold;">require</span> '<span style="color: #e5786d;">org-tempo</span>)
<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/org-recursive-sort</span> ()
    <span style="color: #95e454;">"Sort all entries in the current buffer, recursively."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (org-map-entries
     (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> ()
       (<span style="color: #8ac6f2; font-weight: bold;">condition-case</span> x
           (org-sort-entries nil ?a)
         (<span style="color: #ccaa8f;">user-error</span>)))))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/org-tangle-block</span> ()
    <span style="color: #95e454;">"Only tangle the block at point."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((current-prefix-arg '(4)))
      (call-interactively 'org-babel-tangle)))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/org-babel-insert-elisp-boilerplate</span> (file)
    <span style="color: #95e454;">"Insert elisp documentation boilerplate into FILE, using COMMENTARY.</span>
<span style="color: #95e454;">Return the file name, so that this function can be piped to other</span>
<span style="color: #95e454;">functions."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">when</span> (equal (file-name-extension file) <span style="color: #95e454;">"el"</span>)
      (<span style="color: #8ac6f2; font-weight: bold;">with-current-buffer</span> (find-file-noselect file)
        (<span style="color: #8ac6f2; font-weight: bold;">let*</span> ((filename (file-name-sans-extension (file-name-nondirectory file)))
               (copyright (concat (format-time-string <span style="color: #95e454;">"%Y"</span>) <span style="color: #95e454;">" "</span> user-full-name))
               (author (concat user-full-name <span style="color: #95e454;">" &lt;"</span>user-mail-address<span style="color: #95e454;">"&gt;"</span>))
               (header (concat <span style="color: #95e454;">";;; "</span> filename <span style="color: #95e454;">".el --- "</span> filename<span style="color: #95e454;">"\n\n"</span>
                               <span style="color: #95e454;">";;; Commentary:\n\n"</span>
                               <span style="color: #95e454;">";; Copyright: (C) "</span> copyright <span style="color: #95e454;">"\n"</span>
                               <span style="color: #95e454;">";; Author: "</span> author <span style="color: #95e454;">"\n\n"</span>
                               <span style="color: #95e454;">";;; Code:\n"</span>))
               (footer (concat <span style="color: #95e454;">"\n(provide '"</span> filename <span style="color: #95e454;">")\n"</span>
                               <span style="color: #95e454;">";; Local Variables&#58;\n"</span>
                               <span style="color: #95e454;">";; indent-tabs-mode: nil\n"</span>
                               <span style="color: #95e454;">";; byte-compile-warnings: (not free-vars noruntime)\n"</span>
                               <span style="color: #95e454;">";; End:\n"</span>
                               <span style="color: #95e454;">";;; "</span> filename <span style="color: #95e454;">".el ends here"</span>)))
          (goto-char (point-min)) (insert header)
          (goto-char (point-max)) (insert footer)
          (add-file-local-variable-prop-line 'lexical-binding t)
          (save-buffer) (kill-buffer)
          (message (concat <span style="color: #95e454;">"Inserted boilerplate into "</span> file))))
      (<span style="color: #8ac6f2; font-weight: bold;">when</span> (file-readable-p (concat file <span style="color: #95e454;">"~"</span>))
        (delete-file (concat file <span style="color: #95e454;">"~"</span>))
        (message (concat <span style="color: #95e454;">"Deleted "</span> file <span style="color: #95e454;">"~ backup file"</span>)))))
  (add-hook 'org-babel-post-tangle-hook
            (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> () (my/org-babel-insert-elisp-boilerplate buffer-file-name)))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/buffer-substring-p</span> (string)
    (<span style="color: #8ac6f2; font-weight: bold;">save-excursion</span>
      (<span style="color: #8ac6f2; font-weight: bold;">save-match-data</span>
        (goto-char (point-min))
        (<span style="color: #8ac6f2; font-weight: bold;">if</span> (re-search-forward string nil t) t nil))))

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/org-babel-auto-tangle-init-file</span> ()
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> (<span style="color: #8ac6f2; font-weight: bold;">and</span> (equal (buffer-name) <span style="color: #95e454;">"README.org"</span>)
             (my/buffer-substring-p
              <span style="color: #95e454;">"^\\#\\+PROPERTY\\: header-args\\+ \\:tangle \\~\\/\\.emacs.d\\/init\\.el"</span>))
        (org-babel-tangle)))
  (add-hook 'after-save-hook 'my/org-babel-auto-tangle-init-file)

  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-image-actual-width nil)
  (<span style="color: #8ac6f2; font-weight: bold;">setf</span> org-blank-before-new-entry '((heading . nil) (plain-list-item . nil)))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-emphasis-regexp-components '(<span style="color: #95e454;">" \t('\"{"</span> <span style="color: #95e454;">"- \t.,:!?;'\")}\\"</span> <span style="color: #95e454;">" \t\r\n,\"'"</span> <span style="color: #95e454;">"."</span> 300))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-confirm-babel-evaluate t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-agenda-files (file-expand-wildcards <span style="color: #95e454;">"~/*.org"</span>))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-agenda-files (<span style="color: #8ac6f2; font-weight: bold;">quote</span> (<span style="color: #95e454;">"~/org/todo.org"</span>)))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-default-notes-file <span style="color: #95e454;">"~/org/notes.org"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-directory <span style="color: #95e454;">"~/org"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-export-with-toc t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-indent-indentation-per-level 1)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-list-allow-alphabetical t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-list-indent-offset 1)
  <span style="color: #99968b;">;; </span><span style="color: #99968b;">(setq org-replace-disputed-keys t) ;; fix windmove conflicts</span>
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-return-follows-link t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-refile-use-outline-path 'file)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-outline-path-complete-in-steps nil)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-refile-allow-creating-parent-nodes 'confirm)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-refile-targets '((nil <span style="color: #e5786d;">:maxlevel</span> . 9)))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-speed-commands-user (<span style="color: #8ac6f2; font-weight: bold;">quote</span> ((<span style="color: #95e454;">"N"</span> . org-down-element)
                                        (<span style="color: #95e454;">"P"</span> . org-up-element))))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-src-fontify-natively t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-src-tab-acts-natively t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-src-window-setup 'current-window)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-startup-indented t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-use-fast-todo-selection t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-use-speed-commands t)

  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-latex-listings 'minted)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-latex-pdf-process
        '(<span style="color: #95e454;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
          <span style="color: #95e454;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
          <span style="color: #95e454;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>))
  (add-to-list 'org-latex-packages-alist '(<span style="color: #95e454;">""</span> <span style="color: #95e454;">"minted"</span>))

  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-capture-templates
        '((<span style="color: #95e454;">"t"</span> <span style="color: #95e454;">"TODO Entry"</span> entry (file+headline <span style="color: #95e454;">"~/org/todo.org"</span> <span style="color: #95e454;">"CURRENT"</span>)
           <span style="color: #95e454;">"* TODO %?\n  %i\n  %a"</span>)
          (<span style="color: #95e454;">"j"</span> <span style="color: #95e454;">"Journal Entry"</span> entry (file+datetree <span style="color: #95e454;">"~/org/journal.org"</span> <span style="color: #95e454;">"JOURNAL"</span>)
           <span style="color: #95e454;">"* %?\nEntered on %U\n  %i\n  %a"</span>)))

  (add-to-list 'org-structure-template-alist '(<span style="color: #95e454;">"cl"</span> . <span style="color: #95e454;">"src common-lisp"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="color: #95e454;">"el"</span> . <span style="color: #95e454;">"src emacs-lisp"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="color: #95e454;">"go"</span> . <span style="color: #95e454;">"src go"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="color: #95e454;">"ja"</span> . <span style="color: #95e454;">"src java"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="color: #95e454;">"js"</span> . <span style="color: #95e454;">"src javascript"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="color: #95e454;">"kr"</span> . <span style="color: #95e454;">"src c"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="color: #95e454;">"py"</span> . <span style="color: #95e454;">"src python"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="color: #95e454;">"sh"</span> . <span style="color: #95e454;">"src shell"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="color: #95e454;">"sq"</span> . <span style="color: #95e454;">"src sql"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="color: #95e454;">"tx"</span> . <span style="color: #95e454;">"src text"</span>))

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((awk . t)
     (C . t)
     (clojure . t)
     (css . t)
     (dot . t) <span style="color: #99968b;">;; </span><span style="color: #99968b;">graphviz language</span>
     (emacs-lisp . t)
     (gnuplot . t)
     (haskell . t)
     <span style="color: #99968b;">;; </span><span style="color: #99968b;">(http . t)</span>
     (java . t)
     (js . t)
     (latex . t)
     (lisp . t)
     (makefile . t)
     (ocaml . t)
     (perl . t)
     (python . t)
     (plantuml . t)
     (ruby . t)
     (scheme . t)
     (sed . t)
     (shell . t)
     (sql . t)
     (sqlite . t)))

  (add-hook 'org-mode-hook 'auto-fill-mode)
  (add-hook 'org-mode-hook 'hl-line-mode)
  (message <span style="color: #95e454;">"Lazy loaded org :-)"</span>))
</pre>
</div>
</div>
