README.org
*** Org global bindings

#+begin_src
  (autoload 'org-mode "org" nil t)
  (autoload 'org-agenda "org" nil t)
  (global-set-key (kbd "C-c C-o a") 'org-agenda)
  (autoload 'org-capture "org" nil t)
  (global-set-key (kbd "C-c C-o c") 'org-capture)
  (autoload 'org-store-link "org" nil t)
  (global-set-key (kbd "C-c C-o l") 'org-store-link)
  (autoload 'org-time-stamp "org" nil t)
  (global-set-key (kbd "C-c C-o t") 'org-time-stamp)
#+end_src

** Pending delete

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'pending-delete-mode 1) ;; remove selected region if typing
#+end_src

** Recentf

#+begin_src emacs-lisp
  (with-eval-after-load 'recentf
    (setq recentf-exclude '(".gz"
                            ".xz"
                            ".zip"
                            "/elpa/"
                            "/ssh:"
                            "/sudo:"
                            "^/var/folders\\.*"
                            "COMMIT_EDITMSG\\'"
                            ".*-autoloads\\.el\\'"
                            "[/\\]\\.elpa/"))
    (setq recentf-max-menu-items 128)
    (setq recentf-max-saved-items 256)

    ;;;###autoload
    (defun my/completing-recentf ()
      "Show a list of recent files."
      (interactive)
      (let* ((all-files recentf-list)
             (list1 (mapcar (lambda (x) (file-name-nondirectory x) x) all-files))
             (list2 (mapcar #'substring-no-properties list1))
             (list3 (mapcar #'abbreviate-file-name list2))
             (list4 (cl-remove-duplicates list3 :test #'string-equal)))
        (find-file (completing-read "Recent Files: " list4 nil t))))
    (global-set-key (kbd "C-c r") 'my/completing-recentf)

    (defun my/completing-recentf-other-window ()
      (interactive)
      (split-window-sensibly)
      (other-window 1)
      (my/completing-recentf))
    (global-set-key (kbd "C-c 4 r") 'my/completing-recentf-other-window)

    (message "Lazy loaded recentf :-)"))

  (global-set-key (kbd "C-c C-r") 'recentf-open-files)
  (add-hook 'after-init-hook 'recentf-mode)
#+end_src

** Show paren

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'show-paren-mode)
#+end_src

** Saveplace

#+begin_src emacs-lisp
  (with-eval-after-load 'save-place
    (setq save-place-file (concat user-emacs-directory "saveplace.el"))
    (message "Lazy loaded save-place-mode :-)"))
  (add-hook 'emacs-startup-hook 'save-place-mode)
#+end_src

** Shell script

#+begin_src emacs-lisp
  (with-eval-after-load 'sh-script
    (add-hook 'shell-script-mode-hook 'hl-line-mode)
    (add-hook 'sh-script-hook 'display-line-numbers-mode)
    (add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)
    (add-to-list 'auto-mode-alist '("\\.sh\\'" . shell-script-mode))
    (add-to-list 'auto-mode-alist '("\\.bash.*\\'" . shell-script-mode))
    (add-to-list 'auto-mode-alist '("\\.zsh.*\\'" . shell-script-mode))
    (add-to-list 'auto-mode-alist '("\\bashrc\\'" . shell-script-mode))
    (add-to-list 'auto-mode-alist '("\\kshrc\\'" . shell-script-mode))
    (add-to-list 'auto-mode-alist '("\\profile\\'" . shell-script-mode))
    (add-to-list 'auto-mode-alist '("\\zshenv\\'" . shell-script-mode))
    (add-to-list 'auto-mode-alist '("\\zprompt\\'" . shell-script-mode))
    (add-to-list 'auto-mode-alist '("\\zshrc\\'" . shell-script-mode))
    (add-to-list 'auto-mode-alist '("\\prompt_.*_setup\\'" . shell-script-mode))
    (add-to-list 'interpreter-mode-alist '("bash" . shell-script-mode))
    (add-to-list 'interpreter-mode-alist '("ksh" . shell-script-mode))
    (add-to-list 'interpreter-mode-alist '("sh" . shell-script-mode))
    (add-to-list 'interpreter-mode-alist '("zsh" . shell-script-mode))
    (message "Lazy loaded shell-script-mode :-)"))
#+end_src

** Subword

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'global-subword-mode) ;; move by camel case, etc
#+end_src

** Term

#+begin_src emacs-lisp
  (autoload 'term "term" nil t)
  (autoload 'ansi-term "term" nil t)
#+end_src

*** ANSI Term launcher

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/ansi-term ()
    "Opens shell from $SHELL environmental variable in `ansi-term'."
    (interactive)
    ;; https://emacs.stackexchange.com/a/48481
    (let ((switch-to-buffer-obey-display-actions))
      (ansi-term (getenv "SHELL"))))
  (global-set-key (kbd "C-c tt") 'my/ansi-term)

  ;;;###autoload
  (defun my/ansi-term-other-window ()
    "Opens default $SHELL `ansi-term' in another window."
    (interactive)
    (split-window-sensibly)
    (other-window 1)
    (my/ansi-term))
  (global-set-key (kbd "C-c 4 tt") 'my/ansi-term-other-window)
#+end_src

