README.html

<div id="outline-container-sec-16-16-1" class="outline-4">
<h4 id="sec-16-16-1"><span class="section-number-4">16.16.1</span> Org global bindings</h4>
<div class="outline-text-4" id="text-16-16-1">
<pre class="example">
(autoload 'org-mode "org" nil t)
(autoload 'org-agenda "org" nil t)
(global-set-key (kbd "C-c C-o a") 'org-agenda)
(autoload 'org-capture "org" nil t)
(global-set-key (kbd "C-c C-o c") 'org-capture)
(autoload 'org-store-link "org" nil t)
(global-set-key (kbd "C-c C-o l") 'org-store-link)
(autoload 'org-time-stamp "org" nil t)
(global-set-key (kbd "C-c C-o t") 'org-time-stamp)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-17" class="outline-3">
<h3 id="sec-16-17"><span class="section-number-3">16.17</span> Pending delete</h3>
<div class="outline-text-3" id="text-16-17">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'pending-delete-mode 1) <span style="color: #99968b;">;; </span><span style="color: #99968b;">remove selected region if typing</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-18" class="outline-3">
<h3 id="sec-16-18"><span class="section-number-3">16.18</span> Prettify Symbols</h3>
<div class="outline-text-3" id="text-16-18">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'prettify-symbols
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> prettify-symbols-unprettify-at-point 'right-edge)
  (message <span style="color: #95e454;">"Lazy loaded prettify-symbols :-)"</span>))
(add-hook 'emacs-startup-hook 'global-prettify-symbols-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-19" class="outline-3">
<h3 id="sec-16-19"><span class="section-number-3">16.19</span> Recentf</h3>
<div class="outline-text-3" id="text-16-19">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'recentf
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> recentf-exclude '(<span style="color: #95e454;">".gz"</span>
                          <span style="color: #95e454;">".xz"</span>
                          <span style="color: #95e454;">".zip"</span>
                          <span style="color: #95e454;">"/elpa/"</span>
                          <span style="color: #95e454;">"/ssh:"</span>
                          <span style="color: #95e454;">"/sudo:"</span>
                          <span style="color: #95e454;">"^/var/folders\\.*"</span>
                          <span style="color: #95e454;">"COMMIT_EDITMSG\\'"</span>
                          <span style="color: #95e454;">".*-autoloads\\.el\\'"</span>
                          <span style="color: #95e454;">"[/\\]\\.elpa/"</span>))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> recentf-max-menu-items 128)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> recentf-max-saved-items 256)

  <span style="color: #99968b;">;;;</span><span style="color: #99968b;">###autoload</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/completing-recentf</span> ()
    <span style="color: #95e454;">"Show a list of recent files."</span>
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">let*</span> ((all-files recentf-list)
           (list1 (mapcar (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (x) (file-name-nondirectory x) x) all-files))
           (list2 (mapcar #'substring-no-properties list1))
           (list3 (mapcar #'abbreviate-file-name list2))
           (list4 (cl-remove-duplicates list3 <span style="color: #e5786d;">:test</span> #'string-equal)))
      (find-file (completing-read <span style="color: #95e454;">"Recent Files: "</span> list4 nil t))))
  (global-set-key (kbd <span style="color: #95e454;">"C-c r"</span>) 'my/completing-recentf)

  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/completing-recentf-other-window</span> ()
    (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
    (split-window-sensibly)
    (other-window 1)
    (my/completing-recentf))
  (global-set-key (kbd <span style="color: #95e454;">"C-c 4 r"</span>) 'my/completing-recentf-other-window)

  (message <span style="color: #95e454;">"Lazy loaded recentf :-)"</span>))

(global-set-key (kbd <span style="color: #95e454;">"C-c C-r"</span>) 'recentf-open-files)
(add-hook 'after-init-hook 'recentf-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-20" class="outline-3">
<h3 id="sec-16-20"><span class="section-number-3">16.20</span> Show paren</h3>
<div class="outline-text-3" id="text-16-20">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'show-paren-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-21" class="outline-3">
<h3 id="sec-16-21"><span class="section-number-3">16.21</span> Saveplace</h3>
<div class="outline-text-3" id="text-16-21">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'save-place
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> save-place-file (concat user-emacs-directory <span style="color: #95e454;">"saveplace.el"</span>))
  (message <span style="color: #95e454;">"Lazy loaded save-place-mode :-)"</span>))
(add-hook 'emacs-startup-hook 'save-place-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-22" class="outline-3">
<h3 id="sec-16-22"><span class="section-number-3">16.22</span> Shell script</h3>
<div class="outline-text-3" id="text-16-22">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'sh-script
  (add-hook 'shell-script-mode-hook 'hl-line-mode)
  (add-hook 'sh-script-hook 'display-line-numbers-mode)
  (add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)
  (add-to-list 'auto-mode-alist '(<span style="color: #95e454;">"\\.sh\\'"</span> . shell-script-mode))
  (add-to-list 'auto-mode-alist '(<span style="color: #95e454;">"\\.bash.*\\'"</span> . shell-script-mode))
  (add-to-list 'auto-mode-alist '(<span style="color: #95e454;">"\\.zsh.*\\'"</span> . shell-script-mode))
  (add-to-list 'auto-mode-alist '(<span style="color: #95e454;">"\\bashrc\\'"</span> . shell-script-mode))
  (add-to-list 'auto-mode-alist '(<span style="color: #95e454;">"\\kshrc\\'"</span> . shell-script-mode))
  (add-to-list 'auto-mode-alist '(<span style="color: #95e454;">"\\profile\\'"</span> . shell-script-mode))
  (add-to-list 'auto-mode-alist '(<span style="color: #95e454;">"\\zshenv\\'"</span> . shell-script-mode))
  (add-to-list 'auto-mode-alist '(<span style="color: #95e454;">"\\zprompt\\'"</span> . shell-script-mode))
  (add-to-list 'auto-mode-alist '(<span style="color: #95e454;">"\\zshrc\\'"</span> . shell-script-mode))
  (add-to-list 'auto-mode-alist '(<span style="color: #95e454;">"\\prompt_.*_setup\\'"</span> . shell-script-mode))
  (add-to-list 'interpreter-mode-alist '(<span style="color: #95e454;">"bash"</span> . shell-script-mode))
  (add-to-list 'interpreter-mode-alist '(<span style="color: #95e454;">"ksh"</span> . shell-script-mode))
  (add-to-list 'interpreter-mode-alist '(<span style="color: #95e454;">"sh"</span> . shell-script-mode))
  (add-to-list 'interpreter-mode-alist '(<span style="color: #95e454;">"zsh"</span> . shell-script-mode))
  (message <span style="color: #95e454;">"Lazy loaded shell-script-mode :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-23" class="outline-3">
<h3 id="sec-16-23"><span class="section-number-3">16.23</span> Subword</h3>
<div class="outline-text-3" id="text-16-23">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'global-subword-mode) <span style="color: #99968b;">;; </span><span style="color: #99968b;">move by camel case, etc</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-24" class="outline-3">
<h3 id="sec-16-24"><span class="section-number-3">16.24</span> Term</h3>
<div class="outline-text-3" id="text-16-24">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(autoload 'term <span style="color: #95e454;">"term"</span> nil t)
(autoload 'ansi-term <span style="color: #95e454;">"term"</span> nil t)
</pre>
</div>
</div>

<div id="outline-container-sec-16-24-1" class="outline-4">
<h4 id="sec-16-24-1"><span class="section-number-4">16.24.1</span> ANSI Term launcher</h4>
<div class="outline-text-4" id="text-16-24-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/ansi-term</span> ()
  <span style="color: #95e454;">"Opens shell from $SHELL environmental variable in `</span><span style="color: #e5786d;">ansi-term</span><span style="color: #95e454;">'."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  <span style="color: #99968b;">;; </span><span style="color: #99968b;">https://emacs.stackexchange.com/a/48481</span>
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((switch-to-buffer-obey-display-actions))
    (ansi-term (getenv <span style="color: #95e454;">"SHELL"</span>))))
(global-set-key (kbd <span style="color: #95e454;">"C-c tt"</span>) 'my/ansi-term)

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/ansi-term-other-window</span> ()
  <span style="color: #95e454;">"Opens default $SHELL `</span><span style="color: #e5786d;">ansi-term</span><span style="color: #95e454;">' in another window."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (split-window-sensibly)
  (other-window 1)
  (my/ansi-term))
(global-set-key (kbd <span style="color: #95e454;">"C-c 4 tt"</span>) 'my/ansi-term-other-window)
</pre>
</div>
</div>
</div>
