README.org
*** Switch to ANSI Term

#+begin_src emacs-lisp
  ;;;###autoload
  (defun my/switch-to-ansi-term ()
    "Open an `ansi-term' if it doesn't already exist.
  Otherwise switch to current one."
    (interactive)
    (if (get-buffer "*ansi-term*")
        (switch-to-buffer "*ansi-term*")
      (ansi-term (getenv "SHELL"))))
  (global-set-key (kbd "C-c ts") 'my/switch-to-ansi-term)

  ;;;###autoload
  (defun my/switch-to-ansi-term-other-window()
    "Does what it states on the tin!"
    (interactive)
    (split-window-sensibly)
    (other-window 1)
    (my/switch-to-ansi-term))
  (global-set-key (kbd "C-c 4 ts") 'my/switch-to-ansi-term-other-window)
#+end_src

*** Lazy load

#+begin_src emacs-lisp
  (with-eval-after-load 'term
    ;; get unicode characters in ansi-term - https://stackoverflow.com/a/7442266
    (defadvice ansi-term (after advise-ansi-term-coding-system)
      "Get unicode characters in `ansi-term'."
      (set-buffer-process-coding-system 'utf-8-unix 'utf-8-unix))
    (ad-activate 'ansi-term)

    (defadvice term-handle-exit (after term-kill-buffer-on-exit activate)
      "Kill term when shell exits."
      (kill-buffer))

    (setq term-buffer-maximum-size 200000)
    (message "Lazy loaded term :-)"))
#+end_src

*** Set term coding system to UTF-8

#+begin_src emacs-lisp
  (add-hook 'term-exec (lambda () (set-process-coding-system 'utf-8-unix 'utf-8-unix)))
#+end_src

** Tramp

#+begin_src emacs-lisp
  (with-eval-after-load 'tramp
    (setq tramp-backup-directory-alist backup-directory-alist)
    (setq tramp-default-method "ssh")
    (setf tramp-persistency-file-name (concat temporary-file-directory "tramp-" (user-login-name)))
    (message "Lazy loaded tramp :-)"))
#+end_src

** Version Control

#+begin_src emacs-lisp
  (with-eval-after-load 'vc
    (setq vc-follow-symlinks t)
    (setq vc-make-backup-files t)
    (setq version-control t)
    (message "Lazy loaded vc :-)"))
#+end_src

** Whitespace

#+begin_src emacs-lisp
  (with-eval-after-load 'whitespace
    (setq whitespace-line-column 120)
    (setq whitespace-style '(face
                             tabs
                             spaces
                             trailing
                             lines
                             space-before-tab::space
                             newline
                             indentation::space
                             empty
                             space-after-tab::space
                             space-mark
                             tab-mark
                             newline-mark)
          whitespace-face 'whitespace-trailing)
    (global-set-key (kbd "C-c M-w") 'whitespace-mode)
    (message "Lazy loaded whitespace :-)"))
#+end_src

Cleanup whitespace on save

#+begin_src emacs-lisp
  (add-hook 'before-save-hook 'whitespace-cleanup)
#+end_src

* Third party package configuration

I like to split up my "vanilla" Emacs configuration and custom functions from
the customisations provided by third party libraries that have been installed
using ~package.el~ and ~use-package~.

If you want to go for a more vanilla setup, just prefix the ~COMMENT~ keyword
to the tile above, and re-tangle the file.

This way it makes it very easy to run a semi-stock Emacs without ~package.el~
or any third party libraries, but still have some saner defaults and some extra
functionality.

I'm using John Wiegley's awesome [[https://github.com/jwiegley/use-package][use-package]] to pull in and configure any third
party packages from [[https://melpa.org/][MELPA]].

** Setup package.el and use-package

#+begin_src emacs-lisp
  (require 'package)
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (setq use-package-enable-imenu-support t
        ;; use-package-hook-name-suffix nil
        use-package-always-ensure t
        use-package-verbose t)
  (require 'use-package)
#+end_src

** Ansible

#+begin_src emacs-lisp
  (use-package ansible :defer
    :hook (yaml-mode . ansible))
#+end_src

#+begin_src emacs-lisp
  (use-package ansible-doc :defer
    :hook (yaml-mode . ansible-doc-mode))
#+end_src

** Async

#+begin_src emacs-lisp
  (use-package async :defer 5
    :commands (async-byte-compile-file
               async-bytecomp-package-mode)
    :init
    (unless (equal system-type 'windows-nt)
      (setq async-bytecomp-allowed-packages '(all)))
    :config
    (if (equal system-type 'windows-nt)
        (async-bytecomp-package-mode -1)
      (async-bytecomp-package-mode 1))
    :hook (dired-mode-hook . dired-async-mode))
#+end_src

** Blacken

#+begin_src emacs-lisp
  (use-package blacken :defer
    :hook (python-mode . blacken-mode))
#+end_src

