README.html

<div id="outline-container-sec-16-24-2" class="outline-4">
<h4 id="sec-16-24-2"><span class="section-number-4">16.24.2</span> Switch to ANSI Term</h4>
<div class="outline-text-4" id="text-16-24-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/switch-to-ansi-term</span> ()
  <span style="color: #95e454;">"Open an `</span><span style="color: #e5786d;">ansi-term</span><span style="color: #95e454;">' if it doesn't already exist.</span>
<span style="color: #95e454;">Otherwise switch to current one."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (get-buffer <span style="color: #95e454;">"*ansi-term*"</span>)
      (switch-to-buffer <span style="color: #95e454;">"*ansi-term*"</span>)
    (ansi-term (getenv <span style="color: #95e454;">"SHELL"</span>))))
(global-set-key (kbd <span style="color: #95e454;">"C-c ts"</span>) 'my/switch-to-ansi-term)

<span style="color: #99968b;">;;;</span><span style="color: #99968b;">###</span><span style="color: #ccaa8f;">autoload</span>
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/switch-to-ansi-term-other-window</span>()
  <span style="color: #95e454;">"Does what it states on the tin!"</span>
  (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
  (split-window-sensibly)
  (other-window 1)
  (my/switch-to-ansi-term))
(global-set-key (kbd <span style="color: #95e454;">"C-c 4 ts"</span>) 'my/switch-to-ansi-term-other-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-24-3" class="outline-4">
<h4 id="sec-16-24-3"><span class="section-number-4">16.24.3</span> Lazy load</h4>
<div class="outline-text-4" id="text-16-24-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'term
  <span style="color: #99968b;">;; </span><span style="color: #99968b;">get unicode characters in ansi-term - https://stackoverflow.com/a/7442266</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defadvice</span> <span style="color: #cae682;">ansi-term</span> (after advise-ansi-term-coding-system)
    <span style="color: #95e454;">"Get unicode characters in `</span><span style="color: #e5786d;">ansi-term</span><span style="color: #95e454;">'."</span>
    (set-buffer-process-coding-system 'utf-8-unix 'utf-8-unix))
  (ad-activate 'ansi-term)

  (<span style="color: #8ac6f2; font-weight: bold;">defadvice</span> <span style="color: #cae682;">term-handle-exit</span> (after term-kill-buffer-on-exit activate)
    <span style="color: #95e454;">"Kill term when shell exits."</span>
    (kill-buffer))

  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> term-buffer-maximum-size 200000)
  (message <span style="color: #95e454;">"Lazy loaded term :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-24-4" class="outline-4">
<h4 id="sec-16-24-4"><span class="section-number-4">16.24.4</span> Set term coding system to UTF-8</h4>
<div class="outline-text-4" id="text-16-24-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'term-exec (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> () (set-process-coding-system 'utf-8-unix 'utf-8-unix)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-16-25" class="outline-3">
<h3 id="sec-16-25"><span class="section-number-3">16.25</span> Tramp</h3>
<div class="outline-text-3" id="text-16-25">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'tramp
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> tramp-backup-directory-alist backup-directory-alist)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> tramp-default-method <span style="color: #95e454;">"ssh"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setf</span> tramp-persistency-file-name (concat temporary-file-directory <span style="color: #95e454;">"tramp-"</span> (user-login-name)))
  (message <span style="color: #95e454;">"Lazy loaded tramp :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-26" class="outline-3">
<h3 id="sec-16-26"><span class="section-number-3">16.26</span> Version Control</h3>
<div class="outline-text-3" id="text-16-26">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'vc
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> vc-follow-symlinks t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> vc-make-backup-files t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> version-control t)
  (message <span style="color: #95e454;">"Lazy loaded vc :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16-27" class="outline-3">
<h3 id="sec-16-27"><span class="section-number-3">16.27</span> Whitespace</h3>
<div class="outline-text-3" id="text-16-27">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">with-eval-after-load</span> 'whitespace
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> whitespace-line-column 120)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> whitespace-style '(face
                           tabs
                           spaces
                           trailing
                           lines
                           space-before-tab::space
                           newline
                           indentation::space
                           empty
                           space-after-tab::space
                           space-mark
                           tab-mark
                           newline-mark)
        whitespace-face 'whitespace-trailing)
  (global-set-key (kbd <span style="color: #95e454;">"C-c M-w"</span>) 'whitespace-mode)
  (message <span style="color: #95e454;">"Lazy loaded whitespace :-)"</span>))
</pre>
</div>

<p>
Cleanup whitespace on save
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'before-save-hook 'whitespace-cleanup)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Third party package configuration</h2>
<div class="outline-text-2" id="text-17">
<p>
I like to split up my "vanilla" Emacs configuration and custom functions from
the customisations provided by third party libraries that have been installed
using <code>package.el</code> and <code>use-package</code>.
</p>

<p>
If you want to go for a more vanilla setup, just prefix the <code>COMMENT</code> keyword
to the tile above, and re-tangle the file.
</p>

<p>
This way it makes it very easy to run a semi-stock Emacs without <code>package.el</code>
or any third party libraries, but still have some saner defaults and some extra
functionality.
</p>

<p>
I'm using John Wiegley's awesome <a href="https://github.com/jwiegley/use-package">use-package</a> to pull in and configure any third
party packages from <a href="https://melpa.org/">MELPA</a>.
</p>
</div>

<div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> Setup package.el and use-package</h3>
<div class="outline-text-3" id="text-17-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">require</span> '<span style="color: #e5786d;">package</span>)
(<span style="color: #8ac6f2; font-weight: bold;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(<span style="color: #8ac6f2; font-weight: bold;">setq</span> use-package-enable-imenu-support t
      <span style="color: #99968b;">;; </span><span style="color: #99968b;">use-package-hook-name-suffix nil</span>
      use-package-always-ensure t
      use-package-verbose t)
(<span style="color: #8ac6f2; font-weight: bold;">require</span> '<span style="color: #e5786d;">use-package</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2"><span class="section-number-3">17.2</span> Ansible</h3>
<div class="outline-text-3" id="text-17-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">ansible</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:hook</span> (yaml-mode . ansible))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">ansible-doc</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:hook</span> (yaml-mode . ansible-doc-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-3" class="outline-3">
<h3 id="sec-17-3"><span class="section-number-3">17.3</span> Async</h3>
<div class="outline-text-3" id="text-17-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">async</span> <span style="color: #e5786d;">:defer</span> 5
  <span style="color: #e5786d;">:commands</span> (async-byte-compile-file
             async-bytecomp-package-mode)
  <span style="color: #e5786d;">:init</span>
  (<span style="color: #8ac6f2; font-weight: bold;">unless</span> (equal system-type 'windows-nt)
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> async-bytecomp-allowed-packages '(all)))
  <span style="color: #e5786d;">:config</span>
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (equal system-type 'windows-nt)
      (async-bytecomp-package-mode -1)
    (async-bytecomp-package-mode 1))
  <span style="color: #e5786d;">:hook</span> (dired-mode-hook . dired-async-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-4" class="outline-3">
<h3 id="sec-17-4"><span class="section-number-3">17.4</span> Blacken</h3>
<div class="outline-text-3" id="text-17-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">blacken</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:hook</span> (python-mode . blacken-mode))
</pre>
</div>
</div>
</div>
