README.org
** Default text scaling

#+begin_src emacs-lisp
  (use-package default-text-scale
    :if window-system
    :bind*
    ("C-M-=" . default-text-scale-increase)
    ("C-M--" . default-text-scale-decrease)
    ("C-M-0" . default-text-scale-reset))
#+end_src

** Diminish

#+begin_src emacs-lisp
  (use-package diminish :defer 2
    :diminish abbrev-mode
    :diminish auto-fill-function ;; wtf?!
    :diminish eldoc-mode
    :diminish hs-minor-mode
    :diminish highlight-changes-mode
    :diminish my/key-mode
    :diminish org-indent-mode
    :diminish org-src-mode
    :diminish subword-mode
    :hook
    (org-indent-mode . (lambda () (diminish 'org-indent-mode)))
    (hs-minor-mode . (lambda () (diminish 'hs-minor-mode))))
#+end_src

** Docker

#+begin_src emacs-lisp
  (use-package docker
    :bind ("C-c C-d" . docker))

  (use-package dockerfile-mode :defer)
#+end_src

** Exec path from shell

#+begin_src emacs-lisp
  (use-package exec-path-from-shell :defer 10
    :if (not (eq system-type 'windows-nt))
    :commands exec-path-from-shell-initialize
    :init
    (setq exec-path-from-shell-check-startup-files 'nil)
    :config
    (exec-path-from-shell-initialize)
    (exec-path-from-shell-copy-env "PYTHONPATH"))
#+end_src

** Flycheck

#+begin_src emacs-lisp
  (use-package flycheck :defer
    :diminish flycheck-mode
    :hook (prog-mode . flycheck-mode)
    :config (flycheck-add-mode 'javascript-eslint 'web-mode))
#+end_src
** Git
*** Git Timemachine

#+begin_src emacs-lisp
  (use-package git-timemachine :defer)
#+end_src

*** Gitlab CI

#+begin_src emacs-lisp
  (use-package gitlab-ci-mode :defer
    :mode
    "\\.gitlab-ci.yaml\\'"
    "\\.gitlab-ci.yml\\'"
    :hook
    (yaml-mode . hs-minor-mode))
#+end_src

*** Lazygit

#+begin_src emacs-lisp
  (use-package lazygitlab :ensure nil
    :if (file-directory-p (expand-file-name "~/src/gitlab/tspub/lisp/lazygit"))
    :load-path (lambda () (expand-file-name "~/src/gitlab/tspub/lisp/lazygit"))
    :bind
    ("C-c g l a" . lazygitlab-clone-or-pull-all)
    ("C-c g l c" . lazygitlab-clone-or-pull-project)
    ("C-c g l g" . lazygitlab-clone-or-pull-group)
    ("C-c g l r" . lazygitlab-retriever)
    :config
    (setq lazygit-token-file (expand-file-name "~/.lazygit.el"))
    (defalias 'gl/api 'lazygitlab-retriever)
    (defalias 'gl/all 'lazygitlab-clone-or-pull-all)
    (defalias 'gl/grp 'lazygitlab-clone-or-pull-group)
    (defalias 'gl/repo 'lazygitlab-clone-or-pull-project))
#+end_src

#+begin_src emacs-lisp
  (use-package lazygithub :ensure nil
    :if (file-directory-p (expand-file-name "~/src/gitlab/tspub/lisp/lazygit"))
    :load-path (lambda () (expand-file-name "~/src/gitlab/tspub/lisp/lazygit"))
    :bind
    ("C-c g h a" . lazygithub-clone-or-pull-all)
    ("C-c g h c" . lazygithub-clone-or-pull-repo)
    ("C-c g h r" . lazygithub-retriever)
    :config
    (setq lazygit-token-file (expand-file-name "~/.lazygit.el"))
    (defalias 'gh/api 'lazygithub-retriever)
    (defalias 'gh/all 'lazygithub-clone-or-pull-all)
    (defalias 'gh/repo 'lazygithub-clone-or-pull-repo))
#+end_src

