README.html

<div id="outline-container-sec-17-5" class="outline-3">
<h3 id="sec-17-5"><span class="section-number-3">17.5</span> Default text scaling</h3>
<div class="outline-text-3" id="text-17-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">default-text-scale</span>
  <span style="color: #e5786d;">:if</span> window-system
  <span style="color: #e5786d;">:bind*</span>
  (<span style="color: #95e454;">"C-M-="</span> . default-text-scale-increase)
  (<span style="color: #95e454;">"C-M--"</span> . default-text-scale-decrease)
  (<span style="color: #95e454;">"C-M-0"</span> . default-text-scale-reset))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-6" class="outline-3">
<h3 id="sec-17-6"><span class="section-number-3">17.6</span> Diminish</h3>
<div class="outline-text-3" id="text-17-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">diminish</span> <span style="color: #e5786d;">:defer</span> 2
  <span style="color: #e5786d;">:diminish</span> abbrev-mode
  <span style="color: #e5786d;">:diminish</span> auto-fill-function <span style="color: #99968b;">;; </span><span style="color: #99968b;">wtf?!</span>
  <span style="color: #e5786d;">:diminish</span> eldoc-mode
  <span style="color: #e5786d;">:diminish</span> hs-minor-mode
  <span style="color: #e5786d;">:diminish</span> highlight-changes-mode
  <span style="color: #e5786d;">:diminish</span> my/key-mode
  <span style="color: #e5786d;">:diminish</span> org-indent-mode
  <span style="color: #e5786d;">:diminish</span> org-src-mode
  <span style="color: #e5786d;">:diminish</span> subword-mode
  <span style="color: #e5786d;">:hook</span>
  (org-indent-mode . (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> () (diminish 'org-indent-mode)))
  (hs-minor-mode . (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> () (diminish 'hs-minor-mode))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-7" class="outline-3">
<h3 id="sec-17-7"><span class="section-number-3">17.7</span> Docker</h3>
<div class="outline-text-3" id="text-17-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">docker</span>
  <span style="color: #e5786d;">:bind</span> (<span style="color: #95e454;">"C-c C-d"</span> . docker))

(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">dockerfile-mode</span> <span style="color: #e5786d;">:defer</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-8" class="outline-3">
<h3 id="sec-17-8"><span class="section-number-3">17.8</span> Exec path from shell</h3>
<div class="outline-text-3" id="text-17-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">exec-path-from-shell</span> <span style="color: #e5786d;">:defer</span> 10
  <span style="color: #e5786d;">:if</span> (not (eq system-type 'windows-nt))
  <span style="color: #e5786d;">:commands</span> exec-path-from-shell-initialize
  <span style="color: #e5786d;">:init</span>
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> exec-path-from-shell-check-startup-files 'nil)
  <span style="color: #e5786d;">:config</span>
  (exec-path-from-shell-initialize)
  (exec-path-from-shell-copy-env <span style="color: #95e454;">"PYTHONPATH"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-9" class="outline-3">
<h3 id="sec-17-9"><span class="section-number-3">17.9</span> Flycheck</h3>
<div class="outline-text-3" id="text-17-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">flycheck</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:diminish</span> flycheck-mode
  <span style="color: #e5786d;">:hook</span> (prog-mode . flycheck-mode)
  <span style="color: #e5786d;">:config</span> (flycheck-add-mode 'javascript-eslint 'web-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-17-10" class="outline-3">
<h3 id="sec-17-10"><span class="section-number-3">17.10</span> Git</h3>
<div class="outline-text-3" id="text-17-10">
</div><div id="outline-container-sec-17-10-1" class="outline-4">
<h4 id="sec-17-10-1"><span class="section-number-4">17.10.1</span> Git Timemachine</h4>
<div class="outline-text-4" id="text-17-10-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">git-timemachine</span> <span style="color: #e5786d;">:defer</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-10-2" class="outline-4">
<h4 id="sec-17-10-2"><span class="section-number-4">17.10.2</span> Gitlab CI</h4>
<div class="outline-text-4" id="text-17-10-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">gitlab-ci-mode</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:mode</span>
  <span style="color: #95e454;">"\\.gitlab-ci.yaml\\'"</span>
  <span style="color: #95e454;">"\\.gitlab-ci.yml\\'"</span>
  <span style="color: #e5786d;">:hook</span>
  (yaml-mode . hs-minor-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-10-3" class="outline-4">
<h4 id="sec-17-10-3"><span class="section-number-4">17.10.3</span> Lazygit</h4>
<div class="outline-text-4" id="text-17-10-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">lazygitlab</span> <span style="color: #e5786d;">:ensure</span> nil
  <span style="color: #e5786d;">:if</span> (file-directory-p (expand-file-name <span style="color: #95e454;">"~/src/gitlab/tspub/lisp/lazygit"</span>))
  <span style="color: #e5786d;">:load-path</span> (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> () (expand-file-name <span style="color: #95e454;">"~/src/gitlab/tspub/lisp/lazygit"</span>))
  <span style="color: #e5786d;">:bind</span>
  (<span style="color: #95e454;">"C-c g l a"</span> . lazygitlab-clone-or-pull-all)
  (<span style="color: #95e454;">"C-c g l c"</span> . lazygitlab-clone-or-pull-project)
  (<span style="color: #95e454;">"C-c g l g"</span> . lazygitlab-clone-or-pull-group)
  (<span style="color: #95e454;">"C-c g l r"</span> . lazygitlab-retriever)
  <span style="color: #e5786d;">:config</span>
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> lazygit-token-file (expand-file-name <span style="color: #95e454;">"~/.lazygit.el"</span>))
  (<span style="color: #8ac6f2; font-weight: bold;">defalias</span> '<span style="color: #cae682;">gl/api</span> 'lazygitlab-retriever)
  (<span style="color: #8ac6f2; font-weight: bold;">defalias</span> '<span style="color: #cae682;">gl/all</span> 'lazygitlab-clone-or-pull-all)
  (<span style="color: #8ac6f2; font-weight: bold;">defalias</span> '<span style="color: #cae682;">gl/grp</span> 'lazygitlab-clone-or-pull-group)
  (<span style="color: #8ac6f2; font-weight: bold;">defalias</span> '<span style="color: #cae682;">gl/repo</span> 'lazygitlab-clone-or-pull-project))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">lazygithub</span> <span style="color: #e5786d;">:ensure</span> nil
  <span style="color: #e5786d;">:if</span> (file-directory-p (expand-file-name <span style="color: #95e454;">"~/src/gitlab/tspub/lisp/lazygit"</span>))
  <span style="color: #e5786d;">:load-path</span> (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> () (expand-file-name <span style="color: #95e454;">"~/src/gitlab/tspub/lisp/lazygit"</span>))
  <span style="color: #e5786d;">:bind</span>
  (<span style="color: #95e454;">"C-c g h a"</span> . lazygithub-clone-or-pull-all)
  (<span style="color: #95e454;">"C-c g h c"</span> . lazygithub-clone-or-pull-repo)
  (<span style="color: #95e454;">"C-c g h r"</span> . lazygithub-retriever)
  <span style="color: #e5786d;">:config</span>
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> lazygit-token-file (expand-file-name <span style="color: #95e454;">"~/.lazygit.el"</span>))
  (<span style="color: #8ac6f2; font-weight: bold;">defalias</span> '<span style="color: #cae682;">gh/api</span> 'lazygithub-retriever)
  (<span style="color: #8ac6f2; font-weight: bold;">defalias</span> '<span style="color: #cae682;">gh/all</span> 'lazygithub-clone-or-pull-all)
  (<span style="color: #8ac6f2; font-weight: bold;">defalias</span> '<span style="color: #cae682;">gh/repo</span> 'lazygithub-clone-or-pull-repo))
</pre>
</div>
</div>
</div>
