README.org
*** Magit

#+begin_src emacs-lisp
  (use-package magit
    :bind*
    ("C-x g" . magit-status)
    :config
    (when (eq system-type 'windows-nt)
      (if (file-readable-p "C:/Program Files/Git/bin/git.exe")
          (setq magit-git-executable "C:/Program Files/Git/bin/git.exe"))
      (when (file-directory-p "C:/Program Files/Git/bin")
        (setq exec-path (add-to-list 'exec-path "C:/Program Files/Git/bin"))
        (setenv "PATH" (concat "C:\\Program Files\\Git\\bin;" (getenv "PATH")))))
    (setq magit-clone-set-remote.pushDefault t)
    (setq magit-completing-read-function 'magit-builtin-completing-read))
#+end_src

#+begin_src emacs-lisp
  (use-package magit-repos :ensure nil
    :bind* ("C-x C-g" . magit-list-repositories)
    :config
    (setq magit-repository-directories `(("~/" . 0)
                                         ("~/src/gitlab" . 10)))
    (setq magit-repolist-columns
          '(("Name" 25 magit-repolist-column-ident)
            ;; ("Version" 25 magit-repolist-column-version)
            ("Pull" 5 magit-repolist-column-unpulled-from-upstream)
            ("Push" 5 magit-repolist-column-unpushed-to-upstream)
            ("Commit" 8 magit-repolist-column-flag t)
            ("Path" 99 magit-repolist-column-path))))
#+end_src

** Go mode

#+begin_src emacs-lisp
  (use-package go-mode :defer
    :config
    (defun my/go-indent ()
      (setq indent-tabs-mode 1)
      (setq tab-width 2))
    :hook (go-mode . my/go-indent))
#+end_src

** Hungry delete

#+begin_src emacs-lisp
  (use-package hungry-delete :defer 6
    :diminish hungry-delete-mode
    :config (global-hungry-delete-mode))
#+end_src

** JS2 mode

#+begin_src emacs-lisp
  (use-package js2-mode :defer
    :hook
    (js-mode . js2-minor-mode)
    (js2-mode . js2-imenu-extras-mode)
    :mode
    "\\.js\\'")

  (use-package js2-refactor :defer
    :hook (js2-mode . js2-refactor-mode)
    :bind (:map js2-mode-map
                ("C-k" . js2r-kill))
    :config (js2r-add-keybindings-with-prefix "C-c C-j"))
#+end_src

** JSON

#+begin_src emacs-lisp
  (use-package json-mode :defer
    :config
    (defun my/json-mode-setup ()
      (json-mode)
      (json-pretty-print (point-min) (point-max))
      (goto-char (point-min))
      (set-buffer-modified-p nil))
    (add-to-list 'auto-mode-alist
                 '("\\.json\\'" . 'my/json-mode-setup)))

  (use-package json-navigator :defer)
#+end_src

** Markdown

#+begin_src emacs-lisp
  (use-package markdown-mode
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . gfm-mode)
           ("\\.markdown\\'" . gfm-mode))
    :init (setq markdown-command "multimarkdown"))
#+end_src

** Node JS

#+begin_src emacs-lisp
  (use-package nodejs-repl :defer
    :bind
    (:map js2-mode-map
          ("C-x C-e" . nodejs-repl-send-last-expression)
          ("C-c C-j" . nodejs-repl-send-line)
          ("C-c SPC" . nodejs-repl-send-region)
          ("C-c C-b" . nodejs-repl-send-buffer)
          ("C-c C-f" . nodejs-repl-load-file)
          ("C-c C-z" . nodejs-repl-switch-to-repl)))
#+end_src

** Org
*** Org Bullets

#+begin_src emacs-lisp
  (use-package org-bullets :defer
    :hook (org-mode . org-bullets-mode))
#+end_src

*** HTMLize

#+begin_src emacs-lisp
  (use-package htmlize :defer)
#+end_src

*** Toc Org

#+begin_src emacs-lisp
  (use-package toc-org :defer
    :hook (org-mode . toc-org-enable))
#+end_src

*** PDF Tools
#+begin_src emacs-lisp
  (use-package pdf-tools :defer)
#+end_src

** Powershell

#+begin_src emacs-lisp
  (use-package powershell
    :mode (("\\.ps1\\'" . powershell-mode)))
#+end_src

** Powerline

#+begin_src emacs-lisp
  (use-package powerline :defer 4
    :config
    (if window-system ; use-package if doesn't work for emacsclient
        (powerline-default-theme)))
#+end_src

