README.html

<div id="outline-container-sec-17-10-4" class="outline-4">
<h4 id="sec-17-10-4"><span class="section-number-4">17.10.4</span> Magit</h4>
<div class="outline-text-4" id="text-17-10-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">magit</span>
  <span style="color: #e5786d;">:bind*</span>
  (<span style="color: #95e454;">"C-x g"</span> . magit-status)
  <span style="color: #e5786d;">:config</span>
  (<span style="color: #8ac6f2; font-weight: bold;">when</span> (eq system-type 'windows-nt)
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> (file-readable-p <span style="color: #95e454;">"C:/Program Files/Git/bin/git.exe"</span>)
        (<span style="color: #8ac6f2; font-weight: bold;">setq</span> magit-git-executable <span style="color: #95e454;">"C:/Program Files/Git/bin/git.exe"</span>))
    (<span style="color: #8ac6f2; font-weight: bold;">when</span> (file-directory-p <span style="color: #95e454;">"C:/Program Files/Git/bin"</span>)
      (<span style="color: #8ac6f2; font-weight: bold;">setq</span> exec-path (add-to-list 'exec-path <span style="color: #95e454;">"C:/Program Files/Git/bin"</span>))
      (setenv <span style="color: #95e454;">"PATH"</span> (concat <span style="color: #95e454;">"C:\\Program Files\\Git\\bin;"</span> (getenv <span style="color: #95e454;">"PATH"</span>)))))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> magit-clone-set-remote.pushDefault t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> magit-completing-read-function 'magit-builtin-completing-read))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">magit-repos</span> <span style="color: #e5786d;">:ensure</span> nil
  <span style="color: #e5786d;">:bind*</span> (<span style="color: #95e454;">"C-x C-g"</span> . magit-list-repositories)
  <span style="color: #e5786d;">:config</span>
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> magit-repository-directories `((<span style="color: #95e454;">"~/"</span> . 0)
                                       (<span style="color: #95e454;">"~/src/gitlab"</span> . 10)))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> magit-repolist-columns
        '((<span style="color: #95e454;">"Name"</span> 25 magit-repolist-column-ident)
          <span style="color: #99968b;">;; </span><span style="color: #99968b;">("Version" 25 magit-repolist-column-version)</span>
          (<span style="color: #95e454;">"Pull"</span> 5 magit-repolist-column-unpulled-from-upstream)
          (<span style="color: #95e454;">"Push"</span> 5 magit-repolist-column-unpushed-to-upstream)
          (<span style="color: #95e454;">"Commit"</span> 8 magit-repolist-column-flag t)
          (<span style="color: #95e454;">"Path"</span> 99 magit-repolist-column-path))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-17-11" class="outline-3">
<h3 id="sec-17-11"><span class="section-number-3">17.11</span> Go mode</h3>
<div class="outline-text-3" id="text-17-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">go-mode</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:config</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/go-indent</span> ()
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> indent-tabs-mode 1)
    (<span style="color: #8ac6f2; font-weight: bold;">setq</span> tab-width 2))
  <span style="color: #e5786d;">:hook</span> (go-mode . my/go-indent))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-12" class="outline-3">
<h3 id="sec-17-12"><span class="section-number-3">17.12</span> Hungry delete</h3>
<div class="outline-text-3" id="text-17-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">hungry-delete</span> <span style="color: #e5786d;">:defer</span> 6
  <span style="color: #e5786d;">:diminish</span> hungry-delete-mode
  <span style="color: #e5786d;">:config</span> (global-hungry-delete-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-13" class="outline-3">
<h3 id="sec-17-13"><span class="section-number-3">17.13</span> JS2 mode</h3>
<div class="outline-text-3" id="text-17-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">js2-mode</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:hook</span>
  (js-mode . js2-minor-mode)
  (js2-mode . js2-imenu-extras-mode)
  <span style="color: #e5786d;">:mode</span>
  <span style="color: #95e454;">"\\.js\\'"</span>)

(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">js2-refactor</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:hook</span> (js2-mode . js2-refactor-mode)
  <span style="color: #e5786d;">:bind</span> (<span style="color: #e5786d;">:map</span> js2-mode-map
              (<span style="color: #95e454;">"C-k"</span> . js2r-kill))
  <span style="color: #e5786d;">:config</span> (js2r-add-keybindings-with-prefix <span style="color: #95e454;">"C-c C-j"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-14" class="outline-3">
<h3 id="sec-17-14"><span class="section-number-3">17.14</span> JSON</h3>
<div class="outline-text-3" id="text-17-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">json-mode</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:config</span>
  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my/json-mode-setup</span> ()
    (json-mode)
    (json-pretty-print (point-min) (point-max))
    (goto-char (point-min))
    (set-buffer-modified-p nil))
  (add-to-list 'auto-mode-alist
               '(<span style="color: #95e454;">"\\.json\\'"</span> . 'my/json-mode-setup)))

(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">json-navigator</span> <span style="color: #e5786d;">:defer</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-15" class="outline-3">
<h3 id="sec-17-15"><span class="section-number-3">17.15</span> Markdown</h3>
<div class="outline-text-3" id="text-17-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">markdown-mode</span>
  <span style="color: #e5786d;">:commands</span> (markdown-mode gfm-mode)
  <span style="color: #e5786d;">:mode</span> ((<span style="color: #95e454;">"README\\.md\\'"</span> . gfm-mode)
         (<span style="color: #95e454;">"\\.md\\'"</span> . gfm-mode)
         (<span style="color: #95e454;">"\\.markdown\\'"</span> . gfm-mode))
  <span style="color: #e5786d;">:init</span> (<span style="color: #8ac6f2; font-weight: bold;">setq</span> markdown-command <span style="color: #95e454;">"multimarkdown"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-16" class="outline-3">
<h3 id="sec-17-16"><span class="section-number-3">17.16</span> Node JS</h3>
<div class="outline-text-3" id="text-17-16">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">nodejs-repl</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:bind</span>
  (<span style="color: #e5786d;">:map</span> js2-mode-map
        (<span style="color: #95e454;">"C-x C-e"</span> . nodejs-repl-send-last-expression)
        (<span style="color: #95e454;">"C-c C-j"</span> . nodejs-repl-send-line)
        (<span style="color: #95e454;">"C-c SPC"</span> . nodejs-repl-send-region)
        (<span style="color: #95e454;">"C-c C-b"</span> . nodejs-repl-send-buffer)
        (<span style="color: #95e454;">"C-c C-f"</span> . nodejs-repl-load-file)
        (<span style="color: #95e454;">"C-c C-z"</span> . nodejs-repl-switch-to-repl)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-17" class="outline-3">
<h3 id="sec-17-17"><span class="section-number-3">17.17</span> Org</h3>
<div class="outline-text-3" id="text-17-17">
</div><div id="outline-container-sec-17-17-1" class="outline-4">
<h4 id="sec-17-17-1"><span class="section-number-4">17.17.1</span> Org Bullets</h4>
<div class="outline-text-4" id="text-17-17-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">org-bullets</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:hook</span> (org-mode . org-bullets-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-17-2" class="outline-4">
<h4 id="sec-17-17-2"><span class="section-number-4">17.17.2</span> HTMLize</h4>
<div class="outline-text-4" id="text-17-17-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">htmlize</span> <span style="color: #e5786d;">:defer</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-17-3" class="outline-4">
<h4 id="sec-17-17-3"><span class="section-number-4">17.17.3</span> Toc Org</h4>
<div class="outline-text-4" id="text-17-17-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">toc-org</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:hook</span> (org-mode . toc-org-enable))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-17-4" class="outline-4">
<h4 id="sec-17-17-4"><span class="section-number-4">17.17.4</span> PDF Tools</h4>
<div class="outline-text-4" id="text-17-17-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">pdf-tools</span> <span style="color: #e5786d;">:defer</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-17-18" class="outline-3">
<h3 id="sec-17-18"><span class="section-number-3">17.18</span> Powershell</h3>
<div class="outline-text-3" id="text-17-18">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">powershell</span>
  <span style="color: #e5786d;">:mode</span> ((<span style="color: #95e454;">"\\.ps1\\'"</span> . powershell-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-19" class="outline-3">
<h3 id="sec-17-19"><span class="section-number-3">17.19</span> Powerline</h3>
<div class="outline-text-3" id="text-17-19">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">powerline</span> <span style="color: #e5786d;">:defer</span> 4
  <span style="color: #e5786d;">:config</span>
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> window-system <span style="color: #99968b;">; </span><span style="color: #99968b;">use-package if doesn't work for emacsclient</span>
      (powerline-default-theme)))
</pre>
</div>
</div>
</div>
