README.org
** Projectile

#+begin_src emacs-lisp
  (use-package projectile :diminish projectile-mode
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :config
    (projectile-mode)
    ;; (setq projectile-completion-system 'ivy)
    (when (require 'magit nil t)
      (mapc #'projectile-add-known-project
            (mapcar #'file-name-as-directory (magit-list-repos)))
      ;; Optionally write to persistent `projectile-known-projects-file'
      (projectile-save-known-projects)))
#+end_src

** RESTClient

#+begin_src emacs-lisp
  (use-package restclient :defer)
#+end_src

** systemd

#+begin_src emacs-lisp
  (use-package systemd :defer
    :if (not (equal system-type 'windows-nt)))
#+end_src

** Terraform

#+begin_src emacs-lisp
  (use-package terraform-mode :defer)
#+end_src

** Web Mode

#+begin_src emacs-lisp
  (use-package web-mode
    :mode
    "\\.phtml\\'"
    "\\.tpl\\.php\\'"
    "\\.[agj]sp\\'"
    "\\.as[cp]x\\'"
    "\\.erb\\'"
    "\\.mustache\\'"
    "\\.djhtml\\'"
    "\\.html\\.twig\\'"
    "\\.html?\\'"
    "\\.php?\\'"
    "\\.css?\\'"
    :hook
    (web-mode . js2-minor-mode)
    :config
    (setq web-mode-content-type "jsx")
    (setq web-mode-enable-auto-quoting nil)
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-attr-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-enable-auto-pairing t)
    (setq web-mode-enable-css-colorization t)
    (setq web-mode-enable-block-face t)
    (setq web-mode-enable-part-face t)
    (setq web-mode-enable-comment-keywords t)
    (add-to-list 'web-mode-indentation-params '("lineup-args" . nil))
    (add-to-list 'web-mode-indentation-params '("lineup-calls" . nil))
    (add-to-list 'web-mode-indentation-params '("lineup-concats" . nil))
    (add-to-list 'web-mode-indentation-params '("lineup-ternary" . nil)))
#+end_src

** Writeable Grep

#+begin_src emacs-lisp
  (use-package wgrep :defer :commands wgrep
    :bind (:map grep-mode-map
                ("e" . wgrep-change-to-wgrep-mode)
                ("C-x C-q" . wgrep-change-to-wgrep-mode)))
#+end_src

** Which Key

#+begin_src emacs-lisp
  (use-package which-key :defer 5
    :diminish which-key-mode
    :config
    (which-key-mode))
#+end_src

** YAML

#+begin_src emacs-lisp
  (use-package yaml-mode :defer
    :config
    (remove-hook 'before-save-hook 'my/indent-buffer))
#+end_src

** Yasnippet

#+begin_src emacs-lisp
  (use-package yasnippet :defer
    :diminish yas-minor-mode
    :hook (prog-mode . yas-minor-mode))
#+end_src

*** Snippets

#+begin_src emacs-lisp
  (use-package yasnippet-snippets :defer)
#+end_src

*** Classic snippets

#+begin_src emacs-lisp
  (use-package yasnippet-classic-snippets :defer)
#+end_src

*** Custom Yasnippet snippets
**** Emacs Lisp snippets
***** Standard elisp boilerplate

#+begin_src emacs-lisp :tangle ~/.emacs.d/snippets/emacs-lisp-mode/boilerplate
  # -*- mode: snippet -*-
  # name: boilerplate
  # key: bp
  # --
  ;;; `(file-name-nondirectory (buffer-file-name))` --- ${1:summary} -*- lexical-binding: t; -*-

  ;;; Commentary:

  ;; ${2:commentary}

  ;; Copyright (C) `(format-time-string "%Y")` `user-full-name`
  ;; Author: `user-full-name` <`user-mail-address`>

  ;;; Code:
  $0
  (provide \'`(file-name-sans-extension (file-name-nondirectory (buffer-file-name)))`)
  ;; Local Variables:
  ;; indent-tabs-mode: nil
  ;; byte-compile-warnings: (not free-vars noruntime)
  ;; End:
  ;;; `(file-name-nondirectory (buffer-file-name))` ends here
#+end_src

