README.html

<div id="outline-container-sec-17-20" class="outline-3">
<h3 id="sec-17-20"><span class="section-number-3">17.20</span> Projectile</h3>
<div class="outline-text-3" id="text-17-20">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">projectile</span> <span style="color: #e5786d;">:diminish</span> projectile-mode
  <span style="color: #e5786d;">:bind-keymap</span>
  (<span style="color: #95e454;">"C-c p"</span> . projectile-command-map)
  <span style="color: #e5786d;">:config</span>
  (projectile-mode)
  <span style="color: #99968b;">;; </span><span style="color: #99968b;">(setq projectile-completion-system 'ivy)</span>
  (<span style="color: #8ac6f2; font-weight: bold;">when</span> (<span style="color: #8ac6f2; font-weight: bold;">require</span> '<span style="color: #e5786d;">magit</span> nil t)
    (mapc #'projectile-add-known-project
          (mapcar #'file-name-as-directory (magit-list-repos)))
    <span style="color: #99968b;">;; </span><span style="color: #99968b;">Optionally write to persistent `</span><span style="color: #e5786d;">projectile-known-projects-file</span><span style="color: #99968b;">'</span>
    (projectile-save-known-projects)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-21" class="outline-3">
<h3 id="sec-17-21"><span class="section-number-3">17.21</span> RESTClient</h3>
<div class="outline-text-3" id="text-17-21">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">restclient</span> <span style="color: #e5786d;">:defer</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-22" class="outline-3">
<h3 id="sec-17-22"><span class="section-number-3">17.22</span> systemd</h3>
<div class="outline-text-3" id="text-17-22">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">systemd</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:if</span> (not (equal system-type 'windows-nt)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-23" class="outline-3">
<h3 id="sec-17-23"><span class="section-number-3">17.23</span> Terraform</h3>
<div class="outline-text-3" id="text-17-23">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">terraform-mode</span> <span style="color: #e5786d;">:defer</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-24" class="outline-3">
<h3 id="sec-17-24"><span class="section-number-3">17.24</span> Web Mode</h3>
<div class="outline-text-3" id="text-17-24">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">web-mode</span>
  <span style="color: #e5786d;">:mode</span>
  <span style="color: #95e454;">"\\.phtml\\'"</span>
  <span style="color: #95e454;">"\\.tpl\\.php\\'"</span>
  <span style="color: #95e454;">"\\.[agj]sp\\'"</span>
  <span style="color: #95e454;">"\\.as[cp]x\\'"</span>
  <span style="color: #95e454;">"\\.erb\\'"</span>
  <span style="color: #95e454;">"\\.mustache\\'"</span>
  <span style="color: #95e454;">"\\.djhtml\\'"</span>
  <span style="color: #95e454;">"\\.html\\.twig\\'"</span>
  <span style="color: #95e454;">"\\.html?\\'"</span>
  <span style="color: #95e454;">"\\.php?\\'"</span>
  <span style="color: #95e454;">"\\.css?\\'"</span>
  <span style="color: #e5786d;">:hook</span>
  (web-mode . js2-minor-mode)
  <span style="color: #e5786d;">:config</span>
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-content-type <span style="color: #95e454;">"jsx"</span>)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-enable-auto-quoting nil)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-code-indent-offset 2)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-markup-indent-offset 2)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-attr-indent-offset 2)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-css-indent-offset 2)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-code-indent-offset 2)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-enable-auto-pairing t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-enable-css-colorization t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-enable-block-face t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-enable-part-face t)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> web-mode-enable-comment-keywords t)
  (add-to-list 'web-mode-indentation-params '(<span style="color: #95e454;">"lineup-args"</span> . nil))
  (add-to-list 'web-mode-indentation-params '(<span style="color: #95e454;">"lineup-calls"</span> . nil))
  (add-to-list 'web-mode-indentation-params '(<span style="color: #95e454;">"lineup-concats"</span> . nil))
  (add-to-list 'web-mode-indentation-params '(<span style="color: #95e454;">"lineup-ternary"</span> . nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-25" class="outline-3">
<h3 id="sec-17-25"><span class="section-number-3">17.25</span> Writeable Grep</h3>
<div class="outline-text-3" id="text-17-25">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">wgrep</span> <span style="color: #e5786d;">:defer</span> <span style="color: #e5786d;">:commands</span> wgrep
  <span style="color: #e5786d;">:bind</span> (<span style="color: #e5786d;">:map</span> grep-mode-map
              (<span style="color: #95e454;">"e"</span> . wgrep-change-to-wgrep-mode)
              (<span style="color: #95e454;">"C-x C-q"</span> . wgrep-change-to-wgrep-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-26" class="outline-3">
<h3 id="sec-17-26"><span class="section-number-3">17.26</span> Which Key</h3>
<div class="outline-text-3" id="text-17-26">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">which-key</span> <span style="color: #e5786d;">:defer</span> 5
  <span style="color: #e5786d;">:diminish</span> which-key-mode
  <span style="color: #e5786d;">:config</span>
  (which-key-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-27" class="outline-3">
<h3 id="sec-17-27"><span class="section-number-3">17.27</span> YAML</h3>
<div class="outline-text-3" id="text-17-27">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">yaml-mode</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:hook</span>
  (yaml-mode . hs-minor-mode)
  (yaml-mode . display-line-numbers-mode)
  <span style="color: #e5786d;">:config</span>
  (remove-hook 'before-save-hook 'my/indent-buffer))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-28" class="outline-3">
<h3 id="sec-17-28"><span class="section-number-3">17.28</span> Yasnippet</h3>
<div class="outline-text-3" id="text-17-28">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">yasnippet</span> <span style="color: #e5786d;">:defer</span>
  <span style="color: #e5786d;">:diminish</span> yas-minor-mode
  <span style="color: #e5786d;">:hook</span> (prog-mode . yas-minor-mode))
</pre>
</div>
</div>

<div id="outline-container-sec-17-28-1" class="outline-4">
<h4 id="sec-17-28-1"><span class="section-number-4">17.28.1</span> Snippets</h4>
<div class="outline-text-4" id="text-17-28-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">yasnippet-snippets</span> <span style="color: #e5786d;">:defer</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-28-2" class="outline-4">
<h4 id="sec-17-28-2"><span class="section-number-4">17.28.2</span> Classic snippets</h4>
<div class="outline-text-4" id="text-17-28-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8ac6f2; font-weight: bold;">use-package</span> <span style="color: #e5786d;">yasnippet-classic-snippets</span> <span style="color: #e5786d;">:defer</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17-28-3" class="outline-4">
<h4 id="sec-17-28-3"><span class="section-number-4">17.28.3</span> Custom Yasnippet snippets</h4>
<div class="outline-text-4" id="text-17-28-3">
</div><ol class="org-ol"><li><a id="sec-17-28-3-1" name="sec-17-28-3-1"></a>Emacs Lisp snippets<br ><ol class="org-ol"><li><a id="sec-17-28-3-1-1" name="sec-17-28-3-1-1"></a>Standard elisp boilerplate<br ><div class="outline-text-6" id="text-17-28-3-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"># -*- mode: snippet -*-
