README.html
# name: boilerplate
# key: bp
# --
<span style="color: #99968b;">;;; </span><span style="color: #99968b;">`(file-name-nondirectory (buffer-file-name))` --- ${1:summary} -*- lexical-binding: t; -*-</span>

<span style="color: #99968b;">;;; </span><span style="color: #99968b;">Commentary:</span>

<span style="color: #99968b;">;; </span><span style="color: #99968b;">${2:commentary}</span>

<span style="color: #99968b;">;; </span><span style="color: #99968b;">Copyright (C) `(format-time-string "%Y")` `user-full-name`</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">Author: `user-full-name` &lt;`user-mail-address`&gt;</span>

<span style="color: #99968b;">;;; </span><span style="color: #99968b;">Code:</span>
$0
(<span style="color: #8ac6f2; font-weight: bold;">provide</span> <span style="color: #e5786d;">\'</span>`(file-name-sans-extension (file-name-nondirectory (buffer-file-name)))`)
<span style="color: #99968b;">;; </span><span style="color: #99968b;">Local Variables&#58;</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">indent-tabs-mode: nil</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">byte-compile-warnings: (not free-vars noruntime)</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">End:</span>
<span style="color: #99968b;">;;; </span><span style="color: #99968b;">`(file-name-nondirectory (buffer-file-name))` ends here</span>
</pre>
</div>
</div>
</li>

<li><a id="sec-17-28-3-1-2" name="sec-17-28-3-1-2"></a>Package elisp boilerplate<br ><div class="outline-text-6" id="text-17-28-3-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"># -*- mode: snippet -*-
# name: boilerplate-package
# key: bpp
# --
<span style="color: #99968b;">;;; </span><span style="color: #99968b;">`(file-name-nondirectory (buffer-file-name))` --- ${1:summary} -*- lexical-binding: t; -*-</span>

<span style="color: #99968b;">;;; </span><span style="color: #99968b;">Commentary:</span>

<span style="color: #99968b;">;; </span><span style="color: #99968b;">${2:commentary}</span>

<span style="color: #99968b;">;; </span><span style="color: #99968b;">Copyright (C) `(format-time-string "%Y")` `user-full-name`</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">Author: `user-full-name` `user-mail-address`</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">Version: 0.0.1</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">Package-Requires: ${3:depandancies}</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">URL: https://github.com/tslight/${4:repo}</span>

<span style="color: #99968b;">;;; </span><span style="color: #99968b;">Code:</span>
$0
(<span style="color: #8ac6f2; font-weight: bold;">provide</span> <span style="color: #e5786d;">\'</span>`(file-name-sans-extension (file-name-nondirectory (buffer-file-name)))`)
<span style="color: #99968b;">;; </span><span style="color: #99968b;">Local Variables&#58;</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">indent-tabs-mode: nil</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">byte-compile-warnings: (not free-vars noruntime)</span>
<span style="color: #99968b;">;; </span><span style="color: #99968b;">End:</span>
<span style="color: #99968b;">;;; </span><span style="color: #99968b;">`(file-name-nondirectory (buffer-file-name))` ends here</span>
</pre>
</div>
</div>
</li></ol>
</li></ol>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Toby Slight</p>
<p class="date">Created: 2020-12-24 Thu 05:15</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="http://orgmode.org">Org-mode</a> 9.3)</p>
</div>
</footer>
</body>
</html>
